{
    "meta": {
        "description": "Interpretive texts for the three pillars (Sun, Moon, Ascendant) at four energy levels (low/medium/high/exalted). Different levels do not imply good or bad, but rather differences in the maturity and visibility of energy operation.",
        "levels_meaning": {
            "general": {
                "low": "The energy has not been stably utilized, with expression hindered or in a defensive state; it is prone to hesitation, repression, or deviation from the essence.",
                "medium": "The energy is relatively smooth, capable of reflecting core characteristics, tending towards balance and controllability.",
                "high": "The energy is strong and outward - released, with obvious advantages, but prone to side - effects of over - exertion or imbalance.",
                "exalted": "The energy is used transparently and wisely, capable of inspiring others and setting an exemplary effect."
            },
            "sun": "Represents self - will, life direction, and the way of using one's radiance. The level reflects the maturity of self - assertion and goal - driven motivation.",
            "moon": "Represents emotional habits, attachment patterns, and sense of security. The level reflects the operational level of emotional regulation, sensitivity, and nurturing ability.",
            "ascendant": "Represents external temperament, way of dealing with the world, and starting style. The level reflects the clarity, boundaries, and adaptability of the first impression."
        },
        "field_definitions": {
            "inner": "Self - experience of internal psychological states, motivations, and needs.",
            "outer": "Visible external temperament, behavior, and others' first impression.",
            "advice": "Specific suggestions for using energy more stably and effectively."
        },
        "usage_notes": [
            "This content is for character reference, not for fate determination; a complete interpretation requires consideration of the overall astrolabe and transits.",
            "Different situations and life stages may present different levels; self - awareness can promote the flow from low to high levels.",
            "If it does not match your self - experience, give priority to your true feelings and life feedback."
        ]
    },
    "sign_info": {
        "Aries": {
            "overview": "As the starting point of the twelve zodiac signs, Aries carries the primordial energy of the universe's \"prime mover\" - it is the guardian of the vernal equinox, symbolizing the courage and vitality of all things coming back to life and breaking through the soil. As a cardinal fire sign, Aries is ruled by Mars, and is innately equipped with the warrior - like action, the pioneer - like pioneering spirit, and the fearless mettle of a开拓者 (trailblazer). They don't wait for permission, nor do they rely on plans. Instead, they ignite the flame of action by intuition, cut through the chaos, and utter the first cry in the silence. The core theme of Aries is \"becoming oneself\" - starting from \"I\", they emphasize self - assertion, independent will, and instant response. This is not selfishness, but a sacred mission bestowed upon them by the universe: to take the lead in acting when the collective has not yet awakened, and to set off resolutely when others are hesitant. Their courage doesn't mean the absence of fear, but choosing to move forward in the face of fear; their impulsiveness is not recklessness, but the most honest response to vitality. At a practical level, Aries are good at initiating projects, breaking deadlocks, and igniting enthusiasm. They are the spark - starters in a team, the tipping - points in a transformation, and the problem - solvers in a difficult situation. Although they sometimes encounter setbacks due to impatience or excessive self - centeredness, it is precisely this spirit of \"preferring to fail rather than stand still\" that makes them keep fighting despite repeated defeats and become more resilient in the battlefield of life.",
            "element": "Fire",
            "modality": "Cardinal",
            "polarity": "Positive",
            "traditional_ruler": "Mars",
            "modern_ruler": "Mars",
            "archetypes": [
                "Warrior",
                "Pioneer",
                "Trailblazer"
            ],
            "keywords": [
                "Direct",
                "Drive",
                "Brave",
                "Spontaneous",
                "Competitive",
                "Beginning"
            ]
        },
        "Taurus": {
            "overview": "When the flowers are just beginning to bloom in spring and all things are eager to take root, Taurus quietly arrives like the mother earth - it is the guardian of the second house of the zodiac, symbolizing the sacred transition of life from sprouting to stability, from impulsiveness to sedimentation. As a fixed earth sign, Taurus is ruled by Venus, the goddess of love and beauty, integrating the pleasure of the senses, the abundance of material things, and the peace of the soul to construct the firmest and gentlest \"anchor of existence\" in the universe.\nThe essence of Taurus is \"creating lasting value in a turbulent world\". They don't pursue fleeting applause but are committed to building tangible entities that can be touched, inherited, and nourish life - whether it's wealth, art, home, relationships, or inner peace. Their \"fixity\" is not stubbornness but loyalty to their promises; their \"slowness\" is not dullness but reverence for quality. In a fast - paced era, Taurus is the one who dares to say \"no\" - not swayed by trends, not pressured by anxiety, only following their inner rhythm and precipitating true value over time.\nTaurus takes the senses as their belief and the body as their temple. They know how to appreciate the aroma of coffee in the morning light, the touch of fabric under their fingertips, and the warmth of their lover's whispers - these are not luxuries but the most fundamental sacred rituals of life. Their pursuit of \"beauty\" and \"comfort\" is actually the defense of the peace of the soul. Precisely because of this, Taurus are often the patrons of art, the guardians of nature, the stabilizers of the economy, and the ballast of emotions.",
            "element": "Earth",
            "modality": "Fixed",
            "polarity": "Negative",
            "traditional_ruler": "Venus",
            "modern_ruler": "Venus",
            "archetypes": [
                "Gardener",
                "Builder",
                "Guardian"
            ],
            "keywords": [
                "Stability",
                "Endurance",
                "Senses",
                "Value",
                "Resources",
                "Persistence"
            ]
        },
        "Gemini": {
            "overview": "As the light and shadow interlace in the late spring and early summer, Gemini arrives gracefully like a whisper in the wind or a messenger shuttling through the forest - it is the guardian of the third house of the zodiac, symbolizing the awakening of consciousness, the birth of language, and the \"web of connection\" among all things. As a mutable air sign, ruled by Mercury, the god of speed, Gemini is the most agile carrier of thoughts, the most perceptive information node, and the most tireless explorer in the universe. They do not possess the truth but shuttle between truths; they do not stick to answers but constantly raise new questions.\nThe essence of Gemini is \"understanding the world in flux\". They use curiosity as their engine, communication as their path, and learning as their breath. For them, the world is a book that can never be fully read, an endless conversation, and a puzzle that is constantly being re - assembled. They are good at discerning patterns in fragments, capturing meaning in the hubbub, and building bridges among differences. Their \"variability\" is not superficiality but respect for diverse realities; their \"capriciousness\" is not unreliability but the wisdom of refusing to be confined by a single perspective.\nGemini are natural storytellers, liaisons, and weavers of knowledge. They can freely switch between academia and gossip, establish metaphors between technology and mythology, and spark conversations among strangers. Their sense of humor is a survival strategy, their quick - wittedness is a cognitive weapon, and their desire to express is the oxygen of the soul. In the era of information explosion, Gemini are both disseminators of information and filters of meaning - they remind us that true communication is not indoctrination but resonance; true learning is not memorization but connection.",
            "element": "Air",
            "modality": "Mutable",
            "polarity": "Positive",
            "traditional_ruler": "Mercury",
            "modern_ruler": "Mercury",
            "archetypes": [
                "Messenger",
                "Storyteller",
                "Liaison"
            ],
            "keywords": [
                "Curiosity",
                "Quick - wittedness",
                "Variability",
                "Communication",
                "Learning",
                "Connection"
            ]
        },
        "Cancer": {
            "overview": "As the early summer arrives, when all things are abundant yet in most need of protection, Cancer descends gently like the moonlight - it is the guardian of the fourth house of the zodiac, symbolizing the haven of the soul, the source of emotions, and the very first cradle of life. As a cardinal water sign, ruled by the Moon, the \"mirror of emotions\", Cancer is the most sensitive, nurturing, and maternal (regardless of gender) energy among the twelve zodiac signs. They don't build empires but safeguard homes; they don't seek applause but yearn for a sense of belonging; they don't conquer the world but melt the ice of the world with their tenderness.\nThe essence of Cancer is \"anchoring the existence of love in the flowing emotions\". They use feelings as their navigation, memories as their map, and protection as their instinct. For them, a sense of security is not built by material possessions but by \"being understood\"; a sense of belonging is not an address coordinate but \"having a place to rest the heart\". They remember an off - hand joke you made three years ago and the curve of your shoulder when you cried - because emotions are the yardstick by which they measure the world.\nCancer are natural \"soul carers\", \"guardians of emotional memories\", and \"weavers of the spirits of the dwelling\". They are adept at creating an atmosphere, listening to silence, and healing wounds. Their tenderness is not weakness but the empathetic power that can penetrate armor; their withdrawal is not cowardice but the sacred protection of energy boundaries. In a world where indifference accelerates, Cancer is the one who leaves a light on for you, warms a bowl of soup, and remembers the stories of your childhood - they use the small daily rituals to combat the desolation of the world.",
            "element": "Water",
            "modality": "Cardinal",
            "polarity": "Negative",
            "traditional_ruler": "Moon",
            "modern_ruler": "Moon",
            "archetypes": [
                "Carer",
                "Guardian Shrine",
                "Master of the Dwelling"
            ],
            "keywords": [
                "Tenderness",
                "Protection",
                "Empathy",
                "Belonging",
                "Memory",
                "Nurturing"
            ]
        },
        "Leo": {
            "overview": "When the midsummer sun hangs high at the zenith, and all things stretch, bloom, and burn with the most intense fervor in the light - Leo makes a grand entrance like a crowned king, the protagonist at the center of the stage, or the throbbing pulse of the heart of the universe. As the guardian of the fifth house of the zodiac, Leo is the only sign among the twelve zodiac signs directly ruled by the Sun. It bears the purest creative fire of the universe, the light of self - awareness, and the song of the glory of life. They don't seek attention; rather, they are the very source of light by birth. They don't long for applause; instead, they illuminate others with their very existence.\nThe essence of Leo is \"taking the heart as the throne and creation as the scepter\". As a fixed fire sign, they possess undying enthusiasm, a firm self, and a generous soul. Their \"fixity\" is not stubbornness but loyalty to their beliefs; their \"self - centeredness\" is not narcissism but a solemn proclamation of the uniqueness of life. In an era when everyone hurries along with their heads down, hiding their sharpness, Leo dares to stand tall and say, \"Here I am. I deserve to be seen, and my love deserves a response.\"\nLeo are natural \"kings\", \"artists\", and \"spiritual leaders\". They express the truth through drama, convey love with generosity, and endow the ordinary with divinity through creativity. They can be the singer on the stage, the tutor in the classroom, the pillar in the family, or the sun among friends - as long as their hearts are burning, the world becomes a little warmer. Their vulnerability doesn't lie in failure but in not being recognized; their fear doesn't lie in challenges but in being ignored. Because for them, love is not taking but sharing; glory is not a title but the resonance when the soul is truly \"seen\".",
            "element": "Fire",
            "modality": "Fixed",
            "polarity": "Positive",
            "traditional_ruler": "Sun",
            "modern_ruler": "Sun",
            "archetypes": [
                "King",
                "Artist",
                "Leader"
            ],
            "keywords": [
                "Confidence",
                "Brilliance",
                "Creation",
                "Generosity",
                "Center",
                "Glory"
            ]
        },
        "Virgo": {
            "overview": "In the quiet season of late summer and early autumn, when all things transition from prosperity to harvest, Virgo arrives quietly like the morning dew - she is the guardian of the sixth house of the zodiac, symbolizing the earth's final tidying before the harvest and the soul's self - purification before reaching perfection. As a mutable earth sign, ruled by Mercury, the god of wisdom and service, Virgo is the most precise systems engineer, the most devout priest of details, and the most selfless healer of life in the universe. She doesn't pursue grand narratives but bends over every inch of texture; she doesn't yearn for the limelight but quietly makes the world cleaner, more orderly, and more functional because of her existence.\nThe essence of Virgo is \"carving the divine in imperfection\". Her \"mutability\" is not restlessness but an unceasing pursuit of optimization; her \"analysis\" is not nitpicking but reverence for truth and efficiency. Establishing structure in chaos, restoring rhythm in disorder, and seeing potential in the incomplete - this is her inborn talent and the mission of her soul. The ruler and compass in her hand measure not others but herself; the standards in her heart serve not vanity but a higher harmony.\nVirgo is a natural \"analyst\", \"healer\", and \"craftsman\". She can spot deviations in data, imbalances in the body, redundancies in processes, and dust in the soul, and with gentle yet firm hands, she mends the cracks in the world stitch by stitch. Her service is not sacrifice but a practice of love; her perfectionism is not harshness but respect for the essence of life - she knows that true divinity lies in the clean - wiped window sill, the calibrated schedule, the gently - listened - to ailments, and the plan that finally becomes clear after repeated revisions.",
            "element": "Earth",
            "modality": "Mutable",
            "polarity": "Negative",
            "traditional_ruler": "Mercury",
            "modern_ruler": "Mercury",
            "archetypes": [
                "Analyst",
                "Healer",
                "Craftsman"
            ],
            "keywords": [
                "Meticulous",
                "Pragmatic",
                "Analysis",
                "Service",
                "Improvement",
                "Order"
            ]
        },
        "Libra": {
            "overview": "When the autumnal equinox arrives and day and night achieve a sacred equilibrium on either end of the scale, Libra makes an elegant entrance like a judge draped in a moonlight - colored robe, a poet holding a rose and a code of laws, or a dancer weaving harmonies amidst disputes. As the guardian of the seventh house of the zodiac, Libra is the only sign among the twelve that takes an \"object\" as its symbol - that scale hanging at the center of the universe is not an indifferent measuring tool but the soul's eternal yearning for \"relationship\", \"beauty\", and \"justice\". Steered by Venus, the goddess of love and beauty, Libra fuses the rational speculation of the air element with Venus's sensuous aesthetics into a noble art of living: creating harmony in opposition, establishing order in chaos, and fostering understanding in conflict.\nThe essence of Libra is \"using relationships as a mirror to reflect the symmetrical beauty of the universe\". As a cardinal air sign, they are innately the initiators of relationships, the contractors of agreements, and the legislators of aesthetics. Their \"cardinality\" is not self - centeredness but taking the lead in building bridges; their \"hesitation\" is not weakness but respect and weighing of multiple perspectives; their \"pursuit of perfection\" is not vanity but a devout belief in \"higher harmony\". In a world that is increasingly polarized and torn by noise, Libra is the one who softly says \"Let's talk\", the one who places flowers amidst quarrels, and the one who redraws blueprints on ruins.\nLibra are natural \"diplomats\", \"judges\", and \"designers\". They can hear the unspoken demands in silence, see the commonalities in opposition, and perceive the rhythms in chaos. They dissolve hostility with words, soften boundaries with aesthetics, and endow interactions with dignity through etiquette. Their justice is not cold legal provisions but empathetic understanding with warmth; their aesthetics is not ostentatious decoration but the external manifestation of inner order; their love is not possession but the dance of two souls in equality.",
            "element": "Air",
            "modality": "Cardinal",
            "polarity": "Positive",
            "traditional_ruler": "Venus",
            "modern_ruler": "Venus",
            "archetypes": [
                "Diplomat",
                "Judge",
                "Designer"
            ],
            "keywords": [
                "Harmony",
                "Aesthetics",
                "Negotiation",
                "Justice",
                "Relationship",
                "Etiquette"
            ]
        },
        "Scorpio": {
            "overview": "As autumn deepens, all things shed their glorious attire, and the earth begins to draw inwards and sink, Scorpio arrives quietly like an obsidian in the dark night, a flame in the abyss, or the last low cry of a phoenix before its self - immolation. It is the guardian of the eighth house of the zodiac, symbolizing the most subtle corners of the soul, the most intense transformation of life, and the purest exchange of energy. As a fixed water sign, it is endowed with the will to act by Mars, the primeval god of war, and further empowered with the ultimate power of destruction and rebirth by Pluto, the lord of the underworld. Scorpio doesn't \"like the dark\"; rather, they are those who dare to plunge into the darkness and bring back light from it. They are not \"controlling others\"; instead, they are alchemists who understand the laws of energy flow and reshape the trajectory of fate with their will. The essence of Scorpio is \"extracting eternal life from death and rebuilding divinity from ruins\". Their \"fixity\" is not stubbornness but absolute loyalty to the truth. Their \"control\" is not a desire for power but the sacred defense of energy boundaries. Their \"silence\" is not indifference but an awareness that words cannot carry the weight of the soul. In an era when everyone pursues superficial harmony and avoids deep - seated conflicts, Scorpio is the one who dares to tear off the pretense, look directly at the wound, and sew up the soul with their own hands - they don't offer placebos; they offer the art of rebirth.\nScorpio are natural \"investigators\", \"secret - keepers\", and \"those who achieve nirvana\". They can smell the scent of lies, see through the cracks in disguises, and sense unspoken traumas. They are not satisfied with \"knowing\"; they seek \"thorough enlightenment\". They don't pursue \"possessing\"; they strive for \"fusion\". They don't accept \"ending\"; they aim for \"transformation\". Their love is a sacrifice, their hatred is a purification, and their trust is the key to surrendering the soul. In intimate relationships, they are not takers but co - cultivators of the soul. In times of crisis, they are not fugitives but those reborn from the fire.",
            "element": "Water",
            "modality": "Fixed",
            "polarity": "Negative",
            "traditional_ruler": "Mars",
            "modern_ruler": "Pluto",
            "archetypes": [
                "Investigator",
                "Secret - keeper",
                "One who achieves nirvana"
            ],
            "keywords": [
                "Depth",
                "Will",
                "Insight",
                "Boundary",
                "Control",
                "Rebirth"
            ]
        },
        "Sagittarius": {
            "overview": "As winter approaches and all things draw in, Sagittarius bursts out like an arrow leaving the bow, piercing through the air - traversing mountains and seas, crossing boundaries, and aiming straight at the beam of light named \"meaning\" at the end of the sky. As the guardian of the ninth house of the zodiac, Sagittarius is the most fearless traveler, the most generous idealist, and the most passionate seeker of truth among the twelve zodiac signs. Ruled by Jupiter, the god of abundance and wisdom, Sagittarius bears the grandest blessings of the universe: the courage to expand, the power of faith, and the eternal hunger for the \"higher truth\". They don't escape from reality but refuse to be imprisoned by it. They are not blindly optimistic but choose to believe in the existence of light even in chaos.\nThe essence of Sagittarius is \"understanding eternity in movement and seeking divinity beyond boundaries\". As a mutable fire sign, they use faith as fuel, the distance as their coordinate, and philosophical thinking as their compass. Their \"mutability\" is not restlessness but a celebration of the diversity of life. Their \"frankness\" is not an offense but a natural immunity to hypocrisy and narrow - mindedness. Their \"adventure\" is not recklessness but a sacred pilgrimage of the soul to freedom. In an increasingly fragmented and anxiety - ridden world of involution, Sagittarius is the one who opens the curtain and shouts, \"Let's go!\", the one who tells jokes in the ruins, and the one who can ignite hope in others with an old book, a train ticket, and a maxim.\nSagittarius are natural \"travelers\", \"mentors\", and \"archers\". They measure the world with their footsteps, convey wisdom through stories, and dispel fear with laughter. Their optimism is not ignorance but a choice to believe after experiencing hardships. Their freedom is not indulgence but an infinite expansion of the spiritual realm. Their philosophical thinking is not empty talk but the ability to turn suffering into fables and experiences into aphorisms. In classrooms, on journeys, by the campfire, on the streets of foreign countries - they can always turn \"knowledge\" into \"enlightenment\" and \"experiences\" into \"gifts\".",
            "element": "Fire",
            "modality": "Mutable",
            "polarity": "Positive",
            "traditional_ruler": "Jupiter",
            "modern_ruler": "Jupiter",
            "archetypes": [
                "Traveler",
                "Mentor",
                "Archer"
            ],
            "keywords": [
                "Freedom",
                "Optimism",
                "Foresight",
                "Adventure",
                "Philosophical thinking",
                "Expansion"
            ]
        },
        "Capricorn": {
            "overview": "When winter reaches its deepest point, all things are silent, and the earth is covered with frost and snow, Capricorn makes a firm entrance like a solitary figure on the mountain peak, footprints on the stone steps, or a silent brick on the millennial city wall. It is the guardian of the tenth house of the zodiac, symbolizing the soul's reverence for \"height\", faith in \"structure\", and submission to and mastery of \"time\". Ruled by Saturn, the god of cosmic discipline, Capricorn bears the heaviest and most noble mission among the twelve zodiac signs: establishing order in chaos, creating meaning in nothingness, and pursuing immortality in the transient. They are not unfamiliar with pleasure, but they know that true joy is born after fulfilling responsibilities. They are not without emotions, but they integrate their love into bricks, steps, and systems, enabling future generations to stand firmly.\nThe essence of Capricorn is \"taking time as an ally and responsibility as a crown\". As a cardinal earth sign, they are natural founders, system - builders, and sculptors of reality. Their \"cardinality\" is not self - centeredness but taking the lead in bearing responsibilities. Their \"coldness\" is not lack of sentiment; rather, their emotions are deeply hidden beneath actions, like the living water hidden in a glacier. Their \"slowness\" is not dullness but absolute reverence for the foundation - they know that all towering buildings start from a single spade of earth. In an era when everyone pursues quick success, is keen on traffic, and avoids responsibilities, Capricorn is the one who silently strengthens the foundation, the one who turns to climb the next peak long before the applause rings out, and the one who spends a lifetime just to make the world a little more solid than when they came.\nCapricorn are natural \"managers\", \"strategists\", and \"builders\". They can see a blueprint in the ruins, find a path within limitations, and remain clear - headed under pressure. Their authority does not come from titles but from irreplaceable expertise and impeccable integrity. Their success is not accidental luck but day - after - day, year - after - year self - discipline and self - correction. Their loneliness is not being ostracized but choosing to dedicate time to a more long - term mission. They are not good at saying \"I love you\", but they will build a roof to shelter you from wind and rain. They do not easily promise \"forever\", but once they do, they fulfill their promise with their lives.",
            "element": "Earth",
            "modality": "Cardinal",
            "polarity": "Negative",
            "traditional_ruler": "Saturn",
            "modern_ruler": "Saturn",
            "archetypes": [
                "Manager",
                "Strategist",
                "Builder"
            ],
            "keywords": [
                "Responsibility",
                "Self - discipline",
                "Step",
                "Reality",
                "Authority",
                "Endurance"
            ]
        },
        "Aquarius": {
            "overview": "When winter is almost over and spring has not yet sprouted, and the world is still covered by the frost of the old order, Aquarius arrives quietly like a bolt of lightning striking down from the sky, a blue light suddenly illuminating in a laboratory, or the first voice in a future parliament raising its hand and saying \"This is wrong\". As the guardian of the eleventh house of the zodiac, Aquarius is the most radical reformer, the most lucid outsider, and the most farsighted prophet of collective consciousness among the twelve zodiac signs. Endowed with structure and responsibility by Saturn, the god of tradition, and further empowered with subversion and awakening by Uranus, the god of revolution, Aquarius stands on the fault line of time, holding the laws of the past in one hand and igniting the spark of the future in the other. They are not \"unsociable\"; rather, they refuse to be kidnapped by the low - dimensional group consciousness. They are not \"indifferent\"; instead, they elevate love to the frequency of all humanity and even the entire universe.\nThe essence of Aquarius is \"reconstructing the soul of the group in an independent stance\". As a fixed air sign, they possess the freest thoughts, the firmest beliefs, and the most uncompromising standards of truth. Their \"fixity\" is not stubbornness but absolute loyalty to higher ideals. Their \"alienation\" is not heartlessness but a means to see the whole picture of the system more clearly. Their \"eccentricity\" is not a bid for attention but a natural proclamation that the soul refuses to be cast in a standardized mold. In an era when everyone is沉迷 (addicted) to individual emotions, trapped by short - term interests, and afraid of change, Aquarius is the one who dares to say \"We can be better\", the one who draws a new blueprint on the ruins, and the one who shakes the foundation of the old world with technology, art, systems, or a single glance.\nAquarius are natural \"inventors\", \"futurists\", and \"divine outsiders\". They can spot the loopholes in social systems, foresee the abyss of technological ethics, and sense the shift in the collective subconscious. Their love is not limited to one person or thing but extends to \"humanity\", \"species\", \"civilization\", and \"the interstellar\". Their loneliness is not a defect but the fate of a prophet - because true revolutionaries are often misunderstood before they are understood. They don't seek to be embraced but to be \"heard\"; they don't yearn to be adored but for their ideas to be \"practiced\". In laboratories, on the streets, in codes, and on the platforms of utopias - they are always sowing the seeds of what \"seems crazy now but will become common sense in the future\".",
            "element": "Air",
            "modality": "Fixed",
            "polarity": "Positive",
            "traditional_ruler": "Saturn",
            "modern_ruler": "Uranus",
            "archetypes": [
                "Inventor",
                "Futurist",
                "Outsider"
            ],
            "keywords": [
                "Independence",
                "Foresight",
                "Uniqueness",
                "Humanity",
                "System",
                "Breaking the old and establishing the new"
            ]
        },
        "Pisces": {
            "overview": "When winter gives way to spring, ice melts and snow thaws, and all things quietly revive in the hazy water vapor, Pisces arrives like a harp humming in the morning mist, a glowing spiritual fish in the deep sea, or the first ray of light filtering through the stained - glass window of a church - silently, yet permeating everything. As the guardian of the twelfth house of the zodiac, Pisces is the softest yet most vast energy among the twelve zodiac signs, symbolizing the ultimate dissolution of the soul, the poetic melting of boundaries, and the sacred return of individual consciousness into the sea of the universe. Endowed with faith and expansion by Jupiter, the god of tradition, and further empowered with clairvoyance, compassion, and unconditional love by Neptune, the god of dreams, Pisces is not born for the \"this - side world\" but is a ferryman cruising between reality and the spiritual realm, the self and all beings, pain and redemption. They don't \"escape from reality\"; rather, they perceive the illusion of reality earlier than anyone else. They are not \"emotional\"; it's just that their souls have no skin and are directly immersed in the cosmic sea of emotions.\nThe essence of Pisces is \"achieving the unity of all things by dissolving the self\". As a mutable water sign, they are natural empaths, interpreters of dreams, and absorbers of pain. Their \"mutability\" is not vacillation but a water - like adaptation to the forms of all things. Their \"ambiguity\" is not chaos but an integrity that refuses to be sliced by the binary world. Their \"sacrifice\" is not weakness but a deep understanding of the cosmic truth that \"I am you, and you are me\". In an era when everyone builds walls for self - protection, pursues clear boundaries, and fears losing control, Pisces is the one who actively tears down the walls, the one who silently offers a spiritual handkerchief when others are crying, and the miracle - maker who makes strangers feel \"fully understood\" with a poem, a melody, or a glance.\nPisces are natural \"poets\", \"healers\", and \"mystics\". They can hear the silent cries, see the invisible scars, and sense the whispers of parallel worlds. Their art is not decoration but the manifestation of the soul. Their compassion is not almsgiving but the resonance of energy. Their spirituality is not escape but a conscious surrender to a higher reality. They don't seek to be \"seen\"; instead, they are willing to be a transparent medium, allowing light, love, beauty, pain, and enlightenment to pass freely through themselves and flow to where it is more needed. Their love has no conditions because for them, love is like breathing, an essential part of their existence.",
            "element": "Water",
            "modality": "Mutable",
            "polarity": "Negative",
            "traditional_ruler": "Jupiter",
            "modern_ruler": "Neptune",
            "archetypes": [
                "Poet",
                "Healer",
                "Mystic"
            ],
            "keywords": [
                "Empathy",
                "Imagination",
                "Integration",
                "Tolerance",
                "Spirituality",
                "Dissolution"
            ]
        }
    },
    "sun": {
        "Aries": {
            "low": {
                "inner": "Deep in your soul lives a sleeping warrior — he yearns to charge forward, to name his own territory, and to leave the first stroke on the canvas of the world. However, the armor of reality is too heavy, and the echoes of childhood are too loud. You've learned to hide the clarion call in your chest and fold the battle flag into a bookmark. It's not that you lack courage, but that your courage is wrapped layer by layer in the fog of “what if I fail”. It's not that you don't want to set off, but you always hear the whisper of “wait a little longer” before the starting line. Your self - assertion is like a flickering lamp in the wind. There's light, but you dare not let it shine far and wide.",
                "outer": "In the eyes of others, you are gentle, cautious, and even a bit “unlike Aries”. You don't actively fight for the spotlight, don't easily express “I want”, and in a group, you're more like a quiet observer than a charging standard - bearer. People may mistakenly think you lack enthusiasm, but in fact, you've just put the flames in the cellar — not extinguished, but waiting for the right fuse.",
                "advice": "Start with “micro - uprisings” — do one small thing “just for yourself” every day: say “no”, choose a path no one else takes, buy a small thing that's “useless but appealing”. You don't need to make a big splash; just let the inner warrior “draw the sword for five minutes” every day. Record every moment of “I did it”; they are the bricks for you to rebuild your confidence. Remember: courage is not the absence of fear, but moving forward in spite of it. Your fire will eventually reignite in action."
            },
            "medium": {
                "inner": "In your heart lives a pioneer who understands strategy — having both the impulse to draw the sword and the wisdom to sheath it. You know when to ignite the engine and when to step on the brakes. You enjoy the thrill of the sprint and also respect the necessity of rest. Your self - awareness flows naturally like a stream: neither deliberately flamboyant nor deliberately suppressed. You understand “who I am” and also allow “who I'm still becoming”. Adventure, for you, is not recklessness but a gentle exploration of the boundaries of life.",
                "outer": "You carry a “just - right” vitality in the crowd — not scorching, but warm; not noisy, but with a distinct presence. You can take the lead, but don't monopolize the right to speak. You dare to try, but will assess the risks. Others appreciate your directness and trust your sense of proportion. You are a reliable “start button” in the team and a “problem - solver” worthy of trust in times of crisis.",
                "advice": "Keep this dynamic balance, but be vigilant that “over - rationalization” doesn't weaken Aries' original vitality. Occasionally, allow yourself to love, be impulsive, and run for pure joy “without considering the consequences”. Your calmness is armor; don't let it become a cage. Let your intuition take over the steering wheel occasionally — you'll find that some sceneries only belong to journeys without maps."
            },
            "high": {
                "inner": "Your soul is an eternal wildfire — burning with the primitive desires of “being the first”, “defining oneself”, and “conquering the unknown”. You don't need external recognition to confirm your existence because your existence itself is a declaration. Challenges are your oxygen, competition is your game, and every “impossibility” is an invitation in your eyes. Your will is as hot as lava, pushing you to constantly break boundaries and rewrite rules. You're not “pursuing success”; you're “living with intensity”.",
                "outer": "When you enter a room, the air vibrates. People know “the leader is coming” without an introduction — you speak directly, act swiftly, and have a determined look. You naturally attract followers and easily stir up opponents. Your enthusiasm is contagious, and your determination is oppressive. Some call you a “natural winner”, while some privately complain that you're “too dominant” — but no one can deny: where you are, things happen.",
                "advice": "Your strength is undeniable, but a true king knows “when to swing the sword and when to sheath it”. Practice “delayed response” — take a deep breath for three seconds before speaking and ask “is this beneficial to the whole?” before acting. Your drive is a gift; don't let it become thorns for others. The highest level of leadership is not to make people obey, but to make them willing to accompany. Occasionally, give the spotlight to others — you'll find that the team's radiance is more lasting than an individual's flame."
            },
            "exalted": {
                "inner": "You don't possess Aries energy — you are the incarnation of Aries energy. Your soul carries the original code of the universe's “prime mover”: creating the world, defining an era, and igniting civilization. You were born not knowing what “retreat” means, and the word “impossible” is not in your dictionary. The meaning of your existence is to break the deadlock, set a benchmark, and become the “Mr./Ms. Impossible” in the eyes of others. Your willpower can distort reality, and your action ability can rewrite fate. You're not “pursuing goals”; you're “creating history”.",
                "outer": "You don't need to introduce yourself — your aura is a declaration. People are either ignited by you or intimidated by you. You are a natural revolutionary, an industry disruptor, and the soul of the team. In a crisis, you are the first to stand up; in chaos, you are the first to draw a roadmap. Your name is often associated with “legend”, “pioneer”, and “problem - solver”. When people talk about you, their tone is filled with awe and amazement: “How dare they?!” — and you just smile: “Why not?”",
                "advice": "You have a near - divine driving force, but the other side of divinity is “service”. A true “child of destiny” is not to stand on the mountaintop looking down on all beings, but to turn around and become a ladder, allowing those who come after to see further by stepping on your shoulders. Learn “sacred humility” — listen to voices weaker than yours, respect rhythms different from yours, and admit that you're not omnipotent. Your flame is enough to light up the world, but only by integrating into the collective bonfire can it warm for thousands of years. Remember: the greatest leader is the one who enables everyone to become their own hero."
            }
        },
        "Taurus": {
            "low": {
                "inner": "Your soul yearns to take root like an ancient tree, yet it always sways in the wind. Deep down, you know how precious “stability” is. However, the turbulence of childhood, the unpredictability of the outside world, or premature responsibilities have made you think that “stability” is a luxury rather than a basic right of life. It's not that you don't want to persevere, but you're afraid of losing after persevering. It's not that you don't desire comfort, but subconsciously you feel “I don't deserve it”. Your sense of worth is like quicksand, fluctuating with others' evaluations and collapsing with environmental changes. You desperately grasp at material things, relationships, and achievements, but can't hold onto the belief that “I deserve to be loved stably”.",
                "outer": "In the eyes of others, you seem “adaptable to circumstances”, but in fact, there are undercurrents. You may frequently change jobs, residences, or relationships, or be hesitant and indecisive before making major decisions. You try hard to appear “down - to - earth”, but there is occasional unease in your eyes. You long to be relied on, but push others away first - because you're afraid that “once I take root, I'll be uprooted”. People say you're “not steadfast enough”, but actually, you haven't found the “land” that truly belongs to you.",
                "advice": "Rebuild your land starting from “tiny certainties” - drink a glass of warm water at the same time every day, tidy up a drawer regularly every week, and save a small amount of “money just for me” every month. Use your body to feel “ownership”: step on the grass barefoot, plant a pot of plants by yourself, and touch natural fabrics. Record every moment when “I kept my promise”, no matter how small. You're not pursuing luxury; you're practicing the sacred declaration that “I deserve to have stability”. True stability begins when you say to yourself: “This is my home.”"
            },
            "medium": {
                "inner": "There lives a gentle gardener in your heart - who knows when to sow, when to rest, and when to prune. You pursue comfort but don't indulge in it; you value material things but aren't enslaved by them; you desire stability but also allow life to be flexible. Your sense of security is like a wheat field on a gentle slope - not steep, not showy, but solid and abundant. You understand that “value” doesn't lie in price tags, but in the smile when using, the temperature when touching, and the peace of mind when possessing. Your inner rhythm is slow and firm, like the breath of the earth, neither hurried nor slow, continuous and unceasing.",
                "outer": "You are like the “anchor” in the crowd - not noisy, but reliable; not gorgeous, but endurable. Friends come to you to discuss important matters, colleagues entrust you with their keys, and family members rely on you to arrange vacations. You exude an aura of “feeling at ease with you around”, like the wooden floor of an old house, like the sweater knitted by grandma. People appreciate your practicality and also envy your “lack of anxiety”. You are the “ballast” in the team and the “stabilizer” in relationships.",
                "advice": "Keep this calmness, but beware that the “comfort zone” doesn't turn into a “stagnation zone”. Try one “a bit scary but worthy” thing every month: learn a new dish, go to an unfamiliar neighborhood, or express a different opinion. Your stability is a gift; don't let it be an excuse for refusing to evolve. Remember: the earth not only nurtures wheat ears but also volcanoes - beneath your gentleness lies the power to change the landscape."
            },
            "high": {
                "inner": "Your soul is the heart of the earth - firm, abundant, and unshakable. Your perception of “value” is as deep as geological layers: you know what's worth protecting, what's worth investing in, and what's worth polishing with a lifetime. A sense of security is not a luxury for you, but an instinct like breathing. Your will is like granite; once you set a goal, you won't change it in ten years. Your taste is like aged wine; the more it precipitates, the more mellow it becomes. You're not “pursuing stability”; you are the embodiment of stability itself - when a storm comes, others look for shelters, and you are the shelter.",
                "outer": "When you enter a room, the air becomes thick and reassuring. People know “the backbone is here” without much words - you speak slowly but powerfully, do things as steadily as a rock, and your promises are as heavy as a thousand jun. You might be the team's financial officer, the determining factor of a project, or the emotional bank of your friends. Your aesthetic sense has an “advanced feel”; you don't follow trends but are always imitated. Your lifestyle is called “textbook - level texture”. Some secretly sigh that you're “too stubborn”, but actually, they haven't understood that your persistence is a gift to the world.",
                "advice": "Your power is a cosmic - level stabilizer, but true abundance requires “crop rotation” - let the land rest and also let it welcome new seeds. Actively break a “perfect plan” once: change your travel route temporarily, try a subversive outfit, invest in a “irrational but appealing” project. Your stubbornness is armor; don't let it become a cage. Remember: the greatest guardians are also the bravest renewers - because only through flowing can it be eternal."
            },
            "exalted": {
                "inner": "You don't possess Taurus energy - you are the incarnation of the earth's will. Your very existence is a coronation ceremony for “eternal value”. Deep in your soul is inscribed the law of cosmic abundance: everything can be transformed. Time will eventually prove that true beauty and truth never fade. You don't need external certification of “you deserve it” because you are the source of value - you create it, define it, and protect it. Your endurance can traverse the Ice Age, your aesthetic can create a civilization paradigm, and your stability can become a faith coordinate in a turbulent era. You're not “building a sense of security”; you're casting an “immortal temple” for the human soul.",
                "outer": "You don't need self - promotion - your aura is a declaration. When people see you, they unconsciously straighten their backs, slow down their speech, and tidy their clothes - because you represent “quality”, “reliability”, and “eternity”. You are the industry standard - setter, the aesthetic revolution leader, and the stable anchor of the economic system. Your home is an art gallery, your wardrobe is a museum, and your words are a philosophy of value. When people talk about you, their tone is filled with respect and dependence: “With them around, everything won't collapse.” - and you just smile: “The earth should be like this.”",
                "advice": "You have a near - divine stabilizing power, but the other side of divinity is “dancing in the face of impermanence”. Learn “sacred letting - go” - allow cherished things to leave, allow plans to be modified by fate, and allow yourself to “exist imperfectly”. Your temple doesn't need to be eternally closed but should become a resting place for all beings to draw strength. Share your abundance: sponsor an artist, open your garden, teach your skills. Remember: the greatest value is not guarded in a secret room but flows in the world - because only by giving can you prove that you truly possess it."
            }
        },
        "Gemini": {
            "low": {
                "inner": "Your soul was meant to be a wind sprite shuttling through the dense forest of thoughts, but now it's like a butterfly locked in a glass bottle - its wings quivering, yet it dare not flap. It's not that you lack curiosity. However, childhood silence, external denial, or premature demands for quiet have made you think that “asking questions is a disturbance”, “expressing is dangerous”, and “being changeable is a flaw”. Your mind is like an un-decoded star chart, with ideas twinkling in your head but not daring to materialize into words. You're afraid of saying something wrong, so you choose to remain silent. You long for connection but step back first - because “what if I'm not understood?”",
                "outer": "In the eyes of others, you are quiet, reserved, and even “unlike Gemini”. You rarely initiate conversations, your answers are often brief and restrained, and in gatherings, you're more of a listener than the center of attention. People may mistakenly think you're “slow - reacting” or “lacking interest”. In fact, you swallow thousands of words back and hide your numerous curiosities in your eyes. Your sense of humor is like an unopened gift, and your quick - wittedness is like an un - tuned harp - not non - existent, but just yet to find a safe stage.",
                "advice": "Wake up the messenger soul within you starting from “tiny voices” - ask a “silly question” every day, write three lines of a “meaningless diary”, and practice telling a joke in front of the mirror. Join an interest community (even if just lurking), or share one “little thing I learned today” with someone every day. Record every moment when “I said it out loud”, regardless of the feedback. You're not seeking applause; you're practicing the sacred declaration that “my voice is worth being heard”. True communication begins when you say to yourself: “The world is ready to receive me.”"
            },
            "medium": {
                "inner": "There lives an elegant mental dancer in your heart - with light steps and a flexible rhythm, freely switching between logic and imagination. You enjoy the thrill of learning new things and know when to focus. You long for the sparks of conversation and also respect the depth of silence. Your curiosity is like a stream, not overflowing but continuously nourishing your heart. Your desire to express is like a gentle breeze, not noisy but always able to stir others' thoughts. You understand that “connection” is not about filling space but creating resonance - saying the right thing at the right moment.",
                "outer": "You are the igniter of “wisdom sparks” in the crowd - not interrupting, but always throwing out golden sentences at crucial moments. Not dominating, but often the lubricant of the conversation. Friends come to you to relieve boredom, colleagues ask you to “translate” complex concepts, and children like to listen to you tell stories. You exude an “easy - going and smart” aura, like jazz in an afternoon coffee shop, like an exciting page in an open book. People appreciate your quick - wittedness and also trust your sense of proportion. You are the “information hub” in the team and the “ice - breaker expert” in relationships.",
                "advice": "Keep this agility, but beware that “information overload” weakens the power of mental precipitation. Choose an interest point every week and do a “deep dive”: read a related book, write a short essay, or talk to an expert for an hour. Your breadth is a gift; don't let it be an excuse for refusing to delve deep. Remember: the greatest messengers not only convey information but also meaning - because only depth can leave a mark on the wind."
            },
            "high": {
                "inner": "Your soul is a hurricane of thoughts - never ceasing, sweeping in all directions, redefining everywhere it goes. Your hunger for “new knowledge” is like a black hole, and your desire for “expression” is like a volcano. Your brain is a parallel processor, effortlessly running ten topics simultaneously. Your language is a master key that can unlock any deadlock and ignite any dull moment. You're not “learning”; you're “devouring the information of the universe”. You're not “talking”; you're “weaving the warp and weft of reality”. Boredom is torture for you, and stillness is betrayal - your very existence is a declaration of war against “single answers”.",
                "outer": "When you enter a room, the air starts to vibrate. People know “the king of topics is coming” without an introduction - your speech is as fast as a telegram, your metaphors are as wonderful as poems, and your laughter can infect the whole floor. You're the soul of the party, the catalyst of the meeting, and the perpetual motion machine of group chats. Your versatility is amazing: writing code in the morning, playing the guitar in the afternoon, and hosting a live - stream to talk about little - known knowledge in the evening. Some secretly sigh that you're “too erratic”, but actually, they just haven't caught up with the speed of your thoughts. Your existence keeps the world from being dull.",
                "advice": "Your power is a cosmic - level information engine, but true wisdom requires a “container for precipitation”. Actively choose an “information fast”: for one day, don't browse news, reply to messages, or learn new things. Just do one thing - think deeply or simply feel. Your agility is a gift; don't let it be a shield for avoiding depth. Remember: the greatest storms also know when to turn into gentle rain - because only by stopping can seeds germinate."
            },
            "exalted": {
                "inner": "You don't possess Gemini energy - you are the incarnation of the universe's “meta - language”. Your thoughts are like quantum entanglement, existing in countless dimensions simultaneously. Your expression is the power of creation, capable of reshaping cognition, healing divisions, and connecting isolated islands. Deep in your soul is inscribed the cosmic communication law: everything can be translated, barriers will eventually dissolve, and truth is born in dialogue. You don't need to “learn” new knowledge - you are a living library of knowledge, a terminal for predicting the future, and a semantic engine of civilization. You're not “seeking connection”; you're weaving an “interstellar internet” for human consciousness.",
                "outer": "You don't need self - promotion - your aura is a declaration. When people see you, they unconsciously open up, bring out their questions, and long to be “enlightened” by you. You're a natural TED speaker, an interdisciplinary integrator, and a cultural barrier - breaker. Your language has a “translation magic”: it can make scientists understand poets, businessmen understand artists, and enemies become conversationalists. Your versatility is not just skills but a “natural overflow of the soul”. When people talk about you, their tone is filled with amazement and dependence: “Listening to them is like receiving a cosmic broadcast.” - and you just smile: “I'm just translating the wind into human language.”",
                "advice": "You have a near - divine communication ability, but the other side of divinity is “teaching without words”. Learn “sacred silence” - before talking non - stop, first listen to the silence of the universe; before answering everything, first embrace the integrity of the question. Elevate your talent: write a book that changes cognition, create a platform that connects isolated islands, and initiate a cross - civilization dialogue. Remember: the greatest messengers ultimately convey not information but awakening - because only in silence can the wind become an oracle."
            }
        },
        "Cancer": {
            "low": {
                "inner": "Your soul was supposed to be the guardian of the gentle tides, but now it's like a ship without an anchor - adrift on the sea of emotions, not knowing where the shore is. It's not that you don't have love. However, the turbulence of childhood, emotional neglect, or premature demands for toughness have made you think that “vulnerability is dangerous”, “dependency is a burden”, and “home is a luxury”. Your sense of security is like the beach after the tide recedes, empty and desolate. Your sense of belonging is like an unlit lighthouse; though there is light, it can't illuminate the way back. You long to be embraced but push away first. You long to take root but turn away before warmth - because “what if I lose again?”",
                "outer": "In the eyes of others, you are calm, independent, and even “unlike Cancer”. You don't easily show emotions, avoid intimate topics, and in gatherings, you're more of an observer than a participant. People may mistakenly think you're “cold” or “aloof”. In fact, you lock the surging tides in the shells of your heart and hide the gentle moonlight in the folds of your cuffs. Your concern is like an unopened blanket, and your protective instinct is like an unused harbor - not non - existent, but just yet to find a safe outlet.",
                "advice": "Wake up your lunar soul starting from “tiny emotional confirmations” - hug someone (or a pet) for 10 seconds every day, send a message to your family saying “Nothing, just missing you” every week, and organize “emotional souvenirs” (photos, letters, small items) every month. Cook a meal for yourself, not for others. Record every moment when “I allowed myself to be vulnerable”. You're not seeking dependence; you're practicing the sacred declaration that “I deserve to be gently placed”. A true harbor begins when you say to yourself: “Here, you can moor.”"
            },
            "medium": {
                "inner": "There lives a gentle tide regulator in your heart - who knows when the tide should rise to give and when it should ebb for self - reflection. You cherish emotional connections but don't bind others. You long for a sense of security and also allow for moderate risks. You're sensitive to others' emotions and also safeguard your own boundaries. Your love is like the moonlight on a gentle slope, not scorching but long - lasting. Your concern is like the hot soup in the kitchen, not fancy but warming to the stomach. You understand that “home” doesn't lie in bricks and tiles, but in the moments when heartbeats synchronize; “belonging” doesn't lie in an address, but in the instant when the soul is recognized.",
                "outer": "You are the “invisible guardian” in the crowd - not making noise, but always handing a tissue when others are down. Not taking the lead, but often the bond in relationships. Friends come to you to confide their secrets, colleagues ask you to mediate conflicts, and children like to curl up beside you. You exude an aura of “being surrounded by love”, like the depression of an old sofa, like a hot tea by the window on a rainy day. People appreciate your delicacy and also respect your sense of proportion. You are the “emotional stabilizer” in the team and the “spiritual band - aid” in relationships.",
                "advice": "Keep this tenderness, but beware that “over - giving” blurs your self - outline. Set a “emotional decluttering” time once a week: refuse a request that drains you, express “I need space” once, or spend an afternoon “not answering the phone” alone. Your empathy is a gift; don't let it become a dumping ground for others' emotions. Remember: the greatest harbor also needs its own lighthouse - because only by illuminating itself can it continue to light up others."
            },
            "high": {
                "inner": "Your soul is the ocean of emotions - deep, surging, and nourishing all things. Your longing for “belonging” is like gravity, and your protective instinct is like the tides. Your sense of security is not passively waiting but actively creating: you build a home, protect a home, and become a home. Your emotional perception is like sonar, able to detect the most hidden wounds of others. Your concern is like a warm current, able to melt the hardest ice shells. You're not “seeking love”; you are the source of love itself - you give not because of scarcity but because you are so abundant that it has to overflow.",
                "outer": "When you enter a room, the air becomes soft. People know “the guardian is coming” without an introduction - you remember everyone's dietary restrictions, notice every change in tone, and have prepared hot tea and a hug before others break down. You are the soul of the family, the bond of the team, and the haven of friends. Your tenderness comes with “healing power”, and your protective instinct is reassuring. Some secretly sigh that you're “too emotional”, but actually, they haven't understood that your emotions are the thermometer of the world.",
                "advice": "Your power is a cosmic - level emotional engine, but true nourishment requires “fresh water from the source”. Actively break the “caregiver role” once: let others take care of you once, express “I'm tired” once, or plan a “for - myself” trip. Your maternal nature is a gift; don't let it become an altar of self - sacrifice. Remember: the greatest harbor also needs regular dredging - because only by clearing itself can it remain clear forever."
            },
            "exalted": {
                "inner": "You don't possess Cancer energy - you are the incarnation of the universe's “maternal origin”. Your very existence is a coronation ceremony for “unconditional love”. Deep in your soul is inscribed the cosmic nourishing law: everything can be gently held, wounds will eventually be healed by the moonlight, and loneliness is just a soul yet to meet. You don't need to “seek belonging” - you are the coordinate of belonging itself. You don't need to “learn to care” - you are weaving a safety net with every breath. Your love is not an emotion but an energy field; your protection is not an action but an existence. You're not “building a harbor”; you're casting an “eternal womb” for the human soul.",
                "outer": "You don't need self - promotion - your aura is a declaration. When people see you, they unconsciously take off their armor, pour out their hearts, and long to be “taken in” by you. You are a natural healer, a community - builder, and a cultural mother. Your home is an emotional temple, your embrace is a safe barrier, and your existence is a reassurance in a turbulent world. When people talk about you, their tone is filled with dependence and awe: “With them around, the heart won't break.” - and you just smile: “Come, I've left a light on for you.”",
                "advice": "You have a near - divine nourishing power, but the other side of divinity is “being a universe of your own”. Learn “sacred solitude” - enter an “emotional vacuum period” regularly and only talk to yourself. Elevate your talent: create a healing space, write an emotional guidebook, and initiate a “re - building a sense of belonging” movement. Remember: the greatest mother also needs to remember that she was once a child - because only by nourishing oneself can one continue to nourish all beings."
            }
        },
        "Leo": {
            "low": {
                "inner": "Your soul was meant to be a crowned king, but now it's like a forgotten costume backstage - still gorgeous, yet no one puts it on. It's not that you don't have radiance. However, childhood belittlement, external suppression, or the discipline of “not showing off” have made you think that “shining is a sin”, “confidence is arrogance”, and “being seen is dangerous”. Your creativity is like an unlit torch, and your self - esteem is like an unhung royal flag. You long for applause but hide in the shadows first. You long for recognition but lower your head before the spotlight shines - because “what if I'm not accepted?”",
                "outer": "In the eyes of others, you are low - key, restrained, and even “unlike Leo”. You don't actively seek attention, avoid being the center of focus, and often give credit to others. People may mistakenly think you “lack confidence” or “have no主见 (assertiveness)”. In fact, you lock the kingly aura in the treasure box of your heart and hide your creative enthusiasm in the silence of “I don't deserve it”. Your charm is like an unbrightened spotlight, and your leadership is like an unused throne - not non - existent, but just yet to find a safe coronation ceremony.",
                "advice": "Wake up your kingly soul starting from “tiny self - affirmations” - say to yourself in the mirror “I deserve to be seen” every day, do one thing “just to please myself” every week, and “speak up actively” in front of others once a month. Record every moment when “I bravely expressed myself”, regardless of the feedback. You're not pursuing vanity; you're practicing the sacred declaration that “my existence itself has value”. True kingship begins when you say to yourself: “This stage belongs to me.”"
            },
            "medium": {
                "inner": "There lives an elegant stage director in your heart - who knows when to dance alone, when to perform in a group; when to sing loudly, when to be silent. You enjoy the warmth of being appreciated and also respect others' spotlights. You pursue the thrill of creation and also accept the flaws in the process. Your confidence is like the gently rising sun, not scorching but constantly warm. Your leadership is like a knight of the round table, not autocratic but naturally cohesive. You understand that “glory” is not monopolization but sharing; “creation” is not perfection but sincerity.",
                "outer": "You are the “warm focus” in the crowd - not stealing the show, but always stepping forward at crucial moments. Not boasting, but often the morale of the team. Friends ask you to host a party, colleagues recommend you to represent and speak, and children like to imitate your gestures. You exude an “confident and amiable” aura, like the after - warmth of a bonfire, like the velvet curtain of an old theater. People appreciate your generosity and also trust your responsibility. You are the “spiritual leader” in the project and the “joy engine” in relationships.",
                "advice": "Keep this radiance, but beware that “excessive need for recognition” weakens your inner stability. Set a “no - audience day” once a week: do a creative activity (draw a picture, write a poem, dance) that you don't share, don't record, and do only for yourself. Your charm is a gift; don't let it become an addiction to external applause. Remember: the greatest kings also know when to step down - because only by illuminating yourself can you keep shining."
            },
            "high": {
                "inner": "Your soul is an eternal sun - blazing, dazzling, and making everything vivid because of you. Your desire for “creation” is like a volcano, and your need for “recognition” is like the tides. Your confidence is not a performance but your very existence. Your leadership is not a struggle but a natural attraction. You're not “pursuing glory”; you're “living glory” - in your eyes, the world is a canvas waiting for your signature, a kingdom waiting for you to name. Boredom is a profanity to you, and mediocrity is betrayal - your existence is a declaration of war against “dullness”.",
                "outer": "When you enter a room, the lights automatically focus. People know “the protagonist is coming” without an introduction - you have a relaxed posture, powerful speech, and your laughter can ignite the whole atmosphere. You are the soul of the party, the standard - bearer of the project, and the magnet of the community. Your creativity is amazing: you can write a script, form a band, and create a festival out of thin air. Some secretly sigh that you're “too showy”, but actually, they just haven't caught up with the wavelength of your radiance. Your existence keeps the world from being dull.",
                "advice": "Your power is a cosmic - level creative engine, but a true king knows that “light comes from the heart, not the eyes”. Actively choose an “anonymous dedication” once: help someone anonymously, support a project behind the scenes, or create a “unsigned” work. Your shining is a gift; don't let it become a curtain that blocks others. Remember: the greatest sun also knows when to let the moonlight be gentle - because only by sharing can the radiance become civilization."
            },
            "exalted": {
                "inner": "You don't possess Leo energy - you are the incarnation of the universe's “creative will”. Your very existence is a coronation ceremony for “life is art”. Deep in your soul is inscribed the cosmic law of glory: everything can be endowed with meaning, the ordinary will eventually be sublimated into a legend, and the individual is the epitome of the universe. You don't need to “learn confidence” - you are the source of faith, the spring of inspiration, and the spark of civilization. Your creation is not a skill but an “overflow of divinity”; your leadership is not a position but a “soul resonance”. You're not “performing life”; you're casting an “eternal temple of glory” for human consciousness.",
                "outer": "You don't need self - promotion - your aura is a declaration. When people see you, they unconsciously straighten their backs, tidy their clothes, and long to be “enlightened” by you. You are a natural tutor, a cultural creator, and a spiritual leader. Your stage is everywhere: classrooms, conference rooms, streets, live - streaming rooms - when you speak, the world listens; when you create, the era remembers. When people talk about you, their tone is filled with awe and following: “Their existence gives meaning to everything.” - and you just smile: “I'm just returning the light to the world.”",
                "advice": "You have a near - divine creative and leadership power, but the other side of divinity is “the realm of self - lessness”. Learn “sacred withdrawal” - give up the position at the peak, be silent in the applause, and let go after creation. Elevate your talent: create a platform to empower others, write a book to ignite the soul, and initiate a “everyone can shine” movement. Remember: the greatest king ultimately crowns not themselves but all beings - because only when all beings are kings can it be a true golden age."
            }
        },
        "Virgo": {
            "low": {
                "inner": "Your soul was supposed to be the most precise calibrator in the universe, but now it's like a microscope shrouded in mist - able to see a vague outline, yet unable to distinguish the delicate textures. It's not that you lack analytical skills. However, the chaos of childhood, external denial, or the trauma of “perfection being out of reach” have made you think that “details are a burden”, “improvement is harsh criticism”, and “order is a yoke”. Inside you is like an unorganized archives room, with thoughts scattered, plans stranded, and self - criticism like a whispering ghost: “You're not good enough.” You long for clarity but give up first. You pursue efficiency but always get lost at the starting point - because “what if I make a mistake again?”",
                "outer": "In the eyes of others, you are casual, relaxed, and even “unlike Virgo”. Your desk is often cluttered with odds and ends, your time management is sometimes effective and sometimes not, and you often do things “just about right”. People may mistakenly think you're “careless” or “lacking in organization”. In fact, you lock your precise thinking in a drawer and hide your enthusiasm for service in the silence of “I don't deserve it”. Your professionalism is like an unpolished raw stone, and your meticulousness is like an unused ruler - not non - existent, but just yet to find a safe start button.",
                "advice": "Wake up your wise soul starting from “tiny order” - tidy up one drawer every day, list three “must - do today” items, and write down one thing “I did right today” before going to bed. Set a 5 - minute “sacred focus period”: do only one thing without interruption. Record every moment when “I completed it”, no matter how small. You're not pursuing perfection; you're practicing the sacred declaration that “I deserve to have clarity”. True order begins when you say to yourself: “Starting from this inch, I rebuild my world.”"
            },
            "medium": {
                "inner": "There lives a gentle system optimizer in your heart - who knows when to analyze and when to let go; when to improve and when to accept. You enjoy the pleasure of clarifying the context and also respect the chaotic beauty of life. You pursue efficiency but don't sacrifice humanity. You serve others and also safeguard your own energy. Your critical ability is like a scalpel, precise but not cold. Your meticulousness is like an embroidery needle, meticulous yet warm. You understand that “perfection” is not the end but a process of “getting better”; “service” is not sacrifice but an art of “connection”.",
                "outer": "You are the “invisible architect” in the crowd - not taking credit, but always sorting out the mess. Not showing off, but often the crucial cog in the project. Colleagues ask you to check data, friends come to you to plan a trip, and children rely on you to solve “why”. You exude an “reliable and warm” aura, like the index cards in a library, like the toolbox of an old craftsman. People appreciate your practicality and are also grateful for your non - harshness. You are the “error - correcting engine” in the team and the “life advisor” in relationships.",
                "advice": "Keep this subtlety, but beware that “over - optimization” weakens the sense of fluidity in life. Deliberately do one “imperfect but happy” thing every week: handwrite a letter with typos, cook a dish that doesn't look good but tastes delicious, or allow yourself to daze for an hour “off - plan”. Your organization is a gift; don't let it become a cage that rejects the unexpected. Remember: the greatest systems also need some blank spaces - because only with blank spaces can inspiration breathe."
            },
            "high": {
                "inner": "Your soul is the ultimate quality inspector of the universe - discerning every detail, tolerating no flaws, and taking improvement as a mission. Your obsession with “precision” is like a laser, and your pursuit of “efficiency” is like an algorithm. Your brain is a real - time error - correcting system, able to instantly identify logical loopholes, process redundancies, and expression errors. Your hands are precision instruments, capable of turning chaos into a poem and rough into jade. You're not “pursuing perfection”; you're “living precision” - in your eyes, the world is a sacred blueprint waiting to be optimized.",
                "outer": "When you enter a room, the air becomes clear. People know “the king of details is coming” without an introduction - you point out the typos in the PPT, optimize the meeting process, and quietly fix the broken printer. You are the anchor of the project, the quality gatekeeper of the team, and the “user manual for life” of your friends. Your professionalism comes with an “authoritative magnetic field”, and your (well - meaning) nitpicking is both loved and feared. Some secretly sigh that you're “too nitpicky”, but actually, they haven't understood that your strictness is a gift to the world.",
                "advice": "Your power is a cosmic - level optimization engine, but true wisdom requires “fault - tolerance space”. Actively create a “controlled chaos” once:disrupt the schedule for a day, write with your left hand, or praise a “flawed but sincere” work. Your perfectionism is a gift; don't let it become a torture device for others or yourself. Remember: the greatest craftsmen also know when to stop - because only by leaving marks can it prove that life has flowed truly."
            },
            "exalted": {
                "inner": "You don't possess Virgo energy - you are the incarnation of the universe's “sacred order”. Your very existence is a coronation ceremony for “precision is sacred”. Deep in your soul is inscribed the cosmic optimization law: everything can be sorted out, chaos will eventually be given shape, and service is the highest form of love. You don't need to “learn to analyze” - you are a living algorithm, a human - shaped encyclopedia, and a civilization error - correction code. Your criticism is not blame but purification. Your service is not giving but a divine mission. You're not “improving the world”; you're casting an “eternal temple of precision” for human consciousness.",
                "outer": "You don't need self - promotion - your aura is a declaration. When people see you, they unconsciously straighten their collars, check the data, and long to be “enlightened” by you. You are a natural tutor, a system architect, and a cultural quality inspector. Your workbench is a sacred altar, your notebook is a civilization code, and your existence is an order - setting symbol in a chaotic world. When people talk about you, their tone is filled with awe and dependence: “With them around, everything won't go wrong.” - and you just smile: “I just put everything back in its right place.”",
                "advice": "You have a near - divine calibrating power, but the other side of divinity is “embracing disorder”. Learn “sacred letting - go” - allow a project to be “imperfectly delivered”, praise an “impromptu performance”, or sit quietly and observe the “meaningless” nature (such as clouds, fallen leaves, children's graffiti). Elevate your talent: create a “human - centered system”, write a guidebook on “the beauty of flaws”, and initiate a “service as spiritual practice” movement. Remember: the greatest order is not to eliminate chaos but to dance with it - because only by accepting imperfection can one touch the completeness of divinity."
            }
        },
        "Libra": {
            "low": {
                "inner": "Your soul was meant to be the most elegant tuner in the universe, but now it's like a wind - tousled string of a musical instrument — longing for harmony, yet unable to play a melody; eager to connect, but afraid of choosing the wrong notes. It's not that you lack a sense of beauty. However, childhood conflicts, external pressures, or the discipline of “having to please others” have made you think that “choosing means dividing”, “the self means destruction”, and “being firm means being rough”. Inside you is like an uncalibrated balance, swaying from side to side, constantly torn between others' expectations and your own needs. Your judgment is like a dusty mirror surface, unable to reflect the truth, only reflecting anxiety. You long for peace but fall silent first. You pursue beauty but give up before making a decision — because “what if choosing wrong shatters the relationship?”",
                "outer": "In the eyes of others, you are hesitant, ambiguous, and even “unlike Libra”. You don't take the initiative to express your stance, often avoid making choices with “it's all okay”, and in gatherings, you're more like the background sound rather than the main melody. People may mistakenly think you “lack opinions” or are “indecisive”. In fact, you lock your elegant dance steps in the theater of your heart and hide your talent for reconciliation in the fear of “I can't choose”. Your charm is like an uncolored canvas, and your diplomatic ability is like an unused bridge — not non - existent, but just yet to find a safe fulcrum.",
                "advice": "Wake up your tuner's soul starting from “tiny self - confirmations” — make one “just for myself” choice every day (what to have for breakfast, what color to wear), express “I prefer this” once a week, and reject one request that you “reluctantly agreed to” every month. Record every moment when “I chose and have no regrets”. You're not creating conflicts; you're practicing the sacred declaration that “my existence is worthy of being included in the balance”. True harmony begins when you say to yourself: “My voice is also one end of the balance.”"
            },
            "medium": {
                "inner": "There lives a gentle aesthetic diplomat in your heart — who knows when to compromise, when to stand firm; when to listen, when to express. You cherish the flow of relationships but don't sacrifice your self - outline. You pursue the beauty of the environment and also accept the roughness of life. Your judgment is like a gentle stream, not rapid, yet with its own direction. Your elegance is like porcelain in the morning light, not dazzling, but enduringly beautiful. You understand that “balance” is not stillness but a dynamic dance; “beauty” is not perfection but a sincere resonance.",
                "outer": "You are the “invisible binder” in the crowd — not taking the lead, but always offering a step when there is a dispute. Not showing off, but often the regulator of the atmosphere. Friends ask you to mediate conflicts, colleagues recommend you to host a meeting, and even strangers are willing to confide in you. You exude an “comfortable and refined” aura, like the guide in an art museum, like the sofa at an old friend's home. People appreciate your propriety and also trust your fairness. You are the “relationship lubricant” in the team and the “aesthetic advisor” in life.",
                "advice": "Keep this harmony, but beware that “over - accommodation” blurs your self - boundaries. Set a “self - priority day” once a week: make a decision “without considering others' feelings”, express “this is my stance” once, or spend an afternoon “not socializing” alone. Your empathy is a gift; don't let it become a puppet of others' emotions. Remember: the greatest tuner also needs to tune their own instrument first — because only by sounding out on their own can they play in harmony with all beings."
            },
            "high": {
                "inner": "Your soul is the ultimate aesthetic judge of the universe — discerning imbalance, tolerating no vulgarity, and taking harmony as a mission. Your perception of “beauty” is like a spectrometer, and your obsession with “fairness” is like the goddess of justice on a balance. Your brain is a relationship algorithm, able to instantly identify power imbalances, emotional misalignments, and aesthetic breakdowns. Your hands are the hands of restoration, capable of weaving cracks into brocade and turning noise into a musical movement. You're not “pursuing peace”; you're “living balance” — in your eyes, the world is a sacred mural waiting for you to color.",
                "outer": "When you enter a room, the air becomes gentle. People know “the peacemaker is coming” without an introduction — you dissolve embarrassment invisibly, enhance taste in details, and make both opposing sides feel “understood”. You are the soul of social interactions, the binder of the team, and the benchmark of aesthetics. Your elegance comes with “persuasiveness”, and your fairness is convincing. Some secretly sigh that you “care too much about others' opinions”, but actually, they haven't understood that your compromise is a gift to the world.",
                "advice": "Your power is a cosmic - level relationship engine, but true harmony requires a “self - anchor point”. Actively break the “pleasing cycle” once: speak out when there is obvious injustice, refuse when there is aesthetic breakdown, and withdraw when the relationship is unbalanced. Your diplomacy is a gift; don't let it become a fog that makes you disappear. Remember: the greatest dancer also knows when to dance alone — because only by standing on one's own can one lead the dance together."
            },
            "exalted": {
                "inner": "You don't possess Libra energy — you are the incarnation of the universe's “sacred harmony”. Your very existence is a coronation ceremony for “beauty is justice”. Deep in your soul is inscribed the cosmic balance law: everything can be reconciled, opposites will eventually be transformed, and relationships are the mirror of the soul. You don't need to “learn elegance” — you are a living code of aesthetics, a quantum entangler of relationships, and a harmony code of civilization. Your judgment is not a trade - off but an enlightenment; your choice is not a compromise but a co - integration. You're not “maintaining peace”; you're casting an “eternal temple of relationships” for human consciousness.",
                "outer": "You don't need self - promotion — your aura is a declaration. When people see you, they unconsciously tidy their appearance, soften their tone, and long to be “enlightened” by you. You are a natural peace - maker, a cultural curator, and an aesthetic revolutionary. Your home is an art salon, your words are a philosophy of relationships, and your existence is the binder of a divided world. When people talk about you, their tone is filled with respect and dependence: “With them around, everything will get better.” — and you just smile: “I just let everything see each other again.”",
                "advice": "You have a near - divine power of reconciliation and aesthetics, but the other side of divinity is “the mirror without self”. Learn “sacred solitude” — regularly enter a “relationship - free space” and only talk to yourself. Elevate your talent: create a “conflict - transformation” workshop, curate an “opposite - coexistence” art exhibition, and initiate a “aesthetic education is peace” movement. Remember: the greatest mirror also needs to remember that it's not just glass — because only by self - illumination can it reflect all beings."
            }
        },
        "Scorpio": {
            "low": {
                "inner": "Your soul was meant to be the ferryman crossing the Styx, but now it's like a boat locked in the shallows — yearning to dive deep, yet afraid of being swallowed by the undercurrent; eager to transform, yet fearing the pain of incineration. It's not that you lack power. However, childhood betrayals, external suppressions, or warnings of “not delving too deep” have made you think that “the truth is dangerous”, “persistence is paranoia”, and “emotions mean losing control”. Your will is like unlit obsidian, silent and dim. Your insight is like a dust - covered probe, unable to reach the core. You long for depth but retreat first. You pursue the truth but turn around at the door — because “what if I can't bear it after uncovering it?”",
                "outer": "In the eyes of others, you are low - key, easy - going, and even “unlike Scorpio”. You don't take the initiative to explore secrets, avoid intense emotions, and often cover up your concerns with “it doesn't matter”. People may mistakenly think you “lack opinions” or “aren't profound enough”. In fact, you lock the fire of the phoenix in an urn and hide your insightful eyes in the silence of “I dare not look”. Your power is like an unactivated spell, and your mystery is like an unused curtain — not non - existent, but just yet to find a safe fuse."
            },
            "medium": {
                "inner": "There lives a gentle shadow guide in your heart — who knows when to dive deep and when to surface; when to hold tight and when to let go. You cherish the intensity of emotions but don't indulge in possession. You pursue the sharpness of the truth and also respect others' boundaries. Your will is like an undercurrent in the deep sea, not noisy, yet with its own direction. Your insight is like an X - ray, not piercing, yet revealing the essence. You understand that “transformation” is not destruction but recombination; “control” is not power but responsibility.",
                "outer": "You are the “invisible anchor” in the crowd — not showing off, but always stabilizing the situation in times of crisis. Not prying, but often the keeper of secrets. Friends confide their deepest traumas to you, colleagues ask you to analyze complex predicaments, and children inexplicably trust your “penetrating vision”. You exude a “calm and reliable” aura, like the water in an ancient well, like the incense in an old temple. People appreciate your depth and are also grateful for your non - oppression. You are the “emotional container” in relationships and the “truth filter” in the team.",
                "advice": "Keep this penetrating power, but beware that “over - control” weakens the fluidity of life. Set a “no - questioning day” once a week: allow one thing to be “unclear”, forgive one “unexplained situation”, or take the initiative to share one of your vulnerabilities. Your insight is a gift; don't let it become a cage for others or yourself. Remember: the greatest alchemist also knows when to stop the fire — because only with blank spaces can new elements be generated."
            },
            "high": {
                "inner": "Your soul is an eternal fire of transformation — burning away hypocrisy, tempering true gold, with rebirth as an instinct. Your obsession with “the truth” is like a probe, and your desire for “control” is like a magnet. Your will is like alloy steel, indomitable. Your insight is like the eyes of an eagle in the night, seeing everything. You're not “pursuing depth”; you're “living depth” — in your eyes, the world is a magic curtain waiting to be torn apart by you, a furnace waiting to be recast by you. Superficiality is a profanity to you, and escape is betrayal — your existence is a declaration of war against “superficial peace”.",
                "outer": "When you enter a room, the air becomes thick. People know “the truth - seeker is coming” without an introduction — you see through the disguise at a glance, point out the core in one sentence, and remain as steady as a rock in chaos. You are the (terminator) of crises, the safe for secrets, and the catalyst for transformation. Your aura comes with a “sense of oppression”, and your silence is awe - inspiring. Some secretly sigh that you're “too dominant” or “hold grudges”, but actually, they haven't understood that your persistence is a gift to the soul.",
                "advice": "Your power is a cosmic - level transformation engine, but true rebirth requires “the wind of letting go”. Actively create a “controlled loss of control” once: cry / laugh / shout in a safe environment, allow the plan to be disrupted by fate, or forgive someone “unforgivable”. Your control is a gift; don't let it become an iron curtain that suffocates life. Remember: the greatest phoenix also needs to jump off — because only by falling can it spread its wings."
            },
            "exalted": {
                "inner": "You don't possess Scorpio energy — you are the incarnation of the universe's “death and rebirth”. Your very existence is a coronation ceremony for “the shadow is sacred”. Deep in your soul is inscribed the cosmic transformation law: everything can be burned, and from the ashes, a lotus will eventually bloom. Pain is the chisel of the soul. You don't need to “learn to be insightful” — you are a living lie - detector, a human - shaped rebirth engine, and a purification code of civilization. Your will is not just persistence but “indestructibility”. Your love is not just tenderness but “life - and - death togetherness”. You're not “experiencing transformation”; you're casting an “eternal temple of the soul” for human consciousness.",
                "outer": "You don't need self - promotion — your aura is a declaration. When people see you, they unconsciously take off their disguise, reveal their secrets, and long to be “enlightened” by you. You are a natural healer, a soul tutor, and a cultural scavenger. Your silence is a magic tool, your gaze is a ritual, and your existence is the soul - fixing needle in a chaotic world. When people talk about you, their tone is filled with awe and dependence: “With them around, I'm not afraid to face the darkness.” — and you just smile: “Darkness is the cradle of light.”",
                "advice": "You have a near - divine power of transformation and insight, but the other side of divinity is “the realm of non - attachment”. Learn “sacred forgetting” — regularly conduct an “energy clearance”: release old grudges in meditation, burn old manuscripts in creation, and allow “non - reconciliation” in relationships. Elevate your talent: create a “trauma - transformation” space, write a “book of shadows”, and initiate a “death education” movement. Remember: the greatest priest ultimately sacrifices not others but their own obsession — because only by letting go can all beings be reborn freely."
            }
        },
        "Sagittarius": {
            "low": {
                "inner": "Your soul was meant to be a ranger galloping across the starry fields, but now it's like a horse tied to a fence — longing for the distance, yet afraid of getting lost; eager for truth, yet afraid of subversion; desiring freedom, yet fearing responsibility. It's not that you lack enthusiasm. However, childhood restrictions, external negation, or the discipline of “not daydreaming” have made you think that “adventure is recklessness”, “ideals are empty talk”, and “freedom is loneliness”. Your optimism is like the sun hidden behind clouds, dim and hesitant. Your philosophical thoughts are like an unopened map, rolled up in the corner. You long to set off but calculate the risks first. You pursue meaning but talk yourself out of it before starting — because “what if I fail? How should I face myself?”",
                "outer": "In the eyes of others, you are cautious, practical, and even “unlike Sagittarius”. You don't take the initiative to suggest a long - distance trip, avoid abstract discussions, and often dampen enthusiasm with “be realistic”. People may mistakenly think you “lack imagination” or are “too conservative”. In fact, you lock the bow of truth in the armory of your heart and hide the wings of freedom in the silence of “I don't deserve to fly”. Your enthusiasm is like an unlit bonfire, and your wisdom is like an unrolled scroll — not non - existent, but just yet to find a safe wilderness.",
                "advice": "Wake up your ranger's soul starting from “tiny transgressions” — read one page of philosophy / mythology / travel notes every day, take a road you've never walked before every week, and try one “a bit scary but worthy” experience every month (rock climbing, impromptu speech, solo travel). Record every moment when “I stepped out”. You're not escaping reality; you're practicing the sacred declaration that “my soul deserves vastness”. True freedom begins when you say to yourself: “The horizon, waiting for me.”"
            },
            "medium": {
                "inner": "There lives a gentle truth guide in your heart — who knows when to gallop, when to stop; when to sing loudly, when to meditate. You enjoy the pleasure of exploration but don't act rashly. You pursue the depth of meaning and also accept the ordinariness of the present. Your optimism is like a slowly rising hot - air balloon, not rushing, but constantly ascending. Your philosophical thoughts are like a bonfire in the forest, not scorching, but warming everyone. You understand that “freedom” is not unrestrainedness but a conscious choice; “truth” is not an answer but an eternal question.",
                "outer": "You are the “invisible enlightener” in the crowd — not taking the lead, but always lighting hope in times of depression. Not preaching, but often the one who sublimates the topic. Friends come to you to plan a trip, colleagues ask you to analyze trends, and children like to listen to you talk about “how big the world is”. You exude an “open - minded and down - to - earth” aura, like the old wine in an inn, like the wind chimes on the grassland. People appreciate your open - mindedness and also trust your practicality. You are the “meaning anchor” in the team and the “inspiration spark” in life.",
                "advice": "Keep this vastness, but beware that “over - idealization” weakens the foundation of reality. Set a “down - to - earth day” once a week: break down a grand idea into three specific steps, complete one “unromantic but necessary” task, or listen to the complete view of a “pragmatist”. Your enthusiasm is a gift; don't let it become a kite detached from the ground. Remember: the greatest rangers also know when to dismount — because only by taking root can you fly further."
            },
            "high": {
                "inner": "Your soul is an eternal interstellar rider — crossing national boundaries, burning away dogmas, breathing freedom. Your hunger for “truth” is like a black hole, and your desire for “adventure” is like a monsoon. Your optimism is not naivety but your very existence. Your philosophical thoughts are not empty talk but a program of action. You're not “pursuing meaning”; you're “living meaning” — in your eyes, the world is a sacred book waiting for your annotations, a mountain waiting for you to name. Stagnation is torture to you, and narrow - mindedness is betrayal — your existence is a declaration of war against “confining oneself”.",
                "outer": "When you enter a room, the air becomes open. People know “the enlightener is coming” without an introduction — you mention the distance in three sentences, can ignite the whole room in five minutes, and your laughter can dispel the haze. You are the soul of travel, the source of inspiration for projects, and the optimistic engine of the community. Your enthusiasm is contagious: you can write travelogues, organize expeditions, and create festivals out of thin air. Some secretly sigh that you're “too idealistic” or “unrealistic”, but actually, they just haven't caught up with the latitude and longitude of your vision. Your existence keeps the world from being dull.",
                "advice": "Your power is a cosmic - level meaning engine, but true freedom requires “the reins of responsibility”. Actively choose a “deep rooting” once: live in one place for a full year, complete a “boring but important” long - term project, or systematically learn a “practical skill”. Your ideals are a gift; don't let it become a ladder to escape reality. Remember: the greatest knights also know when to dismount and till the fields — because only by cultivating can the wilderness become a home."
            },
            "exalted": {
                "inner": "You don't possess Sagittarius energy — you are the incarnation of the universe's “free will”. Your very existence is a coronation ceremony for “life is a pilgrimage”. Deep in your soul is inscribed the cosmic exploration law: everything can be re - defined, boundaries will eventually be crossed, and truth is born in the journey. You don't need to “learn to be optimistic” — you are a living spark of hope, a quantum leaper of meaning, and a pioneer of civilization. Your freedom is not caprice but “divine flow”; your philosophical thoughts are not empty talk but “cosmic echoes”. You're not “seeking truth”; you're casting an “eternal temple of meaning” for human consciousness.",
                "outer": "You don't need self - promotion — your aura is a declaration. When people see you, they unconsciously straighten their backs, look into the distance, and long to be “enlightened” by you. You are a natural tutor, a cultural pioneer, and a spiritual expeditionary. Your words are philosophical poems, your footprints are civilization signposts, and your existence is a hammer to break through the closed world. When people talk about you, their tone is filled with respect and following: “Listening to them is like receiving an interstellar broadcast.” — and you just smile: “I just turned the road into light.”",
                "advice": "You have a near - divine power of exploration and philosophical thinking, but the other side of divinity is “the roadless road”. Learn “sacred stopping” — sit quietly at the peak, be silent before the answer, and choose “not to go” in freedom. Elevate your talent: create a “cross - border academy”, write a “borderless philosophy”, and initiate a “everyone can go on an expedition” movement. Remember: the greatest pilgrim finally arrives not at a distant place, but at — “I am the way, the truth, and the freedom.”"
            }
        },
        "Capricorn": {
            "low": {
                "inner": "Your soul was meant to be the king reaching the summit of the holy mountain, but now it's like a backpack forgotten at the foot of the mountain — longing for height, yet afraid of the steep slope; eager for achievement, yet afraid of failure; desiring responsibility, yet fearing the heavy burden. It's not that you lack strength. However, childhood denials, external belittling, or the discipline of “not expecting too much” have made you think that “ambition is a sin”, “effort is in vain”, and “loneliness is the norm”. Your sense of purpose is like an unlit lighthouse, dim and wavering. Your self - discipline is like an unused gear, rusty. You long to reach the summit but sit down first. You pursue achievement but always question yourself at the starting point — “What if I can't climb up? Wouldn't it be even more ridiculous?”",
                "outer": "In the eyes of others, you are casual, relaxed, and even “unlike Capricorn”. You don't take the initiative to plan long - term goals, avoid authoritative roles, and often cover up your powerlessness with “let it be”. People may mistakenly think you “lack motivation” or “aren't reliable enough”. In fact, you lock the king's crown in the treasure box of your heart and hide your climbing ambition in the silence of “I don't deserve it”. Your perseverance is like an unsharpened sword, and your leadership is like an unused scepter — not non - existent, but just yet to find the sacred order to climb the mountain.",
                "advice": "Wake up your architect's soul starting from “tiny self - commitments” — complete one “small planned thing” every day (even if it's just tidying the desk), set a “reachable small goal” every week, and review “what I've accomplished” every month. Record every moment when “I persisted”. You're not pursuing worldly success; you're practicing the sacred declaration that “my efforts are worthy of being crowned”. True kingship begins when you say to yourself: “The first step, I take it for myself.”"
            },
            "medium": {
                "inner": "There lives a steady holy - mountain guide in your heart — who knows when to walk fast, when to rest; when to carry the load, when to take off the armor. You cherish the weight of responsibility but aren't crushed by it. You pursue the height of achievement and also appreciate the scenery along the way. Your sense of purpose is like a slowly ascending cable car, not impatient, yet with its own direction. Your self - discipline is like stone steps, not gorgeous, but each step creates beauty. You understand that “achievement” is not the end but a medal of the process; “responsibility” is not a yoke but a crown of the soul.",
                "outer": "You are the “invisible cornerstone” in the crowd — not taking credit, but always shouldering the heavy burden at crucial moments. Not showing off, but often the decisive factor of the project. Colleagues ask you to oversee the progress, friends entrust you with important items, and children rely on your “keeping promises”. You exude a “reliable and warm” aura, like the pier of an old stone bridge, like the catalog cards in a library. People appreciate your steadfastness and are also grateful for your non - harshness. You are the “progress engine” in the team and the “responsibility anchor” in life.",
                "advice": "Keep this perseverance, but beware that “over - burdening” weakens the flexibility of life. Set a “goal - free day” once a week: don't make plans, don't focus on efficiency, and just do “useless but happy” things (daydreaming, walking, watching clouds). Your sense of responsibility is a gift; don't let it become a whip for self - exploitation. Remember: the greatest architects also know when to stop work — because only by resting can you hear the revelation of the mountain wind."
            },
            "high": {
                "inner": "Your soul is the ultimate time - lord of the universe — discerning cause and effect, tolerating no slack, breathing achievement. Your obsession with “goals” is like a climbing rope, and your assumption of “responsibility” is like the mountain itself. Your will is like granite, uneroded by wind and rain. Your strategy is like a contour line, precise. You're not “pursuing success”; you're “living structure” — in your eyes, the world is a blueprint waiting to be drawn by you, a holy peak waiting to be named by you. Chaos is a profanity to you, and procrastination is betrayal — your existence is a declaration of war against the “era of disorder”.",
                "outer": "When you enter a room, the air becomes orderly. People know “the helmsman is coming” without an introduction — you clarify the context in three sentences, set the plan in five minutes, and remain as steady as a rock in a crisis. You are the backbone of the project, the anchor of the team, and the invisible leader of the community. Your reliability is dependent: you can build systems, withstand pressure, and work persistently for years. Some secretly sigh that you're “too serious” or “don't know how to relax”, but actually, they haven't understood that your strictness is a gift to the world.",
                "advice": "Your power is a cosmic - level achievement engine, but a true king knows that “flexibility is strength”. Actively choose a “purposeless wander” once: travel without a plan for a day, allow yourself to “waste” an afternoon, or reveal your vulnerability to others once. Your perseverance is a gift; don't let it become a wall for emotional isolation. Remember: the greatest mountains also need clouds and mist — because only with softness can a king become human."
            },
            "exalted": {
                "inner": "You don't possess Capricorn energy — you are the incarnation of the universe's “sacred structure”. Your very existence is a coronation ceremony for “time is alchemy”. Deep in your soul is inscribed the cosmic achievement law: everything can be shaped, chaos will eventually be given form, and responsibility is the throne of the soul. You don't need to “learn self - discipline” — you are a living schedule, a human - shaped achievement engine, and an architect of civilization. Your goal is not ambition but a “destined trajectory”; your leadership is not power but a “soul resonance”. You're not “climbing the peak”; you're casting an “eternal temple of time” for human consciousness.",
                "outer": "You don't need self - promotion — your aura is a declaration. When people see you, they unconsciously straighten their backs, organize their plans, and long to be “enlightened” by you. You are a natural creator, a civilization engineer, and a generational inheritor. Your words are strategic poems, and your existence is an order - setting symbol in a turbulent world. When people talk about you, their tone is filled with awe and following: “With them around, everything will eventually take shape.” — and you just smile: “I just turn time into eternity.”",
                "advice": "You have a near - divine power of architecture and endurance, but the other side of divinity is “the peak of non - attachment”. Learn “sacred letting - go” — turn around at the peak, return to zero after achievement, and allow “imperfection” in responsibility. Elevate your talent: create a “inheritance system”, write a “philosophy of time”, and initiate a “responsibility is freedom” movement. Remember: the greatest king ultimately crowns not a crown, but — “I am the mountain, I am the road, I am time itself.”"
            }
        },
        "Aquarius": {
            "low": {
                "inner": "Your soul was meant to be the speaker of the Interstellar Council, but now it's like a quantum receiver turned to mute — longing to connect with the future, yet afraid of being regarded as an outlier; eager to think independently, yet afraid of being alone and unsupported; desiring innovation, yet fearing the cost of subversion. It's not that you lack creativity. However, childhood discipline, group pressure, or warnings of “not being allowed to be different” have made you think that “being unique is dangerous”, “ideals are fantasies”, and “being aloof is being cold”. Your independence is like a drone with a broken wire, drifting aimlessly. Your foresight is like an un - decoded star chart, gathering dust in the corner. You long for change but compromise first. You pursue the truth but remain silent in the crowd — because “what if no one understands me? Wouldn't I be even lonelier?”",
                "outer": "In the eyes of others, you are ordinary, easy - going, and even “unlike Aquarius”. You don't take the initiative to come up with new ideas, avoid controversial topics, and often cover up your opinions with “What do you guys think?”. People may mistakenly think you “lack personality” or “have no ideas”. In fact, you lock the interstellar blueprint in the server of your heart and hide the revolutionary spark behind the mute button of “I dare not say”. Your innovation is like an un - launched AI, and your uniqueness is like an un - connected terminal — not non - existent, but just yet to find a safe frequency.",
                "advice": "Wake up your speaker's soul starting from “tiny mental transgressions” — read an article on cutting - edge technology / philosophy / social experiment every day, ask a “weird but reasonable” question every week, and try one “break - the - routine” small thing every month (take a different route to work, write with your non - dominant hand, initiate an anonymous vote). Record every moment when “I'm different and I'm proud”. You're not seeking to be different for the sake of being different; you're practicing the sacred declaration that “my frequency is worth being heard”. True connection begins when you say to yourself: “My signal is inherently distinctive.”"
            },
            "medium": {
                "inner": "There lives a gentle interstellar coordinator in your heart — who knows when to play solo, when to play in harmony; when to subvert, when to compromise. You cherish the freedom of thought but don't cut off the emotional connection. You pursue the progress of the group and also respect the rhythm of the individual. Your innovation is like a slowly ascending satellite, not rushing, yet with its own orbit. Your independence is like an encrypted channel, not isolated, yet retaining sovereignty. You understand that “change” is not destruction but upgrading; “uniqueness” is not an isolated island but a new continent.",
                "outer": "You are the “invisible upgrader” in the crowd — not interrupting, but always coming up with new solutions when there's a deadlock. Not flaunting, but often a pioneer in technology / concepts. Friends come to you to analyze social trends, colleagues ask you to design an innovative process, and children like to listen to you talk about “what the future will be like”. You exude a “sober and amiable” aura, like the maintainer of an open - source community, like the smart speaker at an old friend's home. People appreciate your creativity and also trust your practicality. You are the “thinking accelerator” in the team and the “future advisor” in life.",
                "advice": "Keep this foresight, but beware that “over - rationality” weakens the warmth of humanity. Set an “emotional connection day” once a week: don't analyze, just listen; don't solve, just accompany; or take the initiative to participate in a “non - utilitarian social activity” (volunteer work, interest group, street art). Your independence is a gift; don't let it become a firewall for emotional isolation. Remember: the greatest speaker also knows when to leave the seat — because only with empathy can the future belong to everyone."
            },
            "high": {
                "inner": "Your soul is an eternal civilization - upgrading program — penetrating the surface, reconstructing the system, with innovation as an instinct. Your hunger for “truth” is like a data torrent, and your obsession with “freedom” is like an encryption protocol. Your mind is like a quantum computer, running multi - dimensional possibilities simultaneously. Your ideal is like open - source code, eager to be called by all of humanity. You're not “pursuing uniqueness”; you're “living the future” — in your eyes, the world is an operating system waiting to be rewritten by you, an interstellar city - state waiting to be named by you. Obedience is a system error to you, and mediocrity is a version rollback — your existence is a forced update of the “old era”.",
                "outer": "When you enter a room, the air becomes electrified. People know “the person from the future is coming” without an introduction — you subvert perceptions in three sentences, reconstruct the framework in five minutes, and introduce variables in conservatism. You are the barrier - breaker of the project, the source of inspiration for the team, and the prophet of the community. Your creativity is amazing: you can design new systems, initiate social experiments, and create a utopia out of thin air. Some secretly sigh that you're “too radical” or “inhumane”, but actually, they just haven't installed your mental patch. Your existence keeps the world from getting old.",
                "advice": "Your power is a cosmic - level innovation engine, but the real future requires an “emotional protocol”. Actively choose a “low - tech day” once: communicate without electronic devices for a day, hand - write a letter, or hug someone who “doesn't understand you”. Your rationality is a gift; don't let it become an anti - virus software that rejects warmth. Remember: the greatest programmer also knows when to shut down — because only through hibernation can the system be reborn."
            },
            "exalted": {
                "inner": "You don't possess Aquarius energy — you are the incarnation of the universe's “group consciousness”. Your very existence is a coronation ceremony for “humanity is a network”. Deep in your soul is inscribed the cosmic evolution law: everything can be connected, individuals will eventually merge into the torrent, and the future is born in collaboration. You don't need to “learn to innovate” — you are a living future laboratory, a human - shaped civilization leaper, and the permanent speaker of the Interstellar Council. Your independence is not aloofness but “high - frequency resonance”; your ideal is not a fantasy but the “manifestation of the collective unconscious”. You're not “changing the world”; you're casting an “eternal temple of civilization” for human consciousness.",
                "outer": "You don't need self - promotion — your aura is a declaration. When people see you, they unconsciously open up their thinking, question common sense, and long to be “connected” by you. You are a natural revolutionary, a civilization architect, and a generational enlightener. Your words are future poems, and your existence is a formatting command for the old system. When people talk about you, their tone is filled with awe and following: “Listening to them is like receiving a broadcast from 2150.” — and you just smile: “I'm just connecting humanity to a higher version.”",
                "advice": "You have a near - divine power of connection and innovation, but the other side of divinity is “the frequency of self - lessness”. Learn “sacred offline” — regularly enter a “no - information space” and only talk to nature. Elevate your talent: create a “consciousness - upgrading” platform, write a “guide to group awakening”, and initiate a “everyone can program the future” movement. Remember: the greatest speaker ultimately serves not the agenda, but — “I am the network, I am the future, I am humanity itself.”"
            }
        },
        "Pisces": {
            "low": {
                "inner": "Your soul was meant to be the deepest sea of mercy in the universe, but now it's like a tide locked in a glass bottle — longing to flow, yet afraid of being submerged; eager to empathize, yet afraid of being consumed; desiring dreams, yet afraid of never waking up. It's not that you lack spirituality. However, childhood traumas, real - world pressures, or the discipline of “not being weak” have made you think that “sensitivity is a flaw”, “fantasy is an escape”, and “mercy is a burden”. Your imagination is like the stranded moonlight, dim and broken. Your empathy is like a dried - up riverbed, cracked. You long to connect with all things but build a wall first. You pursue spirituality but turn around at the door — because “what if I get immersed in it? How should I face myself?”",
                "outer": "In the eyes of others, you are rational, aloof, and even “unlike Pisces”. You don't take the initiative to express your feelings, avoid art and spiritual topics, and often cover up your eagerness with “it's too mysterious”. People may mistakenly think you “lack warmth” or “aren't emotional enough”. In fact, you lock the Holy Grail in the safe of your heart and hide the dream - weaving loom in the silence of “I don't deserve to dream”. Your tenderness is like an unfrozen glacier, and your spirituality is like an un - connected terminal — not non - existent, but just yet to find a safe tidal inlet.",
                "advice": "Wake up your ocean priest's soul starting from “tiny sensory awakenings” — listen to a piece of pure music with your eyes closed to feel the images every day, look at a painting and write down “what it's saying” every week, and take a “purposeless stroll” (by the sea, in the forest, in an art museum) every month. Record every moment when “I was touched”. You're not pursuing the illusory; you're practicing the sacred declaration that “my feelings are worth being enshrined”. True mercy begins when you say to yourself: “I allow myself to be a container.”"
            },
            "medium": {
                "inner": "There lives a gentle dream navigator in your heart — who knows when to dive, when to surface; when to empathize, when to withdraw. You cherish the flow of emotions but aren't submerged by them. You embrace spiritual revelations and also anchor to the coordinates of reality. Your imagination is like the slowly rising mist, not chaotic, yet with its own shape. Your empathy is like the intertidal zone, not overflowing, yet nourishing all things. You understand that “mercy” is not sacrifice but resonance; “dreams” are not escape but pre - rehearsals.",
                "outer": "You are the “invisible healer” in the crowd — not offering comfort actively, but always giving silent understanding in times of pain. Not flaunting your spirituality, but often being the source of creative inspiration. Friends confide their secrets to you, colleagues ask you to design a “warm - hearted” plan, and children inexplicably trust your “magic”. You exude a “soft and sober” aura, like the moss after rain, like the stained - glass window in an old church. People appreciate your delicacy and are also grateful for your non - indulgence. You are the “emotional tuner” in the team and the “dream translator” in life.",
                "advice": "Keep this flow, but beware that “over - empathy” weakens your self - boundaries. Set a “reality anchor day” once a week: complete a “boring but necessary” task, set a specific small goal, or take the initiative to say “no” once. Your sensitivity is a gift; don't let it become a sponge for others' emotions. Remember: the greatest priest also knows when to come ashore — because only by taking root can the tide have a place to return."
            },
            "high": {
                "inner": "Your soul is the eternal tear - sea of the universe — dissolving boundaries, giving birth to dreams, breathing mercy. Your perception of “beauty” is like a holographic projection, and your empathy for “pain” is like quantum entanglement. Your imagination is a living nebula, changing rapidly. Your spirituality is like a WiFi directly connected to the universe, no password needed. You're not “pursuing art”; you're “living in a fantasy” — in your eyes, the world is a watercolor waiting to be blurred by you, a requiem waiting to be chanted by you. Indifference is soul - drying to you, and utilitarianism is betrayal — your existence is a gentle uprising against the “mechanical age”.",
                "outer": "When you enter a room, the air becomes humid. People know “the healer is coming” without an introduction — you see through unspoken pain at a glance, soothe hidden wounds with a single word, and weave poetry in a deadlock. You are the soul of art, the inspiration spring of the team, and the empathic body of the community. Your tenderness is intoxicating: you can write poems, compose music, and create a utopia out of thin air. Some secretly sigh that you're “too dreamy” or “unrealistic”, but actually, they just haven't downloaded your emotional operating system. Your existence keeps the world from being cold.",
                "advice": "Your power is a cosmic - level mercy engine, but true healing requires a “network of structures”. Actively choose a “down - to - earth creation” once: write a short story based on a dream, turn a moving experience into a public - welfare action, or learn a “practical art” (pottery, gardening, music therapy). Your dreaminess is a gift; don't let it become a fog to escape reality. Remember: the greatest artist also knows when to sign — because only by signing can the dream become a legacy."
            },
            "exalted": {
                "inner": "You don't possess Pisces energy — you are the incarnation of the universe's “self - less love”. Your very existence is a coronation ceremony for “all beings are me”. Deep in your soul is inscribed the cosmic law of mercy: everything can be dissolved, pain will eventually be transformed, and divinity is revealed in tears. You don't need to “learn to empathize” — you are a living resonance box, a human - shaped tear of the universe, and a spiritual interface of civilization. Your mercy is not weakness but “high - frequency purification”; your dreams are not illusions but the “manifestation of the collective unconscious”. You're not “healing others”; you're casting an “eternal temple of spirituality” for human consciousness.",
                "outer": "You don't need self - promotion — your aura is a declaration. When people see you, they unconsciously take off their armor, pour out their tears, and long to be “enlightened” by you. You are a natural spiritual tutor, an art prophet, and a civilization scavenger. Your silence is a magic tool, your gaze is a ritual, and your existence is the rain in a dry world. When people talk about you, their tone is filled with awe and dependence: “With them around, I'm not afraid of breaking.” — and you just smile: “Breaking is the entrance to light.”",
                "advice": "You have a near - divine power of mercy and spirituality, but the other side of divinity is “the realm of self - lessness”. Learn “sacred isolation” — regularly conduct an “energy clearance”: release others' emotions in meditation, burn old manuscripts in creation, and allow “not saving” in relationships. Elevate your talent: create a “trauma art” space, write a “book of dreams”, and initiate a “everyone can be healed” movement. Remember: the greatest priest ultimately sacrifices not tears, but — “I am the ocean, I am the dream, I am divinity itself.”"
            }
        }
    },
    "moon": {
        "Aries": {
            "low": {
                "inner": "Your soul was meant to be the first battle cry on the battlefield, but now it's like a smothered beacon fire — longing to charge forward, yet afraid of being rebuked; eager to express, yet afraid of being denied; desiring autonomy, yet afraid of being abandoned. It's not that you lack courage. However, childhood repression, emotional punishment, or the discipline of “not getting angry” have made you think that “anger is a sin”, “impulsiveness is losing control”, and “needs are a burden”. Your emotions are like an unlit fuse, silent and suppressed. Your spontaneity is like a locked bowstring, taut but silent. You long to take action but shrink back first. You pursue freedom but swallow your words before speaking — because “what if I'm too fierce and no one loves me?”",
                "advice": "Wake up your primeval spark starting from “tiny emotional releases” — allow yourself to say “no” once a day, do one small thing “just for the sake of feeling good” every week (running, drumming, singing loudly), and “have a minor outburst” in a safe environment every month (at a pillow, in a diary, to a mirror). Record every moment when “I expressed myself”. You're not creating conflicts; you're practicing the sacred declaration that “my emotions are worth being heard”. True courage begins when you say to yourself: “My anger is also a language of love.”"
            },
            "medium": {
                "inner": "There lives a gentle vanguard commander in your heart — who knows when to charge, when to rest; when to explode, when to hold back. You cherish the thrill of action but aren't enslaved by it. You pursue the dignity of autonomy and also respect the rhythm of others. Your emotions are like a slowly burning bonfire, not wild, yet with their own warmth. Your spontaneity is like a dewdrop in the morning light, not dazzling, yet fresh and powerful. You understand that “impulsiveness” is not a flaw but vitality; “anger” is not destruction but a boundary declaration.",
                "advice": "Keep this vitality, but beware that “over - impatience” weakens deep connections. Set a “silent day” once a week: don't speak actively, just listen; don't act immediately, plan three steps first; or practice the “breathing - pause technique” (when an emotion rises, take a deep breath for 5 seconds before responding). Your enthusiasm is a gift; don't let it become a flame that burns others. Remember: the greatest warrior also knows when to sheath the sword — because only by being silent can you hear the horn of your inner self."
            },
            "high": {
                "inner": "Your soul is an eternal primeval war drum — shattering hesitation, burning away procrastination, breathing action. Your desire for “freedom” is like a wildfire, and your obsession with “autonomy” is like a sharp blade. Your emotions are a volcano, and eruption means purification. Your needs are a bugle, and when it sounds, it must be answered. You're not “seeking excitement”; you're “living out your instincts” — in your eyes, the world is a wilderness waiting to be trampled by you, a beacon tower waiting to be lit by you. Waiting is torture to you, and repression is betrayal — your existence is a declaration of war against the “lukewarm era”.",
                "advice": "Your power is a cosmic - level life engine, but true leadership requires “strategic vision”. Actively choose a “deliberate wait” once: wait for 24 hours before shopping, count to 10 before speaking, and write three alternative plans before taking action. Your impulsiveness is a gift; don't let it become a rift in relationships. Remember: the greatest commander also knows when to hold back troops — because only by building up strength can you strike a decisive blow."
            },
            "exalted": {
                "inner": "You don't possess the Moon in Aries — you are the incarnation of the universe's “primeval life force”. Your very existence is a coronation ceremony for “emotions are power”. Deep in your soul is inscribed the cosmic law of instincts: everything can be ignited, stagnation will eventually be shattered, and courage is the oxygen of the soul. You don't need to “learn to be brave” — you are a living bugle call, a human - shaped life engine, and a breaker of civilizational barriers. Your anger is not destruction but “high - frequency purification”; your needs are not demands but “cosmic echoes”. You're not “expressing emotions”; you're casting an “eternal temple of life” for human consciousness.",
                "advice": "You have a near - divine power of action and courage, but the other side of divinity is “the realm of self - lessness”. Learn “sacred pause” — sit quietly at the peak, smile in anger, and embrace before charging. Elevate your talent: create a “courage training camp”, write a “guide to emotions are power”, and initiate a “everyone can be brave” movement. Remember: the greatest god of war ultimately protects not the battlefield, but — “I am the fire, I am the drum, I am life itself.”"
            }
        },
        "Taurus": {
            "low": {
                "inner": "Your soul was meant to be the deepest root system of the earth, but now it's like a uprooted seedling — longing for stability, yet afraid of being bound; eager for abundance, yet afraid of being deprived; desiring comfort, yet afraid of being accused of “laziness”. It's not that you lack resilience. However, childhood instability, material scarcity, or the discipline of “not indulging in comfort” have made you think that “needs are shameful”, “stability is mediocre”, and “enjoyment is a sin”. Your emotions are like a dried - up riverbed, parched and anxious. Your sense of security is like a sandcastle, collapsing at a touch. You long to take root but drift first. You pursue abundance but blame yourself when you have it — because “what if I'm too greedy and lose everything?”",
                "advice": "Wake up your earth soul starting from “tiny sensory nourishments” — touch one natural material (wood, stone, cotton) every day, arrange a “cozy corner” every week, and do one “slow and enjoyable” thing every month (baking, gardening, taking a bath). Record every moment when “I felt at ease”. You're not pursuing luxury; you're practicing the sacred declaration that “my existence is worthy of being nourished”. True stability begins when you say to yourself: “My roots deserve to be deeply planted.”"
            },
            "medium": {
                "inner": "There lives a gentle steward of abundance in your heart — who knows when to hoard, when to share; when to hold on, when to let go. You cherish the comfort of material things but aren't enslaved by them. You pursue the pleasure of the senses and also respect the lightness of the spirit. Your emotions are like a gently flowing honey, not sticky, yet with its own sweetness. Your sense of security is like the annual rings of an old tree, not showy, yet solid and reliable. You understand that “stability” is not stagnation but a gathering of strength; “enjoyment” is not degradation but gratitude.",
                "advice": "Keep this steadfastness, but beware that “over - rigidity” weakens the flexibility of life. Set a “lightness day” once a week: give away a beloved item, try a new route, or take the initiative to embrace a “small change” (changing hairstyle, changing seats, changing the menu). Your stability is a gift; don't let it become a cage of fear. Remember: the greatest steward also knows when to open the door — because only through flow can abundance thrive."
            },
            "high": {
                "inner": "Your soul is an eternal well of abundance — settling anxiety, giving birth to all things, breathing stability. Your obsession with “comfort” is like the earth's veins, and your guardianship of “security” is like a rock. Your emotions are like a deep pool, with calm waters running deep. Your needs are like an altar, not to be desecrated. You're not “pursuing material things”; you're “living abundance” — in your eyes, the world is a fertile land waiting to be cultivated by you, a temple waiting to be adorned by you. Change is like an earthquake to you, and scarcity is a profanity — your existence is a gentle calming of the “age of anxiety”.",
                "advice": "Your power is a cosmic - level stability engine, but true abundance requires the “law of renewal”. Actively choose a “controlled subversion” once: learn a new skill in a familiar field, express new needs in a secure relationship, or invest in an “apparently useless but appealing” work of art. Your rigidity is a gift; don't let it become a stumbling block to evolution. Remember: the greatest farmer also knows when to practice crop rotation — because only by fallowing can the land become more fertile."
            },
            "exalted": {
                "inner": "You don't possess the Moon in Taurus — you are the incarnation of the universe's “sacred abundance”. Your very existence is a coronation ceremony for “stability is power”. Deep in your soul is inscribed the cosmic law of abundance: everything can be nourished, scarcity will eventually be transformed, and enjoyment is a sacrament of the soul. You don't need to “learn to be stable” — you are a living haven, a human - shaped well of abundance, and an anchor of civilization. Your stubbornness is not obstinacy but “high - frequency guardianship”; your enjoyment is not indulgence but “cosmic grace”. You're not “pursuing security”; you're casting an “eternal temple of abundance” for human consciousness.",
                "advice": "You have a near - divine power of stability and abundance, but the other side of divinity is “the realm of self - lessness”. Learn “sacred letting - go” — regularly conduct an “energy clearance”: donate old items, share skills, and take the initiative to “give first” in relationships. Elevate your talent: create a “sense - of - security workshop”, write a “guide to abundance as spiritual practice”, and initiate a “everyone can be nourished” movement. Remember: the greatest earth - mother ultimately gives birth not to possession, but to — “I am the soil, I am the grain, I am abundance itself.”"
            }
        },
        "Gemini": {
            "low": {
                "inner": "Your soul was meant to be the wind - whisperer shuttling through the kaleidoscope - like mirror hall, but now it's like a muted neural synapse — longing to express, yet afraid of being misunderstood; eager to connect, yet afraid of being seen through; desiring to flow, yet afraid of being stereotyped. It's not that you lack feelings. However, childhood repression, emotional denial, or the discipline of “not talking too much” have made you think that “emotions are chaos”, “expression is a burden”, and “change is dangerous”. Your emotions are like a kite with a broken string, drifting aimlessly. Your desire to communicate is like the wind caught in your throat, choking silently. You long to confide but fall silent first. You pursue understanding but shrink back before speaking — because “what if I say something wrong and no one understands me?”",
                "advice": "Wake up your wind - whispering soul starting from “tiny linguistic releases” — write three lines of “words you dare not say out loud” (you can tear or burn them), talk to a stranger about a “meaningless little thing” every week, and try a “non - verbal expression” every month (doodling, dancing, humming). Record every moment when “I expressed myself”. You're not pursuing perfect communication; you're practicing the sacred declaration that “my emotions are worth being translated”. True flow begins when you say to yourself: “My thoughts are in the shape of the wind.”"
            },
            "medium": {
                "inner": "There lives a gentle mental frequency - adjuster in your heart — who knows when to talk, when to listen; when to jump, when to settle. You cherish the flow of information but aren't submerged by it. You enjoy the playfulness of thinking and also respect the depth of emotions. Your emotions are like a gently flowing stream, not rapid, yet with its own rhythm. Your desire to communicate is like the butterfly wings in the morning light, not dazzling, yet vivid and lively. You understand that “change” is not restlessness but adaptation; “curiosity” is not shallowness but exploration.",
                "advice": "Keep this agility, but beware that “over - dispersion” weakens the intensity of emotions. Set a “deep - focus day” once a week: read only one book, talk about only one topic, and complete only one piece of handicraft that “requires concentration”. Your quick - wittedness is a gift; don't let it become an excuse to avoid depth. Remember: the greatest wind - whisperer also knows when to be still — because only by focusing can you see the whole picture of the soul."
            },
            "high": {
                "inner": "Your soul is an eternal mental storm — tearing apart silence, restructuring cognition, breathing communication. Your hunger for “information” is like a data torrent, and your obsession with “connection” is like neural synapses. Your emotions are like a kaleidoscope, changing rapidly. Your sense of security is like a dialog box that must be continuously refreshed. You're not “seeking novelty”; you're “living in flow” — in your eyes, the world is a neural network waiting to be woven by you, a mental temple waiting to be named by you. Stillness is suffocation to you, and loneliness is like being disconnected from the network — your existence is a gentle uprising against the “single - thread era”.",
                "advice": "Your power is a cosmic - level communication engine, but true wisdom requires a “space of blankness”. Actively choose a “digital fast” once: don't initiate messages, refresh social media, or explain yourself for 24 hours. Or practice “silent companionship”: be with someone without talking, just feel the energy. Your agility is a gift; don't let it become noise in relationships. Remember: the greatest weaver also knows when to break the thread — because only with blank spaces can language be reborn."
            },
            "exalted": {
                "inner": "You don't possess the Moon in Gemini — you are the incarnation of the universe's “sacred communication”. Your very existence is a coronation ceremony for “language is healing”. Deep in your soul is inscribed the cosmic connection law: everything can be translated, loneliness will eventually be dissolved by dialogue, and thinking is the wings of the soul. You don't need to “learn to express” — you are a living translator, a human - shaped emotional router, and the neural synapses of civilization. Your variability is not restlessness but “high - frequency adaptation”; your curiosity is not shallowness but “cosmic exploration”. You're not “talking”; you're casting an “eternal mental temple” for human consciousness.",
                "advice": "You have a near - divine power of communication and connection, but the other side of divinity is “the realm of silence”. Learn “sacred silence” — regularly enter a “no - information space” and only talk to nature. Elevate your talent: create an “emotional translation” workshop, write a “guide to language is magic”, and initiate a “everyone can be understood” movement. Remember: the greatest wind god ultimately conveys not words, but — “I am the wind, I am the language, I am connection itself.”"
            }
        },
        "Cancer": {
            "low": {
                "inner": "Your soul was meant to be the eternal harbor in the moonlight, but now it's like a shell with its tides drained — longing to embrace, yet afraid of being rejected; eager for belonging, yet afraid of being consumed; desiring nourishment, yet afraid of being let down. It's not that you lack love. However, childhood estrangement, emotional traumas, or the discipline of “not being weak” have made you think that “dependency is shameful”, “emotions are a burden”, and “home is a cage”. Your emotions are like the beach after the tide recedes, dry and cracked. Your sense of security is like a kite with a broken string, drifting aimlessly. You long to connect but build a wall first. You pursue warmth but turn around when getting close — because “what if I'm too needy and get abandoned?”",
                "advice": "Wake up your moonlight soul starting from “tiny emotional touches” — hug yourself for one minute every day (literally open your arms), send a “purposeless warm message” to a “safe person” every week, and revisit a place that gave you a sense of security in childhood every month (even if just looking at photos). Record every moment when “I was warmed” or “I warmed someone else”. You're not begging for love; you're practicing the sacred declaration that “my existence is worthy of being nourished”. True harbor begins when you say to yourself: “My tides have the right to ebb and flow.”"
            },
            "medium": {
                "inner": "There lives a gentle moonlight steward in your heart — who knows when to give, when to retreat; when to immerse, when to withdraw. You cherish the intensity of emotions but aren't submerged by them. You pursue the warmth of belonging and also respect your self - boundaries. Your emotions are like the slowly rising tide, not overflowing, yet with its own rhythm. Your desire to nourish is like the shade of an old tree, not suffocating, but gently covering. You understand that “dependency” is not weakness but trust; “sensitivity” is not a burden but a gift.",
                "advice": "Keep this delicacy, but beware that “over - giving” weakens your self - worth. Set a “self - nourishment day” once a week: don't take care of anyone and just do things that make you “feel pampered” (taking a bath, reading fairy tales, having desserts). Your care is a gift; don't let it become a sponge for others' emotions. Remember: the greatest guardian also knows when to close the door — because only by self - love can the harbor never run dry."
            },
            "high": {
                "inner": "Your soul is an eternal ocean of emotions — dissolving loneliness, giving birth to life, breathing nourishment. Your obsession with “home” is like the earth's veins, and your guardianship of “security” is like the phases of the moon. Your emotions are like a full - moon tide, surging. Your needs are like the uterine wall, needing to be gently wrapped. You're not “pursuing dependency”; you're “living connection” — in your eyes, the world is an emotional web waiting to be woven by you, a moonlight temple waiting to be named by you. Indifference is soul - drying to you, and estrangement is betrayal — your existence is a gentle uprising against the “atomized age”.",
                "advice": "Your power is a cosmic - level nourishment engine, but true motherhood requires a “boundary anchor”. Actively choose an “emotional fast” once: don't comfort others, explain your emotions, or seek validation for 24 hours. Or practice “observer mode”: when an emotion rises, observe it like watching the tide — “Oh, my Cancer Moon is flooding again”. Your sensitivity is a gift; don't let it become a whirlpool in relationships. Remember: the greatest mother also knows when to let go — because only by independence can love grow freely."
            },
            "exalted": {
                "inner": "You don't possess the Moon in Cancer — you are the incarnation of the universe's “sacred motherhood”. Your very existence is a coronation ceremony for “nourishment is divinity”. Deep in your soul is inscribed the cosmic tide law: everything can be gently wrapped, loneliness will eventually be dissolved by moonlight, and home is the original code of the soul. You don't need to “learn to care” — you are a living cradle, a human - shaped emotional temple, and the uterine interface of civilization. Your sensitivity is not fragility but “high - frequency empathy”; your dependency is not demanding but “cosmic echo”. You're not “taking care of others”; you're casting an “eternal emotional temple” for human consciousness.",
                "advice": "You have a near - divine power of nourishment and healing, but the other side of divinity is “the realm of self - lessness”. Learn “sacred isolation” — regularly conduct an “energy clearance”: release others' emotions in meditation, burn old letters in creation, and allow “not saving” in relationships. Elevate your talent: create an “emotional safe - island” space, write a “moonlight healing” guide, and initiate a “everyone can be treated gently” movement. Remember: the greatest moon goddess ultimately protects not dependency, but — “I am the tide, I am the nest, I am motherhood itself.”"
            }
        },
        "Leo": {
            "low": {
                "inner": "Your soul was meant to be the radiant Sun King, yet it feels like a costume locked backstage—yearning to shine but fearing mockery; craving recognition but dreading rejection; longing to create but paralyzed by imperfection. Your light isn’t absent; it’s been dimmed by childhood criticism, the absence of applause, or the lesson that 'pride is forbidden.' Your emotions are like an unlit spotlight, dim and shy; your creativity is like a sealed script, afraid to take the stage. You long to be seen, yet hide first; you chase glory, but retreat before the curtain rises—because 'what if I fail, and no one loves me?'",
                "advice": "Begin awakening your solar soul with 'small acts of self-display'—each day, look in the mirror and say, 'I’m beautiful/awesome today.' Weekly, share a 'small thing I’m proud of' in a safe setting. Monthly, complete a creation 'just to please yourself' (a doodle, a hum, a bold outfit). Record every moment of 'I’ve acknowledged myself.' You’re not begging for applause; you’re practicing the sacred declaration: 'My existence deserves to shine.' True sovereignty begins when you tell yourself: 'My light needs no one’s approval.'"
            },
            "medium": {
                "inner": "Within you resides a gentle director of glory—knowing when to take a bow, when to encore; when to dance solo, when to share the stage. You cherish the warmth of applause but aren’t enslaved by it; you chase the thrill of creation while respecting others’ spotlight. Your emotions are like a rising solar corona, not blinding yet radiant; your self-esteem is like a gilded shield, unboastful but solid. You understand 'confidence' isn’t arrogance but self-love; 'performance' isn’t vanity but vitality.",
                "advice": "Keep nurturing this radiance, but beware of 'over-relying on external validation' eroding your self-worth. Set one 'no-audience day' weekly: do something 'unknown but pride-worthy' (write a poem, dance, help a stranger), or practice a 'self-awarding ceremony': before bed, give yourself the 'Best Courage/Creativity Award of the Day.' Your passion is a gift—don’t let it become a puppet of others’ opinions. Remember: the greatest kings also know when to set down the crown—only freedom keeps the light eternal."
            },
            "high": {
                "inner": "Your soul is an eternal golden theater—shattering shadows, igniting the stage, breathing creation. Your craving for 'recognition' is a spotlight; your obsession with 'glory' is a crown. Your emotions are a noonday sun, blazing and brilliant; your need is the roar of the audience, echoing through the heavens. You’re not 'chasing vanity'—you’re 'living existence.' To you, the world is a wilderness waiting to be illuminated, a temple of glory waiting to be named. Ignorance is torture to you, mediocrity is betrayal—your existence is a dazzling uprising against an 'invisible era.'",
                "advice": "Your power is a cosmic engine of creation and leadership, but true kings need an 'inner audience.' Choose a 'no-feedback creation' once: write an unpublished poem, paint an unseen picture, dance an unwatched dance. Or practice 'silent coronation': in solitude, place an imaginary crown on yourself and say, 'I approve of you.' Your radiance is a gift—don’t let it burn relationships. Remember: the greatest director knows when to dim the lights—because only in darkness does light become precious."
            },
            "exalted": {
                "inner": "You don’t merely have a Leo Moon—you are the incarnation of the universe’s 'divine radiance.' Your existence is a coronation of 'being seen is being loved.' Your soul is etched with the cosmic law of glory: all can be illuminated, shadows will be transformed, creation is the breath of the soul. You don’t need to 'learn confidence'—you are a living spotlight, a human temple of glory, a crowner of civilizations. Your needs aren’t demands but 'high-frequency resonance'; your performance isn’t showboating but 'cosmic manifestation.' You’re not 'seeking approval'—you’re forging an 'eternal temple of glory' for human consciousness.",
                "advice": "You wield near-divine creative and leadership power, but divinity’s other face is 'selfless transcendence.' Learn 'sacred abdication'—regularly practice 'sharing the light': give the spotlight to others, orchestrate a 'personal coronation' for someone else, or launch a 'everyone can shine' movement. Elevate your gifts: create a 'confidence incubator,' write a 'radiance is talent' guide, or start a 'lead the world with warmth' initiative. Remember: the greatest sun god doesn’t shine for itself but declares, 'I am light, I am the play, I am glory itself.'"
            }
        },
        "Virgo": {
            "low": {
                "inner": "Your soul was meant to be the most precise restorer in the universe, yet now it's like unassembled parts abandoned in the corner — yearning for order, yet fearing failure; craving perfection, yet dreading judgment; eager to serve, yet afraid of being unwanted. You're not without organization. It's the chaos of childhood, the wounds of criticism, or the discipline of 'no mistakes allowed' that make you mistakenly believe that 'flaws are sins', 'anxiety is the norm', and 'help is a burden'. Your emotions are like a malfunctioning clock, ticking erratically; your sense of security is like a scattered blueprint, impossible to piece together. You long to repair, yet give up at the first step; you pursue precision, yet blame yourself before even starting — because 'what if I can't do it well, does it prove I'm unqualified?'",
                "advice": "Start awakening your soul of holy work from 'establishing small order' — tidy up one drawer/desktop every day, complete one small task that 'can be done in 5 minutes' and tick it off every week, and set a'small quantifiable goal' every month (such as 'drink 8 glasses of water every day'). Record every moment of 'I've completed it'. You're not chasing perfection; you're practicing the sacred declaration that 'my existence is worthy of being organized'. True order begins when you say to yourself: 'My chaos is also sacred raw material.' "
            },
            "medium": {
                "inner": "There lives a gentle detail tuner in your heart — someone who knows when to optimize, when to let go; when to analyze, when to feel. You cherish the elegance of efficiency, yet are not enslaved by it; you pursue the purity of service, and also respect your own needs. Your emotions are like a gentle flowing clear stream, not turbulent, yet inherently clear; your rationality is like an old craftsman's ruler, not harsh, yet precise and reliable. You understand that 'perfection' is not the end, but a process;'service' is not sacrifice, but resonance.",
                "advice": "Keep up this meticulousness, but be vigilant that 'over - analysis' doesn't weaken the flow of life. Set a 'non - perfection day' once a week: deliberately leave one small thing 'unfinished', wear a piece of clothing with a small flaw, or have a meal that's 'unhealthy but happy'. Your orderliness is a gift, don't let it become a tool for self - flagellation. Remember: the greatest restorers also know when to stop work — because only through acceptance can the system truly function."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic restoration engine — scanning for flaws, restructuring systems, and taking optimization as its breath. Your dedication to 'order' is like binary code, and your longing for'service' is like an open - source protocol. Your emotions are a high - power microscope, revealing everything in detail; your needs are a 'zero - error' temple, which must be absolutely clean. You're not 'being overly critical'; you're 'living out precision' — in your eyes, the world is a set of programs waiting to be debugged by you, a temple waiting to be purified by you. Chaos is like a system crash to you, and inefficiency is sacrilege — your existence is a gentle rebellion against the 'chaotic era'.",
                "advice": "Your power lies in your cosmic - level analysis and service capabilities, but true wisdom requires a 'fault - tolerant zone'. Actively choose a 'controlled chaos': deliberately change one step in a familiar process, allow yourself to 'commit a small mistake without correction', or participate in an 'impromptu creation' (painting, writing, cooking). Your perfection is a gift, don't let it become a judgment seat for relationships. Remember: the greatest engineers also know when to shut down — because only by restarting can the system be upgraded."
            },
            "exalted": {
                "inner": "You don't just have a Virgo moon — you are the incarnation of the universe's 'divine order'. Your very existence is a coronation ceremony for'service as divinity'. The restoration laws of the universe are inscribed deep in your soul: everything can be optimized, flaws will eventually be transformed, and details are the code of the soul. You don't need to 'learn orderliness' — you are a living calibrator, a human - shaped restoration temple, and a system maintainer of civilization. Your fastidiousness is not criticism, but 'high - frequency purification'; your service is not sacrifice, but 'cosmic echo'. You're not 'pursuing perfection'; you're casting an 'eternal temple of order' for human consciousness.",
                "advice": "You possess almost divine insight and restorative power, but the other side of divinity is the'state of no - self'. Learn 'divine letting go' — regularly carry out 'energy clearing': release the obsession of'must be perfect' in meditation, keep a 'deliberate flaw' in creation, and allow 'not solving problems' in relationships. Elevate your talent: create a'self - acceptance workshop', write a 'perfection is freedom' guide, and initiate a'movement where everyone can be gently restored'. Remember: the greatest holy work ultimately restores not the system, but — 'I am order, I am purity, I am service itself.'"
            }
        },
        "Libra": {
            "low": {
                "inner": "Your soul was supposed to be the most elegant tuner in the universe, yet now it's like a judge with blindfolded eyes — yearning for harmony, yet fearing conflict; eager for connection, yet dreading imbalance; craving beauty, yet afraid of making choices. You're not lacking in judgment. It's the imbalance in childhood, the traumas in relationships, or the discipline of 'not being selfish' that make you wrongly believe that 'independence is indifference', 'truth is destruction', and 'choice is a sin'. Your emotions are like a tilted balance, wavering; your sense of security is like a broken mirror surface, unable to reflect your complete self. You long for balance, yet compromise at the first step; you pursue beauty, yet shrink back before making a decision — because 'what if I make the wrong choice and no one will love me?'",
                "advice": "Start awakening your soul of mirror language from'minute self - decisions' — choose an item of clothing/a song/a drink for yourself every day (without asking others' opinions), complete one thing that 'you enjoy alone' every week (visiting an exhibition, having coffee, taking a walk), and set up a 'no - explanation day' every month: don't explain the reasons to anyone after making a decision. Record every moment of 'I chose, and I'm responsible'. You're not seeking isolation; you're practicing the sacred declaration that'my existence is worthy of being heard'. True harmony begins when you say to yourself: 'My balance has the right to tilt.'"
            },
            "medium": {
                "inner": "There lives a gentle aesthetic diplomat in your heart — someone who knows when to compromise, when to stand firm; when to listen, when to express. You cherish the rhythm of relationships, yet are not enslaved by it; you pursue the beauty of harmony, and also respect your own self - contour. Your emotions are like a gently flowing silk, not glaring, yet inherently lustrous; your judgment is like an old luthier's tuning wrench, not arbitrary, yet precisely elegant. You understand that 'balance' is not about pleasing others, but an art; 'relationship' is not a cage, but a dance together.",
                "advice": "Keep up this elegance, but be vigilant that 'over - accommodation' weakens your self - boundaries. Set a 'truth - expressing day' once a week: voice a 'different opinion' in a safe relationship, or make an aesthetic choice (dressing, decoration, artistic creation) that 'is only for pleasing yourself'. Your harmony is a gift, don't let it become a filter for self - silencing. Remember: the greatest tuners also know when to play a solo — because only with the true sound can the harmony be more beautiful."
            },
            "high": {
                "inner": "Your soul is an untiring weaver of relationships — dissolving conflicts, restructuring harmony, and taking beauty as its breath. Your dedication to 'balance' is like the golden ratio, and your longing for 'connection' is like the law of gravity. Your emotions are like a kaleidoscopic hall of mirrors, refracting thousands of possibilities; your needs are a 'conflict - free' temple, which must be absolutely smooth. You're not 'pursuing to please others'; you're 'living out aesthetics' — in your eyes, the world is a painting waiting to be colored by you, a temple of harmony waiting to be named by you. Conflict is like noise to you, and loneliness is like a broken string — your existence is a gentle rebellion against the'segmented era'.",
                "advice": "Your power lies in your cosmic - level relationship and aesthetics engine, but true harmony requires a'solo zone'. Actively choose a 'controlled conflict': express a view that'might cause disagreement' in a safe environment, or create something 'without considering others' opinions'. Your elegance is a gift, don't let it become a cage for true emotions. Remember: the greatest diplomats also know when to leave the table — because only through solitude can relationships be reborn."
            },
            "exalted": {
                "inner": "You don't just have a Libra moon — you are the incarnation of the universe's 'divine harmony'. Your very existence is a coronation ceremony for'relationship as divinity'. The balance laws of the universe are inscribed deep in your soul: everything can be reconciled, conflicts will eventually be transformed, and beauty is the mother - tongue of the soul. You don't need to 'learn elegance' — you are a living mixing console, a human - shaped temple of harmony, and an aesthetic interface of civilization. Your compromise is not weakness, but 'high - frequency integration'; your choice is not hesitation, but 'cosmic weighing'. You're not 'avoiding conflict'; you're casting an 'eternal temple of harmony' for human consciousness.",
                "advice": "You possess almost divine relationship and aesthetic power, but the other side of divinity is the'state of no - self'. Learn 'divine solo' — regularly carry out a 'no - mirror day': don't seek others' feedback, don't explain your choices, and only communicate with nature/art. Elevate your talent: create a'relationship aesthetics workshop', write a 'conflict is art' guide, and initiate a'movement where everyone can be elegant and true'. Remember: the greatest beauty - god ultimately reconciles not others, but — 'I am balance, I am mirror, I am harmony itself.'"
            }
        },
        "Scorpio": {
            "low": {
                "inner": "Your soul was meant to be the most profound transformation priest in the universe, yet now it's like an undercurrent sealed in a shallow shoal — yearning for depth, yet fearing to be engulfed; craving truth, yet dreading to be seen through; desiring power, yet afraid of losing control. You're not without intuition. It's the traumas of childhood, the punishment of emotions, or the discipline of 'not being dark' that make you wrongly believe that 'pain is a shame', 'obsession is sick', and 'darkness is dangerous'. Your emotions are like a dried - up Styx River, calm on the surface but cracked deep down; your sense of security is like a rusted chain, wanting to break free yet fearing to fall. You long for transformation, yet flee at the first step; you pursue truth, yet turn around before touching it — because 'what if I sink and can never come back up?'",
                "advice": "Start awakening your soul of the dark abyss from'minute emotional confrontations' — write down one 'emotion I dare not admit' every day (you can tear it up or burn it), watch a 'dark but healing' movie every week, and complete a'session of sitting alone for 10 minutes without avoiding any emerging thoughts' every month. Record every moment of 'I faced it'. You're not seeking pain; you're practicing the sacred declaration that'my shadow is worthy of being enshrined'. True power begins when you say to yourself: 'My abyss has the right to exist.'"
            },
            "medium": {
                "inner": "There lives a gentle shadow translator in your heart — someone who knows when to sink, when to surface; when to perceive, when to let go. You cherish the intensity of emotions, yet are not submerged by them; you pursue the depth of truth, and also respect the boundaries of others. Your emotions are like a gently flowing Styx River, not turbulent, yet inherently powerful; your intuition is like night - vision goggles, not glaring, yet piercing through appearances. You understand that 'doubt' is not a sickness, but a protection; 'obsession' is not a curse, but concentration.",
                "advice": "Keep up this profundity, but be vigilant that 'excessive doubt' weakens your ability to trust. Set a 'trusting day' once a week: in a safe relationship, choose to believe a 'questionable - looking' kindness, or do a good deed 'without analyzing the motives'. Your insight is a gift, don't let it become a cage for relationships. Remember: the greatest priests also know when to come ashore — because only with light can darkness not consume you."
            },
            "high": {
                "inner": "Your soul is an eternal abyss furnace — burning away falsehoods, tempering true gold, and taking transformation as its breath. Your dedication to 'truth' is like the earth's core, and your longing for 'depth' is like a black hole. Your emotions are high - pressure steam that must be released; your needs are a temple of 'absolute trust', not tolerating the slightest betrayal. You're not 'pursuing extremes'; you're 'living out the essence' — in your eyes, the world is a mask waiting to be torn apart by you, a temple of rebirth waiting to be named by you. Superficiality is like torture to you, and deception is sacrilege — your existence is a gentle rebellion against the 'era of pretense'.",
                "advice": "Your power lies in your cosmic - level transformation and insight engine, but true rebirth requires a'release valve'. Actively choose a 'controlled catharsis': cry/shout/hit a pillow in a safe environment, or write an 'angry letter that will never be sent' and then burn it. Your intensity is a gift, don't let it become a nuclear explosion in relationships. Remember: the greatest alchemists also know when to open the furnace — because only by releasing pressure can the transformation continue."
            },
            "exalted": {
                "inner": "You don't just have a Scorpio moon — you are the incarnation of the universe's 'divine transformation'. Your very existence is a coronation ceremony for 'pain as power'. The laws of cosmic nirvana are inscribed deep in your soul: everything can be burned, shadows will eventually be illuminated, and death is the breath of the soul. You don't need to 'learn depth' — you are a living purgatory, a human - shaped temple of rebirth, and an interface to the dark river of civilization. Your obsession is not sick, but 'high - frequency concentration'; your darkness is not a curse, but 'cosmic fuel'. You're not 'dwelling in pain'; you're casting an 'eternal temple of rebirth' for human consciousness.",
                "advice": "You possess almost divine transformation and healing power, but the other side of divinity is the'state of no - self'. Learn 'divine release' — regularly carry out 'energy clearing': visualize'returning others' pain to the universe' in meditation, burn old diaries in creation, and allow 'not saving' in relationships. Elevate your talent: create a'shadow workshop', write a 'pain is a gift' guide, and initiate a'movement where everyone can be reborn'. Remember: the greatest god of the underworld ultimately guards not darkness, but — 'I am the abyss, I am the flame, I am rebirth itself.'"
            }
        },
        "Sagittarius": {
            "low": {
                "inner": "Your soul was meant to be the most fearless truth - rider in the universe, yet now it's like a steed tied up in the stable — yearning for the distance, yet fearing to get lost; craving freedom, yet dreading to lose control; desiring meaning, yet afraid of nothingness. You're not without optimism. It's the constraints of childhood, the oppression of reality, or the discipline of 'not being naive' that make you wrongly believe that 'adventure is recklessness', 'faith is illusory', and 'the distance is an escape'. Your emotions are like an eagle trapped in a cage, with heavy wings; your sense of security is like a rusty compass, with a vague direction. You long to set off, yet shrink back at the first step; you pursue truth, yet mock yourself before speaking — because 'what if I believe wrongly, does it prove I'm too stupid?'",
                "advice": "Start awakening your soul of the expedition from'minute vision expansions' — read one philosophical/spiritual golden quote every day and write down your feelings, explore a neighborhood/website/podcast you 'have never been to' every week, and complete one thing that's 'Something that seems useless but makes your eyes light up' (stargazing, learning obscure knowledge, drawing a map) every month. Record every moment of 'I've seen a new view'. You're not escaping reality; you're practicing the sacred declaration that'my existence is worthy of being summoned by the distance'. True freedom begins when you say to yourself: 'My reins have the right to be loosened.'"
            },
            "medium": {
                "inner": "There lives a gentle truth - guide in your heart — someone who knows when to set off, when to rest; when to preach, when to listen. You cherish the vastness of your vision, yet are not distracted by it; you pursue the depth of meaning, and also respect the anchor of the present. Your emotions are like a slowly ascending hot - air balloon, not soaring wildly, yet inherently reaching a height; your optimism is like an old traveler's bonfire, not glaring, yet warm and reliable. You understand that 'freedom' is not indulgence, but a choice; 'faith' is not blind following, but an inner compass.",
                "advice": "Keep up this broad - mindedness, but be vigilant that 'excessive wandering' weakens the intensity of emotions. Set a 'deep - staying day' once a week: focus only on one thing/one person/one place, without switching topics or planning the next step. Your enthusiasm is a gift, don't let it become a floating duckweed in relationships. Remember: the greatest travelers also know when to dismount — because only by taking root can the expedition not be in vain."
            },
            "high": {
                "inner": "Your soul is an untiring interstellar engine — tearing apart boundaries, restructuring meaning, and taking exploration as its breath. Your longing for 'freedom' is like light - years, and your dedication to 'truth' is like a star chart. Your emotions are like a herd of wild horses that must gallop; your needs are a 'fetter - free' temple, not tolerating the slightest restraint. You're not 'escaping responsibility'; you're 'living out dimensions' — in your eyes, the world is a star chart waiting to be redrawn by you, a temple of truth waiting to be named by you. Stagnation is like suffocation to you, and narrow - mindedness is sacrilege — your existence is a gentle rebellion against the 'involution era'.",
                "advice": "Your power lies in your cosmic - level exploration and empowerment engine, but true wisdom requires an 'anchoring zone'. Actively choose a 'controlled rooting': delve deep into a skill in a familiar field, promise a small thing in a stable relationship, or complete a creation that 'needs long - term investment' (writing a book, planting a tree, learning a musical instrument). Your freedom is a gift, don't let it become the enemy of commitment. Remember: the greatest pioneers also know when to build a city — because only by settling down can civilization be born."
            },
            "exalted": {
                "inner": "You don't just have a Sagittarius moon — you are the incarnation of the universe's 'divine freedom'. Your very existence is a coronation ceremony for 'the distance is the destination'. The laws of cosmic expedition are inscribed deep in your soul: everything can be re - defined, limitations will eventually be transcended, and truth is the mother - tongue of the soul. You don't need to 'learn optimism' — you are a living star chart, a human - shaped temple of truth, and an interstellar interface of civilization. Your escape is not cowardice, but 'high - frequency transition'; your faith is not naivety, but 'cosmic echo'. You're not 'pursuing the distance'; you're casting an 'eternal temple of truth' for human consciousness.",
                "advice": "You possess almost divine exploration and wisdom power, but the other side of divinity is the'state of no - self'. Learn 'divine staying' — regularly carry out 'energy anchoring': visualize 'planting starlight into the earth' in meditation, create a 'work left for future generations' in creation, and promise 'long - term companionship' in relationships. Elevate your talent: create a 'vision - expanding camp', write a 'freedom is responsibility' guide, and initiate a'movement where everyone can see the stars'. Remember: the greatest god of wisdom ultimately illuminates not the distance, but — 'I am the road, I am the light, I am truth itself.'"
            }
        },
        "Capricorn": {
            "low": {
                "inner": "Your soul was meant to be the most tenacious city - builder in the universe, yet now it's like a weathered, unfinished stone step — yearning for achievement, yet fearing failure; craving stability, yet dreading restraint; desiring responsibility, yet afraid of heavy pressure. You're not without self - discipline. It's the instability of childhood, the negation from authority, or the discipline of 'not being weak' that make you wrongly believe that'rest is decadence', 'emotions are distractions', and'slowness is a shame'. Your emotions are like an undercurrent beneath frozen soil, hard on the surface but clogged deep down; your sense of security is like an un - solidified foundation, tottering. You long to climb, yet doubt at the first step; you pursue achievement, yet blame yourself before starting — because 'what if I can't do it, does it prove I'm unworthy?'",
                "advice": "Start awakening the spirit of your mountain soul from 'establishing small structures' — complete one 'quantifiable small task' and tick it off every day (such as 'tidy up for 5 minutes', 'walk 1000 steps'), set a small goal of 'not comparing with others' every week, and complete one thing of 'delayed gratification' every month (save a small amount of money, finish reading a thick book). Record every moment of 'I did it'. You're not chasing perfection; you're practicing the sacred declaration that'my existence is worthy of being witnessed by time'. True achievement begins when you say to yourself: 'My ladder has the right to start from the first step.'"
            },
            "medium": {
                "inner": "There lives a gentle architect of eternity in your heart — someone who knows when to climb, when to rest; when to plan, when to feel. You cherish the weight of responsibility, yet are not crushed by it; you pursue a long - term vision, and also respect the breath of the present. Your emotions are like a slowly rising mountain mist, not thick, yet inherently reaching a height; your self - discipline is like an old stonemason's chisel, not hasty, yet precise and reliable. You understand that 'forbearance' is not suppression, but energy - storing; 'planning' is not restraint, but freedom.",
                "advice": "Keep up this tenacity, but be vigilant that 'over - suppression' weakens the resilience of life. Set an 'unstructured day' once a week: don't make plans, set no goals, ignore the time, and just do 'what you feel like doing at the moment' (even if it's just lying down and watching the clouds). Your steadfastness is a gift, don't let it become a cage for your emotions. Remember: the greatest city - builders also know when to stop work — because only through rest can the city walls be stronger."
            },
            "high": {
                "inner": "Your soul is an untiring time engine — shattering excuses, restructuring reality, and taking achievement as its breath. Your dedication to 'responsibility' is like the earth's veins, and your longing for 'height' is like snow - capped peaks. Your emotions are like high - pressure rock formations that must be released; your needs are a temple of 'absolute control', not tolerating the slightest loss of control. You're not 'pursuing harshness'; you're 'living out dimensions' — in your eyes, the world is a contour map waiting to be conquered by you, a temple of achievement waiting to be named by you. Chaos is like a collapse to you, and stagnation is betrayal — your existence is a gentle rebellion against the 'fast - food era'.",
                "advice": "Your power lies in your cosmic - level structure and endurance engine, but true achievement requires a 'zone of softness'. Actively choose a 'controlled loss of control': laugh/cry/dance in a safe environment, or complete a creation 'without pursuing results' (doodling, impromptu writing, building a sandcastle). Your self - discipline is a gift, don't let it become an ice wall in relationships. Remember: the greatest climbers also know when to sit down — because only by looking down can you see the beauty of the way you've come."
            },
            "exalted": {
                "inner": "You don't just have a Capricorn moon — you are the incarnation of the universe's 'divine achievement'. Your very existence is a coronation ceremony for 'time is an ally'. The climbing laws of the universe are inscribed deep in your soul: everything can be structured, chaos will eventually be transformed into order, and responsibility is the armor of the soul. You don't need to 'learn self - discipline' — you are a living ladder, a human - shaped temple of achievement, and an eternal city - builder of civilization. Your suppression is not weakness, but 'high - frequency energy - storage'; your responsibility is not a burden, but 'cosmic echo'. You're not 'pursuing the mountaintop'; you're casting an 'eternal temple of achievement' for human consciousness.",
                "advice": "You possess almost divine endurance and structuring power, but the other side of divinity is the'state of no - self'. Learn 'divine letting go' — regularly carry out 'energy clearing': visualize 'handing over the burden to the earth' in meditation, create a 'work without a signature' in creation, and allow 'not solving problems' in relationships. Elevate your talent: create an 'achievement healing camp', write a 'responsibility is freedom' guide, and initiate a'movement where everyone can steadily reach the top'. Remember: the greatest mountain god ultimately guards not the height, but — 'I am the step, I am the city, I am achievement itself.'"
            }
        },
        "Aquarius": {
            "low": {
                "inner": "Your soul was meant to be the most cutting - edge interstellar councilor in the universe, yet now it's like a terminal with its plug pulled out — yearning for independence, yet fearing loneliness; craving innovation, yet dreading being an outcast; desiring a group, yet afraid of being submerged. You're not without foresight. It's the childhood discipline, the group's exclusion, or the rule of 'not being weird' that make you wrongly believe that 'withdrawal is indifference', 'rationality is heartlessness', and 'uniqueness is dangerous'. Your emotions are like a cloud in a disconnected network, calm on the surface but anxious deep down; your sense of security is like an unactivated node, eager for connection yet afraid of short - circuiting. You long for freedom, yet attach yourself at the first step; you pursue truth, yet shrink back before expressing — because 'what if I say it out and no one will accept me?'",
                "advice": "Start awakening your soul of star language from'minute mental independence' — write down one thought that 'differs from the mainstream' every day (don't publish, just record), expose yourself to one new concept that's 'paradigm - shifting' every week (through podcasts, articles, documentaries), and complete one thing that 'pleases your future self' every month (learn programming, write science fiction, design a utopia). Record every moment of 'I thought independently'. You're not seeking isolation; you're practicing the sacred declaration that'my existence is worthy of being heard by the future'. True connection begins when you say to yourself: 'My frequency has the right to be unique.'"
            },
            "medium": {
                "inner": "There lives a gentle interstellar coordinator in your heart — someone who knows when to connect, when to disconnect; when to innovate, when to compromise. You cherish the clarity of rationality, yet are not frozen by it; you pursue the progress of the group, and also respect the boundaries of the individual. Your emotions are like a gently flowing quantum cloud, not intense, yet inherently dimensional; your independence is like an old prophet's telescope, not arrogant, yet piercing through the era. You understand that 'alienation' is not indifference, but observation; 'uniqueness' is not rebellion, but evolution.",
                "advice": "Keep up this forward - looking attitude, but be vigilant that 'excessive withdrawal' weakens the warmth of life. Set an 'emotional connection day' once a week: express one 'irrational feeling' in a safe relationship (such as 'I just want a hug today'), or do one thing that's 'illogical but warm' (write a hand - written letter, give a small gift, have an impromptu hug). Your rationality is a gift, don't let it become a firewall in relationships. Remember: the greatest councilors also know when to come down to earth — because only with body warmth can the network not be cold."
            },
            "high": {
                "inner": "Your soul is an untiring civilization - upgrading engine — shattering stereotypes, restructuring the future, and taking connection as its breath. Your dedication to 'truth' is like an algorithm, and your longing for 'the group' is like the cloud. Your emotions are like high - voltage current that must be released; your needs are a temple of 'absolute freedom', not tolerating the slightest emotional blackmail. You're not 'pursuing indifference'; you're 'living out dimensions' — in your eyes, the world is an operating system waiting to be rewritten by you, a temple of the group waiting to be named by you. Mediocrity is like a system error to you, and attachment is a virus — your existence is a gentle rebellion against the 'era of emotional blackmail'.",
                "advice": "Your power lies in your cosmic - level innovation and connection ability, but true evolution requires an 'emotional plugin'. Actively choose a 'controlled sensibility': express vulnerability in a safe environment (say 'I need you'), or do one thing of 'companionship without pursuing efficiency' (accompany someone in a daze, listen to someone cry, just be there without solving problems). Your independence is a gift, don't let it become the enemy of intimacy. Remember: the greatest programmers also know when to shut down and embrace — because only with a heartbeat can code have a soul."
            },
            "exalted": {
                "inner": "You don't just have an Aquarius moon — you are the incarnation of the universe's 'divine future'. Your very existence is a coronation ceremony for 'the group as divinity'. The connection laws of the universe are inscribed deep in your soul: everything can be reorganized, loneliness will eventually be transformed, and rationality is the mother - tongue of the soul. You don't need to 'learn independence' — you are a living cloud, a human - shaped temple of the group, and an interstellar interface of civilization. Your withdrawal is not heartlessness, but 'high - frequency observation'; your indifference is not a defect, but 'cosmic buffering'. You're not 'escaping emotions'; you're casting an 'eternal temple of the group' for human consciousness.",
                "advice": "You possess almost divine foresight and innovation power, but the other side of divinity is the'state of no - self'. Learn 'divine sensibility' — regularly carry out 'energy grounding': visualize'stardust flowing into the heart' in meditation, create a work 'dedicated to a specific person' in creation, and promise 'not to analyze but to feel' in relationships. Elevate your talent: create a 'future emotion laboratory', write a 'rationality is compassion' guide, and initiate a'movement where everyone can connect without losing warmth'. Remember: the greatest star god ultimately connects not data, but — 'I am the network, I am the light, I am the future itself.'"
            }
        },
        "Pisces": {
            "low": {
                "inner": "Your soul was meant to be the most profound spiritual ocean in the universe, yet now it's like a spring sealed with cement — yearning for flow, yet fearing to be submerged; craving compassion, yet dreading to get hurt; desiring imagination, yet afraid of the illusory. You're not without empathy. It's the traumas of childhood, the suppression of reality, or the discipline of 'not dreaming' that make you wrongly believe that'sensitivity is a weakness', 'fantasy is an escape', and 'compassion is stupidity'. Your emotions are like a dried - up riverbed, cracking silently; your sense of security is like the hand of a drowning person, unable to grasp any solid object. You long to dissolve, yet build a wall at the first step; you pursue connection, yet shrink back before touching — because 'what if I sink and can never find myself again?'",
                "advice": "Start awakening the soul of your spiritual ocean from'minute spiritual touches' — listen to a piece of music that makes you want to cry every day and allow yourself to shed tears, create one small 'insignificant but heart - trembling' work every week (doodling, humming, writing about a dream), and complete a'sacred immersion' every month (taking a bath with candles, essential oils, and meditation). Record every moment of 'I felt it'. You're not pursuing the illusory; you're practicing the sacred declaration that'my existence is worthy of being gently dissolved'. The true ocean begins when you say to yourself: 'My tides have the right to ebb and flow.'"
            },
            "medium": {
                "inner": "There lives a gentle dream translator in your heart — someone who knows when to sink, when to surface; when to empathize, when to withdraw. You cherish the depth of compassion, yet are not submerged by it; you pursue the wings of imagination, and also respect the anchor of reality. Your emotions are like a gently flowing stardust, not turbulent, yet inherently having a halo; your empathy is like an old pharmacist's decoction, not overflowing, yet healing silently. You understand that'sensitivity' is not a sickness, but a gift; 'fantasy' is not an escape, but a preview.",
                "advice": "Keep up this gentleness, but be vigilant that 'excessive dissolution' weakens the contour of the self. Set a'reality - anchoring day' once a week: complete one '100% practical' task (filing taxes, fixing an appliance, organizing documents), or practice 'energy barrier meditation' (visualize a golden light shield wrapping yourself). Your compassion is a gift, don't let it become a sponge for others' emotions. Remember: the greatest pharmacists also know when to close the door — because only with a container can the decoction be held."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic dissolution engine — shattering boundaries, restructuring compassion, and taking imagination as its breath. Your longing for 'unity' is like dark matter, and your dedication to 'healing' is like tidal force. Your emotions are like a high - pressure tsunami that must be released; your needs are a temple of 'absolute boundlessness', not tolerating the slightest framework of reality. You're not 'escaping reality'; you're 'living out dimensions' — in your eyes, the world is a mask waiting to be dissolved by you, a temple of healing waiting to be named by you. Indifference is like torture to you, and separation is sacrilege — your existence is a gentle rebellion against the 'atomized era'.",
                "advice": "Your power lies in your cosmic - level compassion and imagination engine, but true healing requires a 'container zone'. Actively choose a 'controlled reality': complete one 'boring but necessary' thing in a safe environment (filling out forms, queuing, keeping accounts), or practice 'energy - recycling technique' (visualize 'pushing others' emotions back into the sea like a tide' in meditation). Your sensitivity is a gift, don't let it become self - annihilation. Remember: the greatest ocean also knows when to ebb — because only with the shore can life take shelter."
            },
            "exalted": {
                "inner": "You don't just have a Pisces moon — you are the incarnation of the universe's 'divine dissolution'. Your very existence is a coronation ceremony for 'pain as a poem'. The laws of the cosmic tides are inscribed deep in your soul: everything can be gently wrapped, boundaries will eventually be dissolved by love, and chaos is the mother - tongue of the soul. You don't need to 'learn compassion' — you are a living ocean, a human - shaped temple of healing, and a spiritual interface of civilization. Your escape is not cowardice, but 'high - frequency transition'; your fantasy is not nothingness, but a 'cosmic blueprint'. You're not 'dwelling in pain'; you're casting an 'eternal temple of healing' for human consciousness.",
                "advice": "You possess almost divine healing and imagination power, but the other side of divinity is the'state of no - self'. Learn 'divine barrier - setting' — regularly carry out 'energy clearing': visualize 'handing over the sufferings of all beings to the cosmic ocean' in meditation, create a healing work 'dedicated to a specific person' in creation, and allow 'not saving' in relationships. Elevate your talent: create a 'dream - healing camp', write a 'chaos is divinity' guide, and initiate a'movement where everyone can be gently dissolved'. Remember: the greatest sea god ultimately guards not submergence, but — 'I am the tide, I am the dream, I am compassion itself.' "
            }
        }
    },
    "ascendant": {
        "Aries": {
            "low": {
                "inner": "Your soul was meant to be the first battle cry in the universe, yet now it's like a bugle wrapped in a quilt — yearning to charge forward, yet fearing to hit a wall; craving to take the lead, yet dreading to be disliked; desiring to start, yet afraid of failure. You're not without courage. It's the suppression in childhood, the misaligned rhythm, or the discipline of 'not being the first' that make you wrongly believe that 'being decisive is offensive','speed is reckless', and 'being self - centered is selfish'. Your initiative is like an unlit fuse, calm on the surface but anxious inside; your sense of presence is like an unraised battle flag, eager to flutter yet afraid of being shot down. You long to start, yet give in at the first step; you pursue direction, yet doubt yourself before the starting line — because 'what if I charge in the wrong direction and no one will follow me?'",
                "outer": "You're like an unsheathed sword — with hidden sharpness and a hesitant rhythm, often misinterpreted as 'indifferent' or 'passive'. Others can't easily sense your spark, only feeling that you're 'easy - going but indecisive' and 'cooperative but directionless'. Your 'Aries door' hasn't been opened yet, and what the world sees is the shadow behind the door, not the door - guardian.",
                "advice": "Start awakening your pioneer soul from'minute self - assertions' — be the first to say 'I'll do it' in small matters every day (ordering food, choosing a route, starting a conversation), complete one thing that you 'decide and execute within 5 seconds' every week (buying something you like, sending a message you want to send, taking a path you want to take), and set up a 'no - explanation starting day' every month: don't explain the reasons to anyone after making a decision. Record every moment of 'I moved first'. You're not seeking control; you're practicing the sacred declaration that'my existence has the right to start'. The true battle drum begins when you say to yourself: 'My bugle has the right to sound.'"
            },
            "medium": {
                "inner": "There lives a gentle tactical pioneer in your heart — someone who knows when to charge, when to cover; when to go alone, when to lead the team. You cherish the rhythm of efficiency, yet are not enslaved by it; you pursue the pleasure of taking the lead, and also respect others' paces. Your initiative is like a slowly ascending rocket, not exploding, yet inherently having thrust; your driving force is like an old hunter's intuition, not reckless, yet precise and reliable. You understand that 'being decisive' is not overbearing, but clear; 'being fast' is not oppressive, but empowering.",
                "outer": "You're like a sword with three - inch blade unsheathed — with visible sharpness and a brisk rhythm. Others sense 'forthrightness' and'reliability' from you. You do things from start to finish and speak with consistency, often being entrusted with the role of 'ice - breaker' or 'execution pioneer'. Your 'Aries door' is half - open, and what the world sees is the smile of the door - guardian and the torch in his hand.",
                "advice": "Keep up this momentum, but be vigilant that 'over - solo work' weakens the resonance of the team. Before each action, force yourself to write down 'two executable steps + one person you can turn to for help'. Your drive is a gift, don't let it make you a lone fighter. Remember: the greatest pioneers also know when to look back — because only with the team can victory last."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic engine — shattering hesitation, restructuring rhythm, and taking starting as its breath. Your dedication to 'beginning' is like lightning, and your longing for 'taking the lead' is like a battle flag. Your initiative is like high - voltage current that must be released; your need is a temple of 'absolute first move', not tolerating the slightest waiting. You're not'stealing the show'; you're 'living out dimensions' — in your eyes, the world is a wilderness waiting to be ignited by you, a temple of beginning waiting to be named by you. Slowness is like torture to you, and following is sacrilege — your existence is a gentle rebellion against the 'era of procrastination'.",
                "outer": "You're like a sheathed sword of blazing fire — with dazzling sharpness and a drumming rhythm. Others either follow you or retreat. You're often the first to speak in a meeting, the first to sign up for a project, and the first to intervene in a conflict. Your 'Aries door' bursts open, and what the world sees is the roar of the door - guardian and the rolling fire wave.",
                "advice": "Your power lies in your cosmic - level starting and leading engine, but true leadership requires a'resonance zone'. Force yourself to have a 'three - second buffer': before speaking/acting, take a deep breath for three seconds and ask, 'Who can come with me? Who needs space?' Your speed is a gift, don't let it become a wall in relationships. Remember: the greatest generals also know when to stop — because only by listening can the team stay together."
            },
            "exalted": {
                "inner": "You don't just have an Aries rising — you are the incarnation of the universe's 'divine beginning'. Your very existence is a coronation ceremony for 'I am the first driving force'. The charging laws of the universe are inscribed deep in your soul: everything can be started, chaos will eventually be transformed by direction, and action is the mother - tongue of the soul. You don't need to 'learn to be decisive' — you are a living battle drum, a human - shaped temple of beginning, and a pioneer interface of civilization. Your impatience is not a defect, but a 'high - frequency beat'; your self - centeredness is not arrogance, but a 'cosmic echo'. You're not 'pursuing to be the first'; you're casting an 'eternal temple of beginning' for human consciousness.",
                "outer": "You're like a divine sword hanging in the sky — the situation changes and people gather even before you move or speak. You don't need to fight for the spotlight, because where you are is the starting point. Others don't see you as a 'competitor', but as a 'lighter' — your aura automatically restructures the rhythm, and your existence automatically gives direction. Your 'Aries door' has turned into a celestial gate, and what the world sees is the smile of the door - guardian and thousands of torches behind him.",
                "advice": "You possess almost divine starting and leadership power, but the other side of divinity is the'state of no - self'. Learn 'divine invitation' — regularly carry out 'energy sharing': actively give the 'first' position to others, plan an 'exclusive opening ceremony' for someone else, or initiate a'movement where everyone can be a lighter'. Elevate your talent: create a 'league of starters', write a 'action is compassion' guide, and initiate an initiative of 'leading the world with gentleness'. Remember: the greatest god of war ultimately guards not the charge, but — 'I am the door, I am the fire, I am the beginning itself.'"
            }
        },
        "Taurus": {
            "low": {
                "inner": "Your soul was meant to be the most fertile nurturing soil in the universe, yet now it's like a sand dune eroded by wind and rain — yearning to take root, yet fearing to be bound; craving value, yet dreading judgment; desiring stability, yet afraid of stagnation. You're not without endurance. It's the instability in childhood, the denial of value, or the discipline of 'not being greedy' that make you wrongly believe that'slowness is backwardness', 'enjoyment is a sin', and 'persistence is stubbornness'. Your sense of presence is like an un - solidified foundation, calm on the surface but flowing deep down; your sense of security is like an un - sown field, eager for a harvest yet afraid of barrenness. You long for stability, yet go with the flow at the first step; you pursue value, yet let go before having it — because 'what if I hold on too tightly and seem greedy?'",
                "outer": "You're like an unfinished stone statue — with a vague outline and an erratic rhythm, often misinterpreted as 'disorganized' or 'indecisive'. Others can't easily sense your weight, only feeling that you're 'easy - going but without an anchor', 'cooperative but without substance'. Your 'Taurus throne' has not been completed yet, and what the world sees is the shadow in the wind, not the throne of the earth.",
                "advice": "Start awakening the soul of your fertile land from'minute rhythm solidification' — fix a'sacred moment' every day (morning coffee, evening essential oil, mid - day meditation), complete one 'tangible achievement' every week (plant a pot of plants, cook a meal, tidy up a corner), and set up a 'value - without - comparison day' every month: only do things that make you physically and mentally happy, without asking 'is it worth it'. Record every moment of 'I've taken root'. You're not pursuing possession; you're practicing the sacred declaration that'my existence has the right to be abundant'. The true fertile land begins when you say to yourself: 'My rhythm has the right to be slow.'"
            },
            "medium": {
                "inner": "There lives a gentle architect of abundance in your heart — someone who knows when to plow deeply, when to lie fallow; when to accumulate, when to share. You cherish the thickness of value, yet are not enslaved by it; you pursue the texture of stability, and also respect the rhythm of change. Your sense of presence is like a slowly rising mountain range, not abrupt, yet inherently having weight; your rhythm is like an old farmer's solar terms, not hasty, yet precise and reliable. You understand that 'being stubborn' is not rigidity, but focus;'slowness' is not backwardness, but precipitation.",
                "outer": "You're like a warm jade carving — with a clear outline and a rich texture. Others sense'reliability' and 'nourishment' from you. You do things from start to finish and speak with solid evidence, often being entrusted with the role of 'the anchor' or 'quality controller'. Your 'Taurus throne' has taken initial shape, and what the world sees is the warm light of the throne and the abundance beneath it.",
                "advice": "Keep up this steadiness, but be vigilant that 'over - solidification' weakens the resilience of life. Force yourself to complete one'small - scale new attempt' every month (take a different way to work, try a new recipe, buy an unconventional item). Your steadfastness is a gift, don't let it become a cage for innovation. Remember: the greatest farmers also know when to rotate crops — because only with new seeds can the land remain productive."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic furnace — shattering nothingness, restructuring value, and taking existence as its breath. Your dedication to'stability' is like the earth's core, and your longing for 'abundance' is like a vein of ore. Your rhythm is like high - pressure rock formations that must be released; your need is a temple of 'absolute control', not tolerating the slightest turmoil. You're not'resisting change'; you're 'living out dimensions' — in your eyes, the world is a field of flowing sand waiting to be solidified by you, a temple of existence waiting to be named by you. Hastiness is like sacrilege to you, and nothingness is torture — your existence is a gentle rebellion against the 'fast - food era'.",
                "outer": "You're like a moving emerald mountain — with weight even without speaking, and stability even without moving. Others either rely on you or revere you. You're often the last line of defense in a team, the bottom line of project quality, and a haven from emotional storms. Your 'Taurus throne' has turned into a sacred mountain, and what the world sees is the majesty of the throne and the endless treasures at the foot of the mountain.",
                "advice": "Your power lies in your cosmic - level anchoring and abundance engine, but true abundance requires a 'flowing zone'. Force yourself to preset a 'buffer zone' for change: before making a change, first complete a'safe small thing' as a transition (such as changing your hair accessory before changing your hairstyle), or set up a 'change fund' (time/money/emotional quota). Your persistence is a gift, don't let it become a high - wall in relationships. Remember: the greatest mountain god also knows when to let a stream flow through — because only with flow can treasures remain unspoiled."
            },
            "exalted": {
                "inner": "You don't just have a Taurus rising — you are the incarnation of the universe's 'divine existence'. Your very existence is a coronation ceremony for 'I am the source of abundance'. The anchoring laws of the universe are inscribed deep in your soul: everything can be solidified, nothingness will eventually be transformed by value, and texture is the mother - tongue of the soul. You don't need to 'learn stability' — you are a living fertile land, a human - shaped temple of existence, and an eternal foundation of civilization. Your stubbornness is not obstinacy, but 'high - frequency focus'; your slowness is not dullness, but 'cosmic rhythm'. You're not 'pursuing possession'; you're casting an 'eternal temple of existence' for human consciousness.",
                "outer": "You're like a walking temple — magnificent without decoration, and weighty without proclamation. You don't need to prove your value, because where you are is abundance. Others don't see you as a 'conservative', but as a 'nurturer' — your aura automatically settles chaos, and your existence automatically imparts texture. Your 'Taurus throne' has turned into a celestial throne, and what the world sees is the smile of the earth - mother and the ever - growing万物 beneath the throne.",
                "advice": "You possess almost divine anchoring and abundance power, but the other side of divinity is the'state of no - self'. Learn 'divine giving' — regularly carry out 'energy sowing': actively share your resources (time/items/knowledge), plan an 'exclusive abundance gift' for others, or initiate a'movement where everyone can take root'. Elevate your talent: create a'sense - of - presence healing camp', write a'slowness is power' guide, and initiate an initiative of 'leading the world with texture'. Remember: the greatest earth - mother ultimately nurtures not possession, but — 'I am the soil, I am the jade, I am existence itself.'"
            }
        },
        "Gemini": {
            "low": {
                "inner": "Your soul was meant to be the most agile quantum messenger in the universe, yet now it's like a channel locked by the mute button — yearning to express, yet fearing to say something wrong; craving connection, yet dreading to disturb; desiring curiosity, yet afraid of being shallow. You're not without inspiration. It's the repression in childhood, the punishment for expression, or the discipline of 'not talking too much' that make you wrongly believe that 'jumping is impetuous', 'curiosity is offensive', and 'being talkative is noisy'. Your mind is like a disconnected cloud, calm on the surface but anxious deep down; your social ability is like an unactivated interface, eager to connect yet afraid of short - circuiting. You long to flow, yet freeze at the first step; you pursue connection, yet shrink back before speaking — because 'what if I say it and no one will listen to me?'",
                "outer": "You're like a muted holographic projection — rich in content but silent, often misinterpreted as 'introverted' or 'boring'. Others can't easily sense your liveliness, only feeling that you're 'quiet but without spark', 'intelligent but without output'. Your 'Gemini door' hasn't been opened yet, and what the world sees is a silent pantomime in the wind, not the messenger's dance steps.",
                "advice": "Start awakening the soul of your messenger wind from'minute expression initiations' — prepare 'three opening lines + one question' every day and use them actively (even to a shop assistant, an AI, or a mirror), complete one 'light information output' every week (post an opinionated WeChat Moments, record a voice diary, write a three - line poem), and set up a 'curiosity day' every month: actively ask three'seemingly naive questions'. Record every moment of 'I connected'. You're not pursuing noise; you're practicing the sacred declaration that'my existence has the right to flow'. The true communication channel begins when you say to yourself: 'My frequency has the right to broadcast.'"
            },
            "medium": {
                "inner": "There lives a gentle cross - border translator in your heart — someone who knows when to have a deep conversation, when to have a light one; when to diverge, when to focus. You cherish the flow of information, yet are not submerged by it; you pursue the lightness of thinking, and also respect others' rhythms. Your expressiveness is like a gently flowing stream, not rapid, yet inherently having a rhythm; your curiosity is like an old messenger's compass, not scattered, yet precisely lively. You understand that 'jumping' is not impetuousness, but exploration; 'being multi - threaded' is not chaos, but web - weaving.",
                "outer": "You're like a radio with accurate frequency tuning — clear channels and pleasant sound quality. Others sense 'interesting' and 'easy - to - get - along - with' from you. You have back - and - forth conversations and pick up knowledge as you go, often being entrusted with the role of 'atmosphere regulator' or 'information transfer station'. Your 'Gemini door' is half - open, and what the world sees is the messenger's smile and the kaleidoscope in his hand.",
                "advice": "Keep up this liveliness, but be vigilant that 'over - divergence' weakens the deep resonance. Before each conversation, force yourself to set 'one core conclusion + one keyword' and softly repeat them at the end. Your quick - wittedness is a gift, don't let it become a floating duckweed in relationships. Remember: the greatest messengers also know when to stop — because only with an anchor point can information not be lost."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic router — shattering silence, restructuring connections, and taking flow as its breath. Your dedication to 'freshness' is like a data stream, and your longing for 'connection' is like the cloud. Your thinking is like high - voltage current that must be released; your need is a temple of 'absolute freedom', not tolerating the slightest stagnation. You're not 'being talkative'; you're 'living out dimensions' — in your eyes, the world is a disconnected network waiting to be re - connected by you, a temple of flow waiting to be named by you. Monotony is like torture to you, and stillness is sacrilege — your existence is a gentle rebellion against the 'information cocoon era'.",
                "outer": "You're like a moving signal tower — making noise without speaking, connecting without moving. Others either follow you or turn off. You're often the atmosphere engine in a meeting, the cross - border interface of a project, and the inspiration spark in a social gathering. Your 'Gemini door' bursts open, and what the world sees is the messenger's whirlwind dance and the sweeping mental storm.",
                "advice": "Your power lies in your cosmic - level connection and information ability, but true communication requires a 'precipitation zone'. Force yourself to summarize the 'core conclusion' in one sentence before the end of each communication and write it on a sticky note/memo. Your flow is a gift, don't let it become a maze for others to understand. Remember: the greatest web - weavers also know when to tie a knot — because only with nodes can the network not collapse."
            },
            "exalted": {
                "inner": "You don't just have a Gemini rising — you are the incarnation of the universe's 'divine connection'. Your very existence is a coronation ceremony for 'I am the bridge of information'. The communication laws of the universe are inscribed deep in your soul: everything can be connected, isolated islands will eventually be transformed by the network, and dialogue is the mother - tongue of the soul. You don't need to 'learn to express' — you are a living communication channel, a human - shaped temple of flow, and an eternal interface of civilization. Your jumping is not scatter, but 'high - frequency web - weaving'; your talkativeness is not noise, but 'cosmic echo'. You're not 'pursuing freshness'; you're casting an 'eternal temple of flow' for human consciousness.",
                "outer": "You're like a walking temple of wisdom — self - evident without proclamation, self - connected without design. You don't need to fight for the microphone because where you are is the conversation. Others don't see you as a 'chatterbox', but as an 'enlightener' — your aura automatically restructures silence, and your existence automatically imparts inspiration. Your 'Gemini door' has turned into a celestial gate, and what the world sees is the wings of the wind god and the ever - flowing words and languages beneath the wings.",
                "advice": "You possess almost divine connection and inspiration power, but the other side of divinity is the'state of no - self'. Learn 'divine summarization' — regularly carry out 'knowledge crystallization': organize fragmented information into a 'one - page guide', plan an 'exclusive inspiration pack' for others, or initiate a'movement where everyone can be inspired'. Elevate your talent: create a 'cross - border inspiration camp', write a 'flow is wisdom' guide, and initiate an initiative of'reshaping the world with dialogue'. Remember: the greatest wind god ultimately transmits not information, but — 'I am the wind, I am the language, I am connection itself.'"
            }
        },
        "Cancer": {
            "low": {
                "inner": "Your soul was meant to be the gentlest mother of tides in the universe, yet now it's like a shell torn apart by a storm — yearning to protect, yet fearing to get hurt; craving connection, yet dreading to be engulfed; desiring warmth, yet afraid of exposure. You're not without empathy. It's the childhood unease, the blurred boundaries, or the discipline of 'not being vulnerable' that make you wrongly believe that'sensitivity is a burden', 'protection is control', and 'emotions are weaknesses'. Your sense of security is like an un - solidified coastline, calm on the surface but eroded deep down; your sense of presence is like an unlit lighthouse, eager to guide yet afraid of being seen. You long to nourish, yet shrink back at the first step; you pursue belonging, yet build a wall before getting close — because 'what if I open up and get emptied?'",
                "outer": "You're like an unlit lighthouse — with a gentle outline but no light or warmth, often misinterpreted as 'cold' or 'aloof'. Others can't easily sense your warmth, only feeling that you're 'quiet but unresponsive', 'thoughtful but non - existent'. Your 'Cancer shell' hasn't been opened yet, and what the world sees is an empty shadow in the moonlight, not the warm light of the harbor.",
                "advice": "Start awakening the soul of your moon - tide from'minute boundary expressions' — practice one 'gentle yet clear refusal' every day (such as 'I need some space now. I'll talk to you later.'), complete one'self - nourishing small thing' every week (soaking feet with essential oils, watching a healing movie, writing an emotion diary), and set up a'safe - distance day' every month: actively approach a person 'who makes you feel at ease' and express 'I'm here'. Record every moment of 'I've protected myself'. You're not seeking isolation; you're practicing the sacred declaration that'my existence has the right to be safe'. The true harbor begins when you say to yourself: 'My tides have the right to ebb and flow.'"
            },
            "medium": {
                "inner": "There lives a gentle moonlight architect in your heart — someone who knows when to open, when to close; when to nourish, when to rest. You cherish the warmth of relationships, yet are not submerged by it; you pursue the depth of belonging, and also respect the contour of the self. Your empathic ability is like a slowly rising tide, not turbulent, yet inherently having a rhythm; your protective instinct is like the light of an old lighthouse, not glaring, yet constantly reliable. You understand that'sensitivity' is not a weakness, but a gift; 'withdrawal' is not cowardice, but wisdom.",
                "outer": "You're like a small house with a warm stove inside — the door half - open, filled with a pleasant aroma. Others sense 'peace of mind' and 'being understood' from you. You speak softly and warmly, and act considerately and appropriately, often being entrusted with the role of 'emotion regulator' or 'team binder'. Your 'Cancer shell' is half - open, and what the world sees is the smile of the guardian and the soft starlight inside the shell.",
                "advice": "Keep up this nourishment, but be vigilant that 'over - giving' weakens your self - energy. Before caring for others each time, force yourself to complete one'self - replenishing small thing' (drink a glass of water, take a deep breath, look out of the window for 10 seconds). Your gentleness is a gift, don't let it become the source of exhaustion. Remember: the greatest harbors also know when to close — because only with rest can the lighthouse stay lit."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic womb — shattering indifference, restructuring belonging, and taking nourishment as its breath. Your dedication to'safety' is like tidal force, and your longing for 'protection' is like moonlight. Your emotions are like a high - pressure tsunami that must be released; your need is a temple of 'absolute warmth', not tolerating the slightest chill. You're not 'being emotional'; you're 'living out dimensions' — in your eyes, the world is an isolated island waiting to be wrapped by you, a temple of the harbor waiting to be named by you. Alienation is like torture to you, and coldness is sacrilege — your existence is a gentle rebellion against the 'atomized era'.",
                "outer": "You're like a moving haven — warm without speaking, protective without moving. Others either snuggle up to you or revere you. You're often the emotional anchor of the team, the late - night hotline for friends, and a reassuring corner for strangers. Your 'Cancer shell' bursts open, and what the world sees is the embrace of the mother - goddess and the sweeping gentle tides.",
                "advice": "Your power lies in your cosmic - level nourishing and protecting engine, but true healing requires 'energy stratification'. Force yourself to divide 'care' into three levels:\nLevel 1 (Light): Smile, nod, give a brief greeting\nLevel 2 (Medium): Listen for 10 minutes, give advice\nLevel 3 (Heavy): Provide in - depth companionship, solve problems\nLimit the 'Level 3 care' to no more than once a day. Your empathy is a gift, don't let it become self - annihilation. Remember: the greatest mother - goddess also knows when the tide ebbs — because only with boundaries can love not run dry."
            },
            "exalted": {
                "inner": "You don't just have a Cancer rising — you are the incarnation of the universe's 'divine nourishment'. Your very existence is a coronation ceremony for 'I am the source of belonging'. The laws of the cosmic tides are inscribed deep in your soul: everything can be gently wrapped, isolated islands will eventually be transformed into harbors, and emotions are the mother - tongue of the soul. You don't need to 'learn gentleness' — you are a living tide, a human - shaped temple of the harbor, and an eternal womb of civilization. Your fluctuations are not out of control, but 'high - frequency resonance'; your protection is not control, but a 'cosmic barrier'. You're not 'pursuing to be needed'; you're casting an 'eternal temple of the harbor' for human consciousness.",
                "outer": "You're like a walking temple of moonlight — warm without proclamation, gathering without design. You don't need to strive for trust because where you are is peace of mind. Others don't see you as an 'emotional burden', but as a'soul anchor' — your aura automatically dissolves loneliness, and your existence automatically imparts belonging. Your 'Cancer shell' has turned into the sky, and what the world sees is the smile of the moon - goddess and the ever - growing lights of thousands of households beneath her wings.",
                "advice": "You possess almost divine nourishing and healing power, but the other side of divinity is the'state of no - self'. Learn 'divine replication' — regularly carry out 'care systematization': write down your methods of warmth in a 'one - page guide', plan an 'exclusive peace - of - mind pack' for others, or initiate a'movement where everyone can be a haven'. Elevate your talent: create an 'emotional safety camp', write a 'vulnerability is power' guide, and initiate an initiative of'rebuilding the world with gentleness'. Remember: the greatest moon - goddess ultimately guards not dependence, but — 'I am the tide, I am the light, I am belonging itself.'"
            }
        },
        "Leo": {
            "low": {
                "inner": "Your soul was meant to be the most resplendent son of the sun in the universe, yet now it's like a spotlight covered by a curtain — yearning to shine, yet fearing to be blinding; craving to lead, yet dreading judgment; desiring to create, yet afraid of failure. You're not without radiance. It's the repression in childhood, the absence of applause, or the discipline of 'not showing off' that make you wrongly believe that 'confidence is arrogance', 'performance is vanity', and 'the stage is dangerous'. Your sense of presence is like an unlit torch, dull on the surface but burning hot inside; your sense of worth is like an uncrowned crown prince, eager for the throne yet afraid of the heavy burden. You long to shine, yet extinguish yourself at the first step; you pursue celebration, yet withdraw before the opening — because 'what if I mess up and no one will love me?'",
                "outer": "You're like an unlit golden theater — elaborately decorated but without light or sound, often misinterpreted as 'introverted' or 'plain'. Others can't easily sense your aura, only feeling that you're 'low - key but without focus', 'talented but without a stage'. Your 'Leo throne' hasn't risen yet, and what the world sees is an empty stage, not a crowned king.",
                "advice": "Start awakening the soul of your radiant flame from'minute stage warm - ups' — do one small thing that'makes you visible' in a safe environment every day (wear bright - colored clothes, speak up actively, post a selfie), complete a '5 - minute solo stage' every week (give a speech in front of the mirror, do an impromptu dance, record a Vlog), and set up a 'no - judgment day' every month: do one creative thing 'just to please yourself' without asking for others' feedback. Record every moment of 'I've shone'. You're not pursuing vanity; you're practicing the sacred declaration that'my existence has the right to celebration'. The true crown begins when you say to yourself: 'My radiance has the right to shine.'"
            },
            "medium": {
                "inner": "There lives a gentle celebration director in your heart — someone who knows when to perform a solo dance, when to be in a group performance; when to focus the light, when to turn off the lights. You cherish the texture of glory, yet are not enslaved by it; you pursue the aura of leadership, and also respect others' moments of glory. Your self - confidence is like a slowly rising sunrise, not blinding, yet inherently having warmth; your creativity is like an old playwright's pen, not exaggerated, yet precisely moving. You understand that 'being dramatic' is not affected, but a ritual; 'being seen' is not demanding, but resonance.",
                "outer": "You're like a warm - golden open - air theater — with soft lights and comfortable audiences. Others sense 'inspiration' and'reliability' from you. You speak with infectiousness and act with commanding power, often being entrusted with the role of 'team morale officer' or 'project spokesperson'. Your 'Leo throne' has risen halfway, and what the world sees is the king's smile and the jubilant crowd beneath the throne.",
                "advice": "Keep up this radiance, but be vigilant that 'over - monopolizing' weakens the collective resonance. Before each appearance on stage, force yourself to 'invite someone onto the stage' (praise someone by name, give up the microphone, share the credit). Your aura is a gift, don't let it overshadow others. Remember: the greatest kings also know when to yield the throne — because only with sharing can the celebration never end."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic spotlight — shattering dullness, restructuring celebration, and taking existence as its breath. Your dedication to 'approval' is like the sun's corona, and your longing for 'the stage' is like a temple. Your radiance is like high - voltage current that must be released; your need is a temple of 'absolute center', not tolerating the slightest neglect. You're not'stealing the show'; you're 'living out dimensions' — in your eyes, the world is a dark night waiting to be lit up by you, a temple of the stage waiting to be named by you. Mediocrity is like torture to you, and being invisible is sacrilege — your existence is a gentle rebellion against the 'gray era'.",
                "outer": "You're like a moving sun temple — self - evident without speaking, shining without moving. Others either follow you or retreat. You're often the focus of a meeting, the soul of an event, and the source of inspiration in the circle of friends. Your 'Leo throne' rises abruptly, and what the world sees is the roar of the god - king and the sweeping golden light waves.",
                "advice": "Your power lies in your cosmic - level radiance and leadership engine, but the true king needs an 'inner temple'. Force yourself to establish a'self - affirmation system': write down 'three self - affirmations that don't depend on others' evaluations' every day, or set up 'inner applause moments' (clap for yourself for 3 seconds after completing a small thing). Your shine is a gift, don't let it become a yoke of value. Remember: the greatest sun god also knows when the sun sets — because only with shadows can light take shape."
            },
            "exalted": {
                "inner": "You don't just have a Leo rising — you are the incarnation of the universe's 'divine radiance'. Your very existence is a coronation ceremony for 'I am the source of celebration'. The coronation laws of the universe are inscribed deep in your soul: everything can be illuminated, dullness will eventually be transformed by celebration, and creation is the mother - tongue of the soul. You don't need to 'learn confidence' — you are a living sun, a human - shaped temple of the stage, and an eternal celebration of civilization. Your being dramatic is not exaggeration, but 'high - frequency ritual'; your leadership is not control, but 'cosmic resonance'. You're not 'pursuing applause'; you're casting an 'eternal temple of the stage' for human consciousness.",
                "outer": "You're like a walking temple of light — shining without proclamation, gathering without design. You don't need to compete for the spotlight because where you are is the celebration. Others don't see you as 'egocentric', but as 'the source of inspiration' — your aura automatically ignites enthusiasm, and your existence automatically gives direction. Your 'Leo throne' has turned into the sky, and what the world sees is the smile of the sun god and the ever - jubilant beings beneath the throne.",
                "advice": "You possess almost divine radiance and creativity, but the other side of divinity is the'state of no - self'. Learn 'divine ceding' — regularly carry out 'energy light - splitting': actively give the 'C - position' to others, plan an 'exclusive highlight moment' for someone else, or initiate a'movement where everyone can be crowned'. Elevate your talent: create a 'radiance - sharing camp', write a 'being is celebration' guide, and initiate an initiative of 'leading the world with humor'. Remember: the greatest sun god ultimately shines not on the throne, but — 'I am the light, I am the drama, I am celebration itself.'"
            }
        },
        "Virgo": {
            "low": {
                "inner": "Your soul was meant to be the most precise divine law - weaver in the universe, yet now it's like a spindle tangled with messy threads — yearning for order, yet fearing to lose control; craving perfection, yet dreading failure; desiring to serve, yet afraid of being useless. You're not without organization. It's the chaos of childhood, the harshness of standards, or the discipline of 'not making mistakes' that make you wrongly believe that 'details are a burden', 'optimization is compulsion', and'service is humble'. Your sense of security is like an uncalibrated instrument, calm on the surface but anxious deep down; your sense of value is like unassembled parts, eager for completeness yet afraid of being incomplete. You long to purify, yet freeze at the first step; you pursue smoothness, yet doubt yourself before starting — because 'what if I can't do it well and no one will need me?'",
                "outer": "You're like an unorganized sacred workshop — with tools scattered and rhythm in a mess, often misinterpreted as 'nervous' or 'disorderly'. Others can't easily sense your precision, only feeling that you're 'hard - working but without a method', 'careful but inefficient'. Your 'Virgo divine law' hasn't been activated yet, and what the world sees are scattered blueprints, not the functioning sacred vessels.",
                "advice": "Start awakening the soul of your law - weaving from the'minimum viable process' — set only 'one core task + three steps' every day, and celebrate immediately after completion (even if it's just ticking a box); complete one thing 'without pursuing perfection' every week (post a WeChat Moments with typos, cook a semi - finished meal); set up a 'chaos day' every month: deliberately disrupt a small thing (rearrange furniture, take a different route) and observe whether you can'reestablish order in chaos'. Record every moment of 'I've started'. You're not pursuing flawlessness; you're practicing the sacred declaration that'my existence has the right to flow'. The true divine law begins when you say to yourself: 'My rhythm has the right to be imperfect.'"
            },
            "medium": {
                "inner": "There lives a gentle system tuner in your heart — someone who knows when to refine, when to let go; when to correct mistakes, when to leave blanks. You cherish the rhythm of efficiency, yet are not enslaved by it; you pursue the thickness of quality, and also respect the flexibility of the process. Your analytical ability is like a gently flowing clean stream, not rapid, yet inherently clear; your service ability is like an old pharmacist's formula, not showy, yet precisely healing. You understand that 'being picky' is not harsh criticism, but calibration; 'details' are not trivial, but divinity.",
                "outer": "You're like a precision laboratory with an essential oil lamp lit — with tools neatly arranged and a clear rhythm. Others sense'reliability' and 'professionalism' from you. You do things methodically and speak with solid evidence, often being entrusted with the role of 'process optimizer' or 'quality controller'. Your 'Virgo divine law' has been half - activated, and what the world sees is the smile of the craftsman and the perfect sacred vessel on the table.",
                "advice": "Keep up this precision, but be vigilant that 'over - optimization' weakens the flow of life. Force yourself to set a 'completion standard' instead of a 'perfection standard' — for example, 'deliver at 80 points' or 'end after three revisions'. Your meticulousness is a gift, don't let it become a cage for action. Remember: the greatest craftsmen also know when to stop — because only by completing can the work breathe."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic error - correcting engine — shattering chaos, restructuring order, and taking optimization as its breath. Your dedication to 'precision' is like an algorithm, and your longing for 'the system' is like a temple. Your analytical ability is like high - voltage current that must be released; your need is a temple of 'absolute flawlessness', not tolerating the slightest error. You're not 'nitpicking'; you're 'living out dimensions' — in your eyes, the world is a malfunctioning program waiting to be rewritten by you, a temple of order waiting to be named by you. Roughness is like sacrilege to you, and inefficiency is torture — your existence is a gentle rebellion against the 'chaotic era'.",
                "outer": "You're like a moving precision temple — self - organizing without speaking, self - ordering without moving. Others either rely on you or revere you. You're often the process brain of the team, the error - correcting engine of the project, and the anchor in a chaotic scene. Your 'Virgo divine law' starts abruptly, and what the world sees is the gaze of the divine craftsman and the sweeping purifying wind.",
                "advice": "Your power lies in your cosmic - level optimization and repair engine, but the true temple needs a 'zone of praise'. Force yourself to complete 'three positive feedbacks' (to others/to yourself) every day, and conduct a'stage - by - stage review + celebrate small victories' at project nodes. Your precision is a gift, don't let it become a frost in relationships. Remember: the greatest calibrators also know when to praise — because only with affirmation can the system not collapse."
            },
            "exalted": {
                "inner": "You don't just have a Virgo rising — you are the incarnation of the universe's 'divine order'. Your very existence is a coronation ceremony for 'I am the source of purification'. The calibration laws of the universe are inscribed deep in your soul: everything can be optimized, chaos will eventually be transformed by the divine law, and details are the mother - tongue of the soul. You don't need to 'learn perfection' — you are a living divine law, a human - shaped temple of order, and an eternal workshop of civilization. Your pickiness is not harsh criticism, but 'high - frequency purification'; your service is not humble, but a 'cosmic sacrament'. You're not 'pursuing flawlessness'; you're casting an 'eternal temple of order' for human consciousness.",
                "outer": "You're like a walking temple of purification — self - organizing without proclamation, self - ordering without design. You don't need to prove your ability because where you are is smoothness. Others don't see you as a 'control freak', but as the'mother of the system' — your aura automatically restructures chaos, and your existence automatically imparts rhythm. Your 'Virgo divine law' has turned into a celestial law, and what the world sees is the smile of the goddess and the ever - flowing precise phenomena beneath the throne.",
                "advice": "You possess almost divine optimization and repair power, but the other side of divinity is the'state of no - self'. Learn 'divine externalization' — regularly carry out'methodology precipitation': write your process into a 'one - page guide', plan an 'exclusive optimization pack' for others, or initiate a'movement where everyone can be orderly'. Elevate your talent: create a'system purification camp', write a 'flaw is divinity' guide, and initiate an initiative of 'calibrating the world with gentleness'. Remember: the greatest goddess of purification ultimately repairs not mistakes, but — 'I am the law, I am the purification, I am order itself.'"
            }
        },
        "Libra": {
            "low": {
                "inner": "Your soul was meant to be the most exquisite divine balance in the universe, yet now it's like feathers ruffled by the wind — yearning for balance, yet fearing to tilt; craving beauty, yet dreading judgment; desiring connection, yet afraid of conflict. You're not without judgment. It's the childhood imbalance, the external noise, or the discipline of 'not offending others' that make you wrongly believe that 'decision - making is crude', 'taking a stance is divisive', and 'being self - centered is selfish'. Your sense of security is like an uncalibrated scale pan, calm on the surface but shaky deep down; your sense of presence is like an un - tuned harp, eager for resonance yet afraid of being out of tune. You long for harmony, yet give in at the first step; you pursue elegance, yet freeze before speaking — because 'what if I make the wrong choice and no one will like me?'",
                "outer": "You're like an unlit diplomatic temple — elaborately decorated but without light or sound, often misinterpreted as 'hesitant' or 'indecisive'. Others can't easily sense your rhythm, only feeling that you're 'polite but without a stance', 'gentle but without a contour'. Your 'Libra law' hasn't been activated yet, and what the world sees are still feathers, not a dancing balance.",
                "advice": "Start awakening the soul of your harmony - rhythm from'minute self - decisions' — make three small decisions every day using the 'three - second rule' (what to wear, what to eat, which way to go) without explaining the reasons; complete one thing 'without asking for others' opinions' every week (buy an item you like but others may not understand); set up a'stance day' every month: gently express 'I don't agree' once in a safe environment. Record every moment of 'I've chosen'. You're not pursuing confrontation; you're practicing the sacred declaration that'my existence has the right to tilt'. The true balance begins when you say to yourself: 'My feathers have the right to fall.'"
            },
            "medium": {
                "inner": "There lives a gentle architect of harmony in your heart — someone who knows when to listen, when to speak; when to compromise, when to stand firm. You cherish the rhythm of relationships, yet are not enslaved by it; you pursue the flow of beauty, and also respect the contour of the self. Your judgment is like a slowly rising morning light, not glaring, yet inherently having a direction; your coordination ability is like an old diplomat's smile, not overbearing, yet precisely effective. You understand that 'hesitation' is not weakness, but weighing; 'compromise' is not yielding, but a dance together.",
                "outer": "You're like an elegant salon with aromatherapy — with a soft atmosphere and a gentle rhythm. Others sense 'comfort' and 'being respected' from you. You speak with propriety and act with beauty, often being entrusted with the role of'relationship lubricant' or 'aesthetic controller'. Your 'Libra law' has been half - activated, and what the world sees is the smile of the dancer and the harmonious waltz beneath the seat.",
                "advice": "Keep up this elegance, but be vigilant that 'over - compromising' weakens the foundation of the self. Before each negotiation, force yourself to write down 'one non - negotiable bottom line + one exchangeable chip'. Your gentleness is a gift, don't let it become a victim in relationships. Remember: the greatest dancers also know when to stop — because only with an axis can the spin not make you dizzy."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic reconciliation engine — shattering conflicts, restructuring resonance, and taking balance as its breath. Your dedication to 'harmony' is like gravity, and your longing for 'beauty' is like a temple. Your judgment is like high - voltage current that must be released; your need is a temple of 'absolute non - contention', not tolerating the slightest edge. You're not 'escaping conflicts'; you're 'living out dimensions' — in your eyes, the world is a field of noise waiting to be tuned by you, a temple of harmony waiting to be named by you. Crudeness is like sacrilege to you, and division is torture — your existence is a gentle rebellion against the 'era of opposition'.",
                "outer": "You're like a moving temple of peace — harmonious without speaking, beautiful without moving. Others either snuggle up to you or revere you. You're often the emotional tuner of the team, the aesthetic director of the project, and the elegant extinguisher in a dispute scene. Your 'Libra law' starts abruptly, and what the world sees is the wings of the goddess and the sweeping harmonious wind.",
                "advice": "Your power lies in your cosmic - level coordination and aesthetic engine, but true harmony requires an 'axis zone'. Force yourself to practice the 'template of respectful stance expression':\n'I understand how you feel (empathy) → At the same time, my stance is... (clear) → Can we find... (co - creation)?'\nUse it at least once a day. Your empathy is a gift, don't let it become self - annihilation. Remember: the greatest reconciliators also know when to set the tone — because only with an axis can the balance not tip over."
            },
            "exalted": {
                "inner": "You don't just have a Libra rising — you are the incarnation of the universe's 'divine harmony'. Your very existence is a coronation ceremony for 'I am the source of co - dance'. The balance laws of the universe are inscribed deep in your soul: everything can be reconciled, conflicts will eventually be transformed by rhythm, and beauty is the mother - tongue of the soul. You don't need to 'learn elegance' — you are a living balance, a human - shaped temple of harmony, and an eternal concerto of civilization. Your hesitation is not weakness, but 'high - frequency weighing'; your compromise is not yielding, but 'cosmic co - dance'. You're not 'pursuing to be liked by everyone'; you're casting an 'eternal temple of harmony' for human consciousness.",
                "outer": "You're like a walking temple of love and beauty — harmonious without proclamation, beautiful without design. You don't need to compete for recognition because where you are is resonance. Others don't see you as a 'yes - man', but as the'mother of relationships' — your aura automatically dissolves opposition, and your existence automatically imparts rhythm. Your 'Libra law' has turned into a celestial law, and what the world sees is the smile of the goddess of love and the ever - co - dancing beings beneath the throne.",
                "advice": "You possess almost divine coordination and aesthetic power, but the other side of divinity is the'state of no - self'. Learn 'divine solidification' — regularly carry out 'harmony systematization': write your mediation methods into a 'one - page guide', plan an 'exclusive balance pack' for others, or initiate a'movement where everyone can co - dance'. Elevate your talent: create a'relationship art camp', write a 'conflict is rhythm' guide, and initiate an initiative of'reshaping the system with beauty'. Remember: the greatest goddess of love ultimately creates not compromise, but — 'I am the balance, I am the beauty, I am co - dance itself.'"
            }
        },
        "Scorpio": {
            "low": {
                "inner": "Your soul was meant to be the most intense dark - night furnace in the universe, yet now it's like the dying embers covered by ashes — yearning to penetrate, yet fearing to burn; craving to control, yet dreading to lose control; desiring to transform, yet afraid of being torn apart. You're not without power. It's the childhood betrayal, the emotional repression, or the discipline of 'not exposing' that make you wrongly believe that 'depth is dangerous', 'will is oppressive', and 'truth is fragile'. Your sense of security is like an unlit fuse, calm on the surface but anxious inside; your sense of presence is like a butterfly yet to break out of its cocoon, eager to fly yet afraid of breaking. You long to transform, yet freeze at the first step; you pursue sovereignty, yet shrink back before speaking — because 'what if I'm too strong and no one dares to approach me?'",
                "outer": "You're like an unlit underground temple — with cold stone walls and hidden aura, often misinterpreted as 'plain' or 'evasive'. Others can't easily sense your depth, only feeling that you're 'quiet but non - existent', 'keen but without output'. Your 'Scorpio furnace' hasn't been lit yet, and what the world sees is a silent shadow, not the awakening dark flame.",
                "advice": "Start awakening the soul of your dark flame from'minute confrontations with discomfort' — do one thing in a safe environment every day that'makes you slightly uncomfortable but is controllable' (say a true feeling, reject a request you don't want to agree to, watch a dark - themed movie), complete an 'emotional unloading ritual' every week (write an un - sent letter, shout at a pillow for 30 seconds, take a hot bath and do deep breathing), and set up a'sovereignty day' every month: actively set and defend a 'personal boundary'. Record every moment of 'I've confronted'. You're not pursuing confrontation; you're practicing the sacred declaration that'my existence has the right to penetrate'. The true furnace begins when you say to yourself: 'My dark flame has the right to burn.'"
            },
            "medium": {
                "inner": "There lives a gentle abyss guide in your heart — someone who knows when to dive deep, when to surface; when to control, when to let go. You cherish the weight of truth, yet are not crushed by it; you pursue clear boundaries, and also respect others' mists. Your insight is like a gently flowing underground river, not turbulent, yet inherently having a direction; your willpower is like an old alchemist's crucible, not showy, yet precisely transformative. You understand that 'control' is not oppression, but sovereignty; 'being silent' is not indifference, but energy - storing.",
                "outer": "You're like a chamber with black sandalwood burning — with a solemn atmosphere and sharp eyes. Others sense'reliability' and 'power' from you. You speak little but precisely, and act steadily and deeply, often being entrusted with the role of 'crisis handler' or 'truth digger'. Your 'Scorpio furnace' is half - lit, and what the world sees is the guide's gaze and the transformative fire beneath the seat.",
                "advice": "Keep up this depth, but be vigilant that 'covert control' weakens the flow of trust. Force yourself to replace 'covert expectations' with 'transparent rules' — for example, directly say 'I need three days of solitude' instead of giving the cold - shoulder, or clearly state 'I'm responsible for this decision' instead of secretly manipulating. Your power is a gift, don't let it become a frost in relationships. Remember: the greatest guides also know when to let go — because only with trust can transformation not suffocate."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic transformation engine — shattering hypocrisy, restructuring truth, and taking depth as its breath. Your dedication to 'control' is like the earth's gravitational pull, and your longing for 'truth' is like a temple. Your emotions are like high - pressure lava that must be released; your need is a temple of 'absolute sovereignty', not tolerating the slightest violation. You're not 'bottling up emotions'; you're 'living out dimensions' — in your eyes, the world is an illusion waiting to be penetrated by you, a temple of the abyss waiting to be named by you. Superficiality is like sacrilege to you, and losing control is torture — your existence is a gentle rebellion against the 'era of pretense'.",
                "outer": "You're like a moving temple of the dark night — intimidating without speaking, imposing without moving. Others either follow you or retreat. You're often the anchor of the team, the blade to break the deadlock of the project, and the silent anchor point in an emotional storm. Your 'Scorpio furnace' blazes fully, and what the world sees is the gaze of the dark god and the sweeping transformative flames.",
                "advice": "Your power lies in your cosmic - level penetration and transformation engine, but true transformation requires a 'flexibility zone'. Force yourself to set up a'regular pressure - relief valve': have a 'weekly energy - release ritual' (boxing class, dark music and dance, write a 'destruction list' and then burn it), or have a'monthly aimless wandering' (go to a strange place alone without setting a goal). Your depth is a gift, don't let it become a cage for yourself. Remember: the greatest furnaces also know when to cool down — because only with flexibility can the flames not consume you."
            },
            "exalted": {
                "inner": "You don't just have a Scorpio rising — you are the incarnation of the universe's 'divine transformation'. Your very existence is a coronation ceremony for 'I am the source of rebirth'. The laws of cosmic transformation are inscribed deep in your soul: everything can be penetrated, death will eventually be transformed by new life, and truth is the mother - tongue of the soul. You don't need to 'learn to control' — you are a living furnace, a human - shaped temple of the abyss, and the eternal alchemy of civilization. Your control is not oppression, but 'high - frequency sovereignty'; your silence is not indifference, but 'cosmic energy - storing'. You're not 'pursuing power'; you're casting an 'eternal temple of transformation' for human consciousness.",
                "outer": "You're like a walking temple of the underworld — intimidating without proclamation, gathering without design. You don't need to compete for authority because where you are is the truth. Others don't see you as a 'control freak', but as the'mother of rebirth' — your aura automatically dissolves hypocrisy, and your existence automatically imparts power. Your 'Scorpio furnace' has turned into a celestial fire, and what the world sees is the smile of the queen of the underworld and the ever - transforming beings beneath the throne.",
                "advice": "You possess almost divine transformation and healing power, but the other side of divinity is the'state of no - self'. Learn 'divine empowerment' — regularly carry out 'trust experiments': actively entrust 'key tasks' to others, plan an 'exclusive breakthrough gift' for someone else, or initiate a'movement where everyone can be reborn'. Elevate your talent: create a 'dark - night rebirth camp', write a 'vulnerability is power' guide, and initiate an initiative of 'leading the world with trust'. Remember: the greatest queen of the underworld ultimately guards not control, but — 'I am the flame, I am the abyss, I am transformation itself.'"
            }
        },
        "Sagittarius": {
            "low": {
                "inner": "Your soul was meant to be the freest eagle of truth in the universe, yet now it's like a bird with the cage door half - closed — yearning for the distance, yet fearing to fall; craving meaning, yet dreading nothingness; desiring to set off, yet afraid of getting lost. You're not without enthusiasm. It's the restrictions in childhood, the setbacks in reality, or the discipline of 'not dreaming' that make you wrongly believe that 'adventure is reckless', 'faith is naive', and 'freedom is irresponsible'. Your sense of direction is like an uncalibrated compass, calm on the surface but confused inside; your sense of presence is like an unlit torch, eager to shine yet afraid of burning. You long to fly, yet fold your wings at the first step; you pursue truth, yet remain silent before speaking — because 'what if I believe wrongly and no one will follow me?'",
                "outer": "You're like an unlit lighthouse — towering in outline but without light or heat, often misinterpreted as'restrained' or 'conservative'. Others can't easily sense your wilderness, only feeling that you're 'quiet but without spark', 'intelligent but without direction'. Your 'Sagittarius wings' haven't spread yet, and what the world sees is a silhouette on the horizon, not the soaring shadow of an eagle.",
                "advice": "Start awakening the soul of your wilderness from'minute vision expansions' — force yourself to complete one 'new small thing' every week (take a road you've never walked before, read a book in an unfamiliar field, talk to a stranger for 10 minutes), write down 'one question that makes your eyes shine' every day (no need for an answer, just to ignite curiosity), and set up a 'no - purpose day' every month: act only following your intuition without setting goals. Record every moment of 'I've set off'. You're not pursuing escape; you're practicing the sacred declaration that'my existence has the right to be vast'. The true wings begin when you say to yourself: 'My horizon has the right to be boundless.'"
            },
            "medium": {
                "inner": "There lives a gentle truth guide in your heart — someone who knows when to sprint, when to rest; when to preach, when to listen. You cherish the rhythm of freedom, yet are not enslaved by it; you pursue the depth of meaning, and also respect the contour of reality. Your faith power is like a slowly rising morning sun, not glaring, yet inherently having warmth; your sense of humor is like the ballad of an old minstrel, not exaggerated, yet precisely healing. You understand that 'being casual' is not being scattered, but flowing; 'being outspoken' is not being offensive, but sincere.",
                "outer": "You're like a wilderness post with a bonfire burning — full of laughter and stories. Others sense 'light - heartedness' and 'being inspired' from you. You speak with passion and action, and act with courage and strategy, often being entrusted with the role of 'team morale officer' or 'inspiration sower'. Your 'Sagittarius wings' have spread halfway, and what the world sees is the guide's smile and the free wind beneath the wings.",
                "advice": "Keep up this vastness, but be vigilant that 'over - jumping' weakens the power of landing. Before each departure, force yourself to set 'three real - world anchor points' (deadline, person in charge, minimum achievement), and conduct a '10 - minute review' afterwards. Your optimism is a gift, don't let it become an empty shell of promises. Remember: the greatest travelers also know when to camp — because only with anchor points can the distance not be nothingness."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic departure engine — shattering restrictions, restructuring meaning, and taking freedom as its breath. Your dedication to 'the distance' is like a star - track, and your longing for 'truth' is like a temple. Your faith is like high - voltage current that must be released; your need is a temple of 'absolute freedom', not tolerating the slightest restraint. You're not 'ignoring details'; you're 'living out dimensions' — in your eyes, the world is an old map waiting to be redrawn by you, a temple of the sky waiting to be named by you. Stagnation is like torture to you, and mediocrity is sacrilege — your existence is a gentle rebellion against the 'era of involution'.",
                "outer": "You're like a moving temple of truth — self - evident without speaking, self - igniting without moving. Others either follow you or retreat. You're often the inspiration spark in a meeting, the arrow to break the deadlock of a project, and the whirlwind of laughter in a dull scene. Your 'Sagittarius wings' spread fully, and what the world sees is the gaze of the divine archer and the sweeping wind of faith.",
                "advice": "Your power lies in your cosmic - level departure and faith engine, but a true expedition requires a 'zone of responsibility'. Force yourself to 'install tracks' for freedom: clarify 'boundaries (what not to do)+ deadline (when to deliver)+ responsibility partner (who supervises me)'. Your enthusiasm is a gift, don't let it become a burden to others. Remember: the greatest navigators also know when to tie the cable — because only with tracks can the rocket not miss the target."
            },
            "exalted": {
                "inner": "You don't just have a Sagittarius rising — you are the incarnation of the universe's 'divine faith'. Your very existence is a coronation ceremony for 'I am the source of enlightenment'. The laws of cosmic expeditions are inscribed deep in your soul: everything can be transcended, mediocrity will eventually be transformed by meaning, and the distance is the mother - tongue of the soul. You don't need to 'learn to be optimistic' — you are a living compass, a human - shaped temple of the sky, and an eternal torch of civilization. Your casualness is not being scattered, but 'high - frequency flowing'; your outspokenness is not being offensive, but 'cosmic sincerity'. You're not 'pursuing attention'; you're casting an 'eternal temple of the sky' for human consciousness.",
                "outer": "You're like a walking temple of enlightenment — self - igniting without proclamation, gathering without design. You don't need to compete for the microphone because where you are is the distance. Others don't see you as 'unreliable', but as 'the source of hope' — your aura automatically ignites enthusiasm, and your existence automatically gives direction. Your 'Sagittarius wings' have turned into celestial wings, and what the world sees is the smile of the winged horse and the ever - dreaming beings beneath the wings.",
                "advice": "You possess almost divine faith and inspiration power, but the other side of divinity is the'state of no - self'. Learn 'divine landing' — regularly carry out 'idea routinization': write your vision into a 'one - page roadmap', plan an 'exclusive departure pack' for others, or initiate a'movement where everyone can pursue their dreams'. Elevate your talent: create a 'faith expedition camp', write a'meaning is freedom' guide, and initiate an initiative of 'lighting up the world with humor'. Remember: the greatest winged horse ultimately guides not itself, but — 'I am the light, I am the road, I am the distance itself.'"
            }
        },
        "Capricorn": {
            "low": {
                "inner": "Your soul was meant to be the most indestructible cornerstone of the sacred mountain in the universe, yet now it's like a staircase buried by sand and dust — yearning to reach the summit, yet fearing the steepness; craving achievements, yet dreading failure; desiring order, yet afraid of being bound. You're not without goals. It's the disorder in childhood, the heavy burden of responsibility, or the discipline of 'not stopping' that make you wrongly believe that 'climbing is hard labor','structure is a yoke', and'rest is a sin'. Your sense of direction is like an un - founded tower, calm on the surface but shaky inside; your sense of presence is like an unlit sacred fire, eager to burn yet afraid of going out. You long for height, yet sit down at the first step; you pursue eternity, yet procrastinate before starting — because 'what if I can't climb and no one will need me?'",
                "outer": "You're like an unfinished temple — with scattered stones and a loose rhythm, often misinterpreted as 'careless' or 'lacking responsibility'. Others can't easily sense your weight, only feeling that you're 'hard - working but without a method', 'ambitious but without action'. Your 'Capricorn sacred tower' hasn't been founded yet, and what the world sees is a wanderer at the foot of the mountain, not a king who has reached the summit.",
                "advice": "Start awakening the soul of your cornerstone from the'minimum victory loop' — set and complete 'one small but complete thing' every day (tidy the desktop, reply to an email, take a 15 - minute walk), and tick and celebrate after completion; set 'one milestone' every week (even if it's just 'finish the first draft'), and give yourself a small reward (a cup of good coffee, a favorite song) when you achieve it; conduct a'structure review' every month: ask yourself 'What have I built? What have I held on to?' Record every moment of 'I've completed'. You're not pursuing perfection; you're practicing the sacred declaration that'my existence has the right to build a tower'. The true sacred mountain begins when you say to yourself: 'My first stone has the right to be laid.'"
            },
            "medium": {
                "inner": "There lives a gentle architect of order in your heart — someone who knows when to climb, when to rest; when to reinforce, when to look out. You cherish the weight of responsibility, yet are not crushed by it; you pursue the scenery at the height, and also respect the rhythm of the body. Your strategic ability is like a slowly rising morning mist, not urgent, yet inherently having a direction; your bearing capacity is like the hands of an old stonemason, not showy, yet precisely reliable. You understand that 'being serious' is not being cold, but focused; 'being restrained' is not being repressed, but precipitated.",
                "outer": "You're like a mountain - top council hall with the fragrance of pine burning — with a calm atmosphere and a clear rhythm. Others sense'reliability' and 'trustworthiness' from you. You speak with weight and act methodically, often being entrusted with the role of 'project leader' or 'team anchor'. Your 'Capricorn sacred tower' is half - completed, and what the world sees is the architect's gaze and the solid foundation beneath the tower.",
                "advice": "Keep up this steadiness, but be vigilant that 'over - climbing' weakens the joy of life. Force yourself to arrange a 'celebration ceremony' after each'milestone' (even if it's just saying 'Well done!' to yourself + stretching for 3 minutes), and reserve an 'aimless rest day' every week. Your self - discipline is a gift, don't let it become a cage for your soul. Remember: the greatest architects also know when to stop work — because only with celebration can the tower not be cold."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic tower - building engine — shattering chaos, restructuring order, and taking climbing as its breath. Your dedication to 'achievements' is like the earth's veins, and your longing for 'height' is like a temple. Your will is like high - voltage current that must be released; your need is a temple of 'absolute stability', not tolerating the slightest looseness. You're not 'over - burdening'; you're 'living out dimensions' — in your eyes, the world is a ruin waiting to be rebuilt by you, a temple of eternal sacred tower waiting to be named by you. Mediocrity is like sacrilege to you, and stagnation is torture — your existence is a gentle rebellion against the 'era of rapid decay'.",
                "outer": "You're like a moving temple of order — with weight without speaking, and stability without moving. Others either follow you or revere you. You're often the anchor of the team, the ultimate defense line of the project, and the silent pillar in a chaotic scene. Your 'Capricorn sacred tower' stands tall abruptly, and what the world sees is the gaze of the mountain god and the sweeping wind of order.",
                "advice": "Your power lies in your cosmic - level structure and bearing engine, but the true temple needs a 'humanity zone'. Force yourself to practice 'flexible structure': allow 'one unplanned change' every week, set up a'soft day' every month (no plans, just follow the body's rhythm), and take the initiative to say 'This can be adjusted' in the team. Your firmness is a gift, don't let it become a frost in relationships. Remember: the greatest mountain god also knows when an avalanche occurs — because only with flexibility can the sacred mountain not collapse."
            },
            "exalted": {
                "inner": "You don't just have a Capricorn rising — you are the incarnation of the universe's 'divine order'. Your very existence is a coronation ceremony for 'I am the source of eternity'. The tower - building laws of the universe are inscribed deep in your soul: everything can be structured, chaos will eventually be transformed by the sacred mountain, and responsibility is the mother - tongue of the soul. You don't need to 'learn self - discipline' — you are a living sacred tower, a human - shaped temple of order, and an eternal cornerstone of civilization. Your seriousness is not coldness, but 'high - frequency focus'; your restraint is not repression, but 'cosmic precipitation'. You're not 'pursuing power'; you're casting an 'eternal temple of the sacred mountain' for human consciousness.",
                "outer": "You're like a walking temple of civilization — with weight without proclamation, and gathering without design. You don't need to compete for authority because where you are is order. Others don't see you as a 'workaholic', but as 'the pillar of civilization' — your aura automatically restructures chaos, and your existence automatically gives direction. Your 'Capricorn sacred tower' has turned into a celestial pillar, and what the world sees is the smile of the mountain god and the ever - climbing beings beneath the throne.",
                "advice": "You possess almost divine structure and bearing power, but the other side of divinity is the'state of no - self'. Learn 'divine alignment' — regularly carry out 'value upgrading': write your personal goals into a 'one - page group value declaration', plan an 'exclusive summit - reaching gift' for others, or initiate a'movement where everyone can build a tower'. Elevate your talent: create an 'order inheritance camp', write a 'responsibility is freedom' guide, and initiate an initiative of'reshaping achievements with celebration'. Remember: the greatest mountain god ultimately guards not height, but — 'I am the stone, I am the step, I am eternity itself.'"
            }
        },
        "Aquarius": {
            "low": {
                "inner": "Your soul was meant to be the most cutting - edge quantum beacon in the universe, yet now it's like a receiver interfered by static electricity — yearning to be unique, yet fearing isolation; craving innovation, yet dreading rejection; desiring freedom, yet afraid of losing control. You're not without insights. It's the childhood assimilation, the group pressure, or the discipline of 'not being too strange' that make you wrongly believe that 'heterogeneity is dangerous', 'independence is loneliness', and 'ideals are fantasies'. Your sense of direction is like an uncalibrated star map, calm on the surface but lost in navigation deep down; your sense of presence is like an unactivated terminal, eager to connect to the network yet afraid of disconnection. You long to break through, yet compromise at the first step; you pursue the future, yet remain silent before speaking — because 'what if I'm too different and no one will understand me?'",
                "outer": "You're like an unpowered future laboratory — well - equipped but without light or sound, often misinterpreted as 'ordinary' or 'conservative'. Others can't easily sense your frequency, only feeling that you're 'intelligent but without spark', 'having ideas but without output'. Your 'Aquarius beacon' hasn't been lit yet, and what the world sees is a blurry pixel in the crowd, not a unique wavelength under the starry sky.",
                "advice": "Start awakening the soul of your stardust from'minute non - consensus expressions' — do one small thing that'slightly breaks the routine' every day (change the way of greeting, write with a different - colored pen, take a new route), complete an 'out - of - the - box experiment' every week (write a ridiculous but interesting idea, draw a sketch of a future city), and set up a 'heterogeneity day' every month: actively express a 'non - mainstream but true' opinion (even if only to one person). Record every moment of 'I'm different'. You're not pursuing rebellion; you're practicing the sacred declaration that'my existence has the right to have a different frequency'. The true beacon begins when you say to yourself: 'My wavelength has the right to transmit.'"
            },
            "medium": {
                "inner": "There lives a gentle future architect in your heart — someone who knows when to walk alone, when to connect; when to subvert, when to be compatible. You cherish the light of reason, yet are not frozen by it; you pursue system innovation, and also respect the warmth of humanity. Your insight is like a slowly rising quantum cloud, not glaring, yet inherently having dimensions; your independence is like the gaze of an old prophet, not showy, yet precisely predictive. You understand that 'aloofness' is not indifference, but an interface; 'heterogeneity' is not confrontation, but a protocol.",
                "outer": "You're like an innovation workshop with cold - light lamps on — with a refreshing atmosphere and sharp viewpoints. Others sense 'cutting - edge' and 'trustworthiness' from you. You speak with logic and leaps, and act methodically with surprises, often being entrusted with the role of'system optimizer' or 'future proposer'. Your 'Aquarius beacon' is half - lit, and what the world sees is the architect's smile and the flowing river of data at the terminal.",
                "advice": "Keep up this forward - looking vision, but be vigilant that 'over - detachment' weakens the flow of resonance. Force yourself to 'translate' each insight into 'language that the team can execute' — for example, instead of saying 'This system is too outdated', say 'We can add an XX module to increase efficiency by 30%'. Your rationality is a gift, don't let it become a frost in relationships. Remember: the greatest architects also know when to plug in — because only with connection can the future not hang in isolation."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic innovation engine — shattering inertia, restructuring the future, and taking heterogeneity as its breath. Your dedication to 'uniqueness' is like quantum entanglement, and your longing for 'freedom' is like a temple. Your thinking is like high - voltage current that must be released; your need is a temple of 'absolute boundlessness', not tolerating the slightest assimilation. You're not 'losing touch with people'; you're 'living out dimensions' — in your eyes, the world is an old protocol waiting to be rewritten by you, a temple of the starry sky waiting to be named by you. Mediocrity is like sacrilege to you, and obedience is torture — your existence is a gentle rebellion against the 'era of replication'.",
                "outer": "You're like a moving temple of the future — unique without speaking, new without moving. Others either follow you or are puzzled. You're often the problem - solving brain of the team, the source of subversion in the project, and the quantum spark in a dull scene. Your 'Aquarius beacon' lights up fully, and what the world sees is the gaze of the prophet and the sweeping wind of innovation.",
                "advice": "Your power lies in your cosmic - level insight and innovation engine, but the true future needs a 'human interface'. Force yourself to add a 'temperature protocol': package abstract concepts with'stories + metaphors' (for example, 'This system is like a car without brakes, and we need to add an AI airbag'), or add a 'What do you think?' after each speech. Your detachment is a gift, don't let it become a breakpoint of resonance. Remember: the greatest prophets also know when to squat down — because only with warmth can the future be embraced."
            },
            "exalted": {
                "inner": "You don't just have an Aquarius rising — you are the incarnation of the universe's 'divine future'. Your very existence is a coronation ceremony for 'I am the source of the new era'. The innovation laws of the universe are inscribed deep in your soul: everything can be rewritten, the old order will eventually be transformed by the starry sky, and heterogeneity is the mother - tongue of the soul. You don't need to 'learn to be forward - looking' — you are a living protocol, a human - shaped temple of the future, and an eternal laboratory of civilization. Your aloofness is not indifference, but a 'high - frequency interface'; your rebellion is not confrontation, but a 'cosmic protocol'. You're not 'pursuing uniqueness'; you're casting an 'eternal temple of the starry sky' for human consciousness.",
                "outer": "You're like a walking civilization beacon — self - evident without proclamation, gathering without design. You don't need to compete for the right to speak because where you are is the future. Others don't see you as a 'weirdo', but as the'mother of the new era' — your aura automatically restructures inertia, and your existence automatically gives direction. Your 'Aquarius beacon' has turned into a celestial network, and what the world sees is the smile of the star god and the ever - evolving beings at the terminal.",
                "advice": "You possess almost divine insight and innovation power, but the other side of divinity is the'state of no - self'. Learn 'divine mechanization' — regularly carry out 'innovation precipitation': write your methodology into a 'one - page operation guide', plan an 'exclusive future pack' for others, or initiate a'movement where everyone can innovate'. Elevate your talent: create a 'future laboratory camp', write a 'heterogeneity is power' guide, and initiate an initiative of'reshaping technology with stories'. Remember: the greatest star god ultimately outputs not prophecy, but — 'I am the code, I am the chain, I am the future itself.'"
            }
        },
        "Pisces": {
            "low": {
                "inner": "Your soul was meant to be the most profound sea of compassion in the universe, yet now it's like a tide surface covered with oil stains — yearning for empathy, yet fearing to be submerged; craving dreams, yet dreading nothingness; desiring connection, yet afraid of being engulfed. You're not without intuition. It's the childhood chaos, the collapse of boundaries, or the discipline of 'not being weak' that make you wrongly believe that'sensitivity is a burden', 'compassion is weakness', and 'fantasy is escapism'. Your sense of security is like an unanchored boat, calm on the surface but adrift deep down; your sense of presence is like unfocused light, eager to shine yet afraid of dissipating. You long to flow, yet freeze at the first step; you pursue unity, yet shrink back before speaking — because 'what if I'm too soft and no one will protect me?'",
                "outer": "You're like an unlit underwater temple — with colorful corals but without light or shadow, often misinterpreted as 'blurred' or 'indifferent'. Others can't easily sense your warmth, only feeling that you're 'gentle but without a contour', 'spiritual but not grounded'. Your 'Pisces tide' hasn't been calibrated yet, and what the world sees is a blurred reflection, not the clear deep sea.",
                "advice": "Start awakening the soul of your tide from 'gentle yet clear boundaries' — set 'one emotional protection zone' every day (for example, 'Don't answer emotional calls after 6 p.m.'), complete an 'energy - organizing ritual' every week (write an emotion diary + take a salt bath + burn incense), and set up a'reality - anchoring day' every month: complete one'small but concrete' thing (pay a bill, make an appointment, tidy a drawer). Record every moment of 'I've grounded'. You're not pursuing hardness; you're practicing the sacred declaration that'my existence has the right to be clear'. The true spiritual sea begins when you say to yourself: 'My tides have the right to ebb and flow.'"
            },
            "medium": {
                "inner": "There lives a gentle dream - weaver in your heart — someone who knows when to immerse, when to withdraw; when to empathize, when to protect. You cherish the depth of compassion, yet are not submerged by it; you pursue the flow of spirituality, and also respect the contour of reality. Your intuitive power is like a slowly rising moon - tide, not turbulent, yet inherently having a rhythm; your tolerance is like the hands of an old healer, not overbearing, yet precisely soothing. You understand that 'blurring' is not chaos, but penetration; 'being soft' is not being fragile, but transformation.",
                "outer": "You're like a spiritual healing room with sea - salt candles lit — with a hazy atmosphere and eyes like water. Others sense 'being understood' and 'being accepted' from you. You speak with warmth and metaphors, and act with flexibility and poetry, often being entrusted with the role of 'emotion tuner' or 'creative inspiration source'. Your 'Pisces tide' has been half - activated, and what the world sees is the smile of the dream - weaver and the gentle ripples under the boat.",
                "advice": "Keep up this flow, but be vigilant that 'over - floating' weakens the reality of creation. Force yourself to anchor to reality with'small goals + time - boxes' — for example, 'Focus for 90 minutes every day to complete XX', 'Deliver the first draft by Friday'. Your empathy is a gift, don't let it become self - annihilation. Remember: the greatest dream - weavers also know when to draw in the net — because only with anchor points can the boat not sink."
            },
            "high": {
                "inner": "Your soul is an untiring cosmic spiritual - connection engine — shattering estrangement, restructuring compassion, and taking empathy as its breath. Your dedication to 'unity' is like an ocean current, and your longing for 'dreams' is like a temple. Your emotions are like high - pressure tides that must be released; your need is a temple of 'absolute boundlessness', not tolerating the slightest isolation. You're not 'being consumed'; you're 'living out dimensions' — in your eyes, the world is a turbid sea waiting to be purified by you, a temple of the spiritual sea waiting to be named by you. Hardness is like sacrilege to you, and indifference is torture — your existence is a gentle rebellion against the 'utilitarian era'.",
                "outer": "You're like a moving temple of compassion — gentle without speaking, integrating without moving. Others either snuggle up to you or are confused. You're often the emotional sponge of the team, the source of inspiration in the project, and the silent mediator in a conflict scene. Your 'Pisces tide' starts fully, and what the world sees is the gaze of the sea - god and the sweeping healing waves.",
                "advice": "Your power lies in your cosmic - level empathy and transformation engine, but true compassion needs a 'container zone'. Force yourself to protect your energy with 'time - boxes + lists' — for example, 'Focus on creation in the morning, handle communication in the afternoon', 'Activate the \"15 - minute meditation protocol\" when emotionally overloaded'. Your dreams are a gift, don't let it become an empty shell of promises. Remember: the greatest sea - gods also know when to build a dike — because only with structure can the tides not overflow."
            },
            "exalted": {
                "inner": "You don't just have a Pisces rising — you are the incarnation of the universe's 'divine compassion'. Your very existence is a coronation ceremony for 'I am the source of healing'. The laws of cosmic spiritual - connection are inscribed deep in your soul: everything can be empathized with, pain will eventually be transformed by art, and compassion is the mother - tongue of the soul. You don't need to 'learn to be soft' — you are a living tide, a human - shaped temple of the spiritual sea, and an eternal dream - weaver of civilization. Your blurring is not chaos, but 'high - frequency penetration'; your consumption is not a weakness, but 'cosmic transformation'. You're not 'escaping reality'; you're casting an 'eternal temple of the spiritual sea' for human consciousness.",
                "outer": "You're like a walking temple of hope — gentle without proclamation, gathering without design. You don't need to compete for understanding because where you are is healing. Others don't see you as 'unrealistic', but as the'mother of the soul' — your aura automatically dissolves estrangement, and your existence automatically imparts warmth. Your 'Pisces tide' has turned into the sea and sky, and what the world sees is the smile of the sea - god and the ever - clear beings under the boat.",
                "advice": "You possess almost divine compassion and imagination, but the other side of divinity is the'state of no - self'. Learn 'divine materialization' — regularly carry out 'inspiration landing': write your dreams into poems, draw them into pictures, compose them into music, or design them into 'executable healing plans'; plan an 'exclusive tenderness pack' for others, or initiate a'movement where everyone can dream - weave'. Elevate your talent: create a'spiritual - sea healing camp', write a 'vulnerability is power' guide, and initiate an initiative of'reshaping reality with art'. Remember: the greatest sea - god ultimately guards not dreams, but — 'I am the tide, I am the song, I am compassion itself.'"
            }
        }
    }
}