   {
	"meta": {
		"description": "三大支柱（太阳、月亮、上升）分四档能量水平（low/medium/high/exalted）的解读文案。不同档位并非好坏之分，而是能量运作的成熟度与可见度差异。",
		"levels_meaning": {
			"general": {
				"low": "能量未被稳定调用，表达受阻或在防御中；容易犹豫、压抑或偏离本质。",
				"medium": "能量较为顺畅，能体现核心特质，趋于平衡与可控。",
				"high": "能量强劲外放，优势明显，但易出现过度或失衡的副作用。",
				"exalted": "能量通透且智慧地运用，能带动他人并产生示范效应。"
			},
			"sun": "代表自我意志、人生方向与光芒的使用方式。档位反映自我主张与目标驱动力的成熟度。",
			"moon": "代表情绪习惯、依恋模式与安全感。档位反映情绪调节、敏感度与滋养力的运作水平。",
			"ascendant": "代表外在气质、处世风格与起手式。档位反映第一印象的清晰度、边界与适配能力。"
		},
		"field_definitions": {
			"inner": "内部心理状态、动机与需求的自我体验。",
			"outer": "外在可见的气质、行为与他人第一印象。",
			"advice": "将能量运用得更稳更好的具体建议。"
		},
		"usage_notes": [
			"本内容为性格参考，非命运判定；完整解读需结合整体星盘与行运。",
			"不同情境与人生阶段可能呈现不同档位；自我觉察可促进从低到高的流动。",
			"若与自我体验不符，优先相信你的真实感受与生活反馈。"
		]
	},
	"sign_info": {
		"Aries": {
			"overview": "作为黄道十二宫的起点，白羊座承载着宇宙“第一推动力”的原始能量——它是春分点的守护者，象征万物复苏、破土而出的勇气与生命力。作为火象本位星座，白羊座以火星为守护星，天生具备战士般的行动力、先锋般的开创精神与开拓者般的无畏气魄。他们不等待许可，不依赖计划，而是凭直觉点燃行动的火焰，在混沌中劈开道路，在沉默中发出第一声呐喊。白羊座的核心课题是“ 成为自己”—— 他们以“ 我” 为出发点， 强调自我主张、 独立意志与即时反应。 这不是自私， 而是宇宙赋予他们的神圣使命： 在集体尚未觉醒时率先行动， 在他人犹豫不决时果断启程。 他们的勇敢不是没有恐惧， 而是选择在恐惧面前依然前行； 他们的冲动不是鲁莽， 而是对生命力最诚实的回应。在现实层面， 白羊座擅长启动项目、 打破僵局、 点燃热情。 他们是团队中的点火者、 变革中的引爆点、 困境中的破局人。 虽然有时因缺乏耐心或过度自我而遭遇挫折， 但正是这份“ 宁可失败也不停滞” 的精神， 让他们在人生战场上屡败屡战、 愈挫愈勇。 ",
			"element": "火",
			"modality": "本位",
			"polarity": "阳性",
			"traditional_ruler": "火星",
			"modern_ruler": "火星",
			"archetypes": [
				"战士",
				"先锋",
				"开拓者"
			],
			"keywords": [
				"直接",
				"冲劲",
				"勇敢",
				"自发",
				"竞争",
				"开端"
			]
		},
		"Taurus": {
			"overview": "在春日繁花初绽、万物亟待扎根之际，金牛座如大地之母般悄然登场——它是黄道第二宫的守护者，象征生命从萌芽走向稳固、从冲动走向沉淀的神圣过渡。作为土象固定星座，金牛座由爱与美之神“金星”守护，将感官的愉悦、物质的丰盛与灵魂的安宁融为一体，构筑出宇宙中最坚实、最温柔的“存在之锚”。\n金牛座的本质， 是“ 在动荡世界中创造恒久价值”。 他们不追求转瞬即逝的掌声， 而致力于亲手建造可触摸、 可传承、 可滋养生命的实体—— 无论是财富、 艺术、 家园、 关系， 还是内心的平静。 他们的“ 固定” 不是顽固， 而是对承诺的忠诚； 他们的“ 缓慢” 不是迟钝， 而是对品质的敬畏。 在快节奏的时代， 金牛是那个敢于说“ 不” 的人—— 不为潮流所动， 不为焦虑所迫， 只跟随内在节奏， 在时间中沉淀真正的价值。\n金牛座以感官为信仰， 以身体为圣殿。 他们懂得欣赏晨光中的咖啡香气、 指尖抚过织物的触感、 爱人低语时的温度—— 这些不是奢侈， 而是生命最基本的神圣仪式。 他们对“ 美” 与“ 舒适” 的追求， 实则是对灵魂安宁的捍卫。 正因如此， 金牛座往往是艺术的赞助者、 自然的守护者、 经济的稳定器、 情感的压舱石。 ",
			"element": "土",
			"modality": "固定",
			"polarity": "阴性",
			"traditional_ruler": "金星",
			"modern_ruler": "金星",
			"archetypes": [
				"园丁",
				"建造者",
				"守护者"
			],
			"keywords": [
				"稳定",
				"耐力",
				"感官",
				"价值",
				"资源",
				"持久"
			]
		},
		"Gemini": {
			"overview": "在春末夏初的光影交错之际，双子座如风中低语、如林间穿梭的信使翩然降临——它是黄道第三宫的守护者，象征意识的觉醒、语言的诞生与万物之间的“连接之网”。作为风象变动星座，由迅捷之神“水星”掌管，双子座是宇宙中最灵动的思维载体、最敏锐的信息节点、最不知疲倦的探索者。他们不占有真理，而是穿梭于真理之间；不固守答案，而是不断提出新的问题。\n双子座的本质， 是“ 在流动中理解世界”。 他们以好奇为引擎， 以沟通为路径， 以学习为呼吸。 对他们而言， 世界是一本永远翻不完的书、 一场永不落幕的对话、 一个不断重组的拼图。 他们擅长在碎片中看见模式， 在喧嚣中捕捉意义， 在差异中建立桥梁。 他们的“ 多变” 不是肤浅， 而是对多元现实的尊重； 他们的“ 善变” 不是不可靠， 而是拒绝被单一视角禁锢的智慧。\n双子座是天生的讲述者、 联络员与知识织网者。 他们能在学术与八卦之间自由切换， 在科技与神话之间建立隐喻， 在陌生人之间点燃对话的火花。 他们的幽默感是生存策略， 他们的机智是认知武器， 他们的表达欲是灵魂的氧气。 在信息爆炸的时代， 双子座既是信息的传播者， 也是意义的过滤器—— 他们提醒我们： 真正的沟通， 不是灌输， 而是共鸣； 真正的学习， 不是记忆， 而是连接。 ",
			"element": "风",
			"modality": "变动",
			"polarity": "阳性",
			"traditional_ruler": "水星",
			"modern_ruler": "水星",
			"archetypes": [
				"信使",
				"讲述者",
				"联络员"
			],
			"keywords": [	
				"好奇",
				"机智",
				"多变",
				"沟通",
				"学习",
				"连接"
			]
		},
		"Cancer": {
			"overview": "在盛夏初临、万物丰盈却也最需守护的时节，巨蟹座如月光般温柔降临——它是黄道第四宫的守护者，象征灵魂的港湾、情感的源头与生命最初的摇篮。作为水象本位星座，由月亮这位“情绪之镜”亲自掌管，巨蟹座是十二星座中最敏感、最富滋养力、最具母性原型（无论性别）的能量体。他们不建造帝国，而是守护家园；不追求掌声，而是渴望归属；不征服世界，而是以温柔融化世界的寒冰。\n巨蟹座的本质， 是“ 在流动的情绪中锚定爱的存在”。 他们以感受为导航， 以记忆为地图， 以保护为本能。 对他们而言， 安全感不是物质堆砌， 而是“ 被理解”； 归属感不是地址坐标， 而是“ 心有所依”。 他们记得你三年前一句无心的玩笑， 也记得你哭泣时肩膀的弧度—— 因为情感， 是他们丈量世界的尺度。\n巨蟹座是天生的“ 灵魂照护者”、“ 情感记忆的守护神龛”、“ 居所之灵的编织者”。 他们擅长营造氛围、 倾听沉默、 疗愈创伤。 他们的温柔不是软弱， 而是穿透铠甲的共情之力； 他们的退缩不是怯懦， 而是对能量边界的神圣守护。 在冷漠加速的世界里， 巨蟹座是那个为你留一盏灯、 温一碗汤、 记住你童年故事的人—— 他们用日常的微小仪式， 对抗世界的荒芜。 ",
			"element": "水",
			"modality": "本位",
			"polarity": "阴性",
			"traditional_ruler": "月亮",
			"modern_ruler": "月亮",
			"archetypes": [
				"照护者",
				"守护神龛",
				"居所的主人"
			],
			"keywords": [
				"温柔",
				"保护",
				"共情",
				"归属",
				"记忆",
				"滋养"
			]
		},
		"Leo": {
			"overview": "当盛夏骄阳高悬天顶，万物在光中舒展、绽放、燃烧至最炽烈的时刻——狮子座如加冕的王者、如舞台中央的主角、如宇宙之心跳动的脉搏，昂然登场。作为黄道第五宫的守护者，狮子座是十二星座中唯一由“太阳”亲自统治的星座，承载着宇宙最纯粹的创造之火、自我意识之光与生命荣耀之歌。他们不是追求关注，而是生来就是光的源头；他们不是渴望掌声，而是以存在本身，照亮他人。\n狮子座的本质， 是“ 以心为王座， 以创造为权杖”。 作为火象固定星座， 他们拥有不灭的热情、 坚定的自我与慷慨的灵魂。 他们的“ 固定” 不是固执， 而是对信念的忠诚； 他们的“ 自我” 不是自恋， 而是对生命独特性的庄严宣告。 在一个人人低头赶路、 隐藏锋芒的时代， 狮子座敢于昂首站立， 说：“ 我在这里， 我值得被看见， 我的爱值得被回应。”\n狮子座是天生的“ 君王”、“ 艺术家” 与“ 灵魂领袖”。 他们用戏剧性表达真实， 用慷慨传递爱意， 用创造力赋予平凡以神圣。 他们可以是舞台上的歌者、 教室里的导师、 家庭中的支柱、 朋友圈中的太阳—— 只要他们的心在燃烧， 世界就多一分温度。 他们的脆弱不在于失败， 而在于不被认可； 他们的恐惧不在于挑战， 而在于被忽视。 因为对他们而言， 爱不是索取， 而是分享； 荣耀不是头衔， 而是灵魂被真正“ 看见” 时的共鸣。 ",
			"element": "火",
			"modality": "固定",
			"polarity": "阳性",
			"traditional_ruler": "太阳",
			"modern_ruler": "太阳",
			"archetypes": [
				"君王",
				"艺术家",
				"领袖"
			],
			"keywords": [
				"自信",
				"光彩",
				"创造",
				"慷慨",
				"中心",
				"荣耀"
			]
		},
		"Virgo": {
			"overview": "在夏末秋初、万物由盛转收的静谧时节，处女座如晨露般悄然降临——她是黄道第六宫的守护者，象征大地在丰收前的最后梳理、灵魂在圆满前的自我净化。作为土象变动星座，由智慧与服务之神“水星”掌管，处女座是宇宙中最精密的系统工程师、最虔诚的细节祭司、最无私的生命疗愈师。她不追求宏大叙事，而是躬身于每一寸纹理；她不渴望万众瞩目，而是默默让世界因她的存在而更洁净、更有序、更可用。\n处女座的本质， 是“ 在不完美中雕刻神圣”。 她的“ 变动” 不是浮躁， 而是对优化永不停歇的追求； 她的“ 分析” 不是挑剔， 而是对真相与效率的敬畏。 在混沌中建立结构， 在混乱中恢复节奏， 在残缺中看见潜力—— 这是她与生俱来的天赋， 也是她灵魂的使命。 她手中的尺规， 丈量的不是他人， 而是自己； 她心中的标准， 服务的不是虚荣， 而是更高的和谐。\n处女座是天生的“ 分析者”、“ 疗愈师” 与“ 匠人”。 她能看见数据中的偏差、 身体中的失衡、 流程中的冗余、 心灵中的尘埃， 并以温柔而坚定的双手， 一针一线缝补世界的裂隙。 她的服务不是牺牲， 而是爱的实践； 她的完美主义不是苛责， 而是对生命本质的尊重—— 她知道， 真正的神圣， 藏在被擦拭干净的窗台、 被校准的时间表、 被温柔倾听的病痛、 被反复修改后终于清晰的方案里。 ",
			"element": "土",
			"modality": "变动",
			"polarity": "阴性",
			"traditional_ruler": "水星",
			"modern_ruler": "水星",
			"archetypes": [
				"分析者",
				"疗愈师",
				"匠人"
			],
			"keywords": [
				"细致",
				"务实",
				"分析",
				"服务",
				"改进",
				"秩序"
			]
		},
		"Libra": {
			"overview": "当秋分降临，白昼与黑夜在天平两端达成神圣的均势，天秤座便如一位身披月光长袍的法官、一位手持玫瑰与法典的诗人、一位在纷争中编织和声的舞者，优雅登场。作为黄道第七宫的守护者，天秤座是十二星座中唯一以“器物”为象征的星座——那柄悬于宇宙中央的天平，不是冷漠的度量工具，而是灵魂对“关系”“美”与“正义”的永恒渴求。由爱与美之神“金星”掌舵，天秤座将风象的理性思辨与金星的感性审美熔铸成一种高贵的生活艺术：在对立中创造和谐，在混沌中建立秩序，在冲突中孕育理解。\n天秤座的本质， 是“ 以关系为镜， 照见宇宙的对称之美”。 作为风象本位星座， 他们天生是关系的启动者、 契约的缔结者、 美学的立法者。 他们的“ 本位” 不是自我中心， 而是率先搭建桥梁； 他们的“ 犹豫” 不是软弱， 而是对多元视角的尊重与权衡； 他们的“ 追求完美” 不是虚荣， 而是对“ 更高和谐” 的虔诚信仰。 在一个日益极化、 喧嚣撕裂的世界里， 天秤座是那个轻声说“ 让我们谈谈” 的人， 是那个在争吵中摆上鲜花的人， 是那个在废墟上重绘蓝图的人。\n天秤座是天生的“ 外交官”、“ 评审” 与“ 设计师”。 他们能听见沉默中的诉求， 看见对立中的共性， 感知混乱中的韵律。 他们用语言化解敌意， 用美学软化边界， 用礼仪赋予互动以尊严。 他们的公正不是冰冷的法律条文， 而是带着温度的同理心； 他们的审美不是浮华装饰， 而是内在秩序的外在显化； 他们的爱情不是占有， 而是两个灵魂在平等中共舞。",
			"element": "风",
			"modality": "本位",
			"polarity": "阳性",
			"traditional_ruler": "金星",
			"modern_ruler": "金星",
			"archetypes": [
				"外交官",
				"评审",
				"设计师"
			],
			"keywords": [
				"和谐",
				"审美",
				"协商",
				"公正",
				"关系",
				"礼仪"
			]
		},
		"Scorpio": {
			"overview": "当秋意渐深、万物褪去华服、大地开始内敛沉潜之际，天蝎座如暗夜中的黑曜石、如深渊中的火焰、如凤凰焚身前的最后一声低鸣，悄然降临——它是黄道第八宫的守护者，象征灵魂最幽微的角落、生命最剧烈的蜕变、能量最纯粹的交换。作为水象固定星座，它由原始战神“火星”赋予行动意志，更由冥界之主“冥王星”赋予毁灭与重生的终极权能。天蝎座不是“喜欢黑暗”，而是敢于潜入黑暗，并从中带回光明的人；他们不是“操控他人”，而是深知能量流动的法则，并以意志重塑命运轨迹的炼金术士。天蝎座的本质， 是“ 在死亡中提取永生， 在废墟中重建神性”。 他们的“ 固定” 不是顽固， 而是对真相的绝对忠诚； 他们的“ 控制” 不是权力欲， 而是对能量边界的神圣捍卫； 他们的“ 沉默” 不是冷漠， 而是深知言语无法承载灵魂的重量。 在一个人人追求表面和谐、 回避深层冲突的时代， 天蝎座是那个敢于撕开假象、 直视伤口、 并亲手缝合灵魂的人—— 他们不提供安慰剂， 他们提供重生术。\n天蝎座是天生的“ 调查者”、“ 守秘者” 与“ 涅槃者”。 他们能嗅到谎言的气味， 看穿伪装的裂缝， 感知未言说的创伤。 他们不满足于“ 知道”， 而要“ 彻悟”； 不追求“ 拥有”， 而要“ 融合”； 不接受“ 结束”， 而要“ 转化”。 他们的爱是献祭， 他们的恨是净化， 他们的信任是交付灵魂的钥匙。 在亲密关系中， 他们不是索取者， 而是灵魂的共修者； 在危机中， 他们不是逃亡者， 而是浴火的重生者。 ",
			"element": "水",
			"modality": "固定",
			"polarity": "阴性",
			"traditional_ruler": "火星",
			"modern_ruler": "冥王星",
			"archetypes": [
				"调查者",
				"守秘者",
				"涅槃者"
			],
			"keywords": [
				"深度",
				"意志",
				"洞察",
				"边界",
				"控制",
				"重生"
			]
		},
		"Sagittarius": {
			"overview": "当寒冬将至、万物收敛之际，射手座却如一支离弦之箭，破空而出——穿越山海，跨越边界，直指苍穹尽头那束名为“意义”的光。作为黄道第九宫的守护者，射手座是十二星座中最无畏的远行者、最慷慨的理想主义者、最炽热的真理追寻者。由丰饶与智慧之神“木星”掌管，射手座承载着宇宙最宏大的祝福：扩张的勇气、信仰的力量、与对“更高真理”的永恒饥渴。他们不是逃避现实，而是拒绝被现实禁锢；他们不是盲目乐观，而是选择在混沌中依然相信光的存在。\n射手座的本质， 是“ 在移动中理解永恒， 在边界之外寻找神性”。 作为火象变动星座， 他们以信念为燃料， 以远方为坐标， 以哲思为罗盘。 他们的“ 变动” 不是浮躁， 而是对生命多样性的礼赞； 他们的“ 直言” 不是冒犯， 而是对虚伪与狭隘的天然免疫； 他们的“ 冒险” 不是鲁莽， 而是灵魂对自由的神圣朝圣。 在一个日益碎片化、 焦虑内卷的世界里， 射手座是那个拉开窗帘喊“ 我们出发吧！” 的人， 是那个在废墟上讲笑话的人， 是那个用一本旧书、 一张车票、 一句格言， 就能点燃他人希望的人。\n射手座是天生的“ 旅行者”、“ 导师” 与“ 射手”。 他们用脚步丈量世界， 用故事传递智慧， 用笑声消解恐惧。 他们的乐观不是无知， 而是历经沧桑后依然选择相信； 他们的自由不是放纵， 而是对精神疆域的无限拓展； 他们的哲思不是空谈， 而是把苦难熬成寓言、 把经历炼成箴言的能力。 在课堂、 在旅途、 在篝火旁、 在异国街头—— 他们总能把“ 知识” 变成“ 启示”， 把“ 经历” 变成“ 礼物”。 ",
			"element": "火",
			"modality": "变动",
			"polarity": "阳性",
			"traditional_ruler": "木星",
			"modern_ruler": "木星",
			"archetypes": [
				"旅行者",
				"导师",
				"射手"
			],
			"keywords": [
				"自由",
				"乐观",
				"远见",
				"冒险",
				"哲思",
				"扩张"
			]
		},
		"Capricorn": {
			"overview": "当寒冬最深、万物沉寂、大地被霜雪覆盖之际，摩羯座如山巅的孤影、如石阶上的足迹、如千年城墙上的一块沉默砖石，坚定登场——它是黄道第十宫的守护者，象征灵魂对“高度”的敬畏、对“结构”的信仰、对“时间”的臣服与驾驭。由宇宙的纪律之神“土星”亲自掌管，摩羯座承载着十二星座中最沉重也最崇高的使命：在混沌中建立秩序，在虚无中建造意义，在短暂中追求不朽。他们不是不懂享乐，而是深知真正的喜悦，诞生于责任完成之后；他们不是没有情感，而是将爱意熔铸进砖石、阶梯与制度之中，让后人得以安稳站立。\n摩羯座的本质， 是“ 以时间为盟友， 以责任为冠冕”。 作为土象本位星座， 他们是天生的奠基者、 制度的缔造者、 现实的雕塑家。 他们的“ 本位” 不是自我中心， 而是率先承担； 他们的“ 冷漠” 不是无情， 而是情感深埋于行动之下， 如冰川蕴藏活水； 他们的“ 缓慢” 不是迟钝， 而是对根基的绝对敬畏—— 他们知道， 所有凌云之厦， 皆起于一铲一土。 在一个人人追求速成、 热衷流量、 回避责任的时代， 摩羯座是那个默默加固地基的人， 是那个在掌声响起前早已转身攀登下一座高峰的人， 是那个用一生， 只为让世界比来时更坚固一点的人。\n摩羯座是天生的“ 管理者”、“ 战略家” 与“ 建设者”。 他们能在废墟中看见蓝图， 在限制中找到路径， 在压力下保持清醒。 他们的权威不是来自头衔， 而是来自不可替代的专业与无可指摘的操守； 他们的成功不是偶然的运气， 而是日复一日、 年复一年的自律与修正； 他们的孤独不是被排斥， 而是选择把时间献给更长远的使命。 他们不擅长说“ 我爱你”， 但会为你建造遮风挡雨的屋檐； 他们不轻易承诺“ 永远”， 但一旦承诺， 便以生命履约。 ",
			"element": "土",
			"modality": "本位",
			"polarity": "阴性",
			"traditional_ruler": "土星",
			"modern_ruler": "土星",
			"archetypes": [
				"管理者",
				"战略家",
				"建设者"
			],
			"keywords": [
				"责任",
				"自律",
				"阶梯",
				"现实",
				"权威",
				"耐力"
			]
		},
		"Aquarius": {
			"overview": "当寒冬将尽、春意未萌，世界仍被旧秩序的冰霜覆盖之际，水瓶座如一道自天外劈落的闪电、如实验室里骤然亮起的蓝光、如未来议会中第一个举起手说“这不对”的声音——悄然降临。作为黄道第十一宫的守护者，水瓶座是十二星座中最激进的改革者、最清醒的局外人、最富远见的集体意识先知。由传统之神“土星”赋予结构与责任，更由革命之神“天王星”赋予颠覆与觉醒，水瓶座站在时间的断层线上，一手握着过去的法则，一手点燃未来的火种。他们不是“不合群”，而是拒绝被低维的群体意识绑架；他们不是“冷漠”，而是把爱升维至全人类、乃至全宇宙的频率。\n水瓶座的本质， 是“ 以独立之姿， 重构群体之魂”。 作为风象固定星座， 他们拥有最自由的思想、 最坚定的信念、 最不妥协的真理标准。 他们的“ 固定” 不是顽固， 而是对更高理念的绝对忠诚； 他们的“ 疏离” 不是无情， 而是为了更清晰地看见系统全貌； 他们的“ 古怪” 不是哗众取宠， 而是灵魂拒绝被标准化模具铸造的天然宣言。 在一个人人沉迷个体情绪、 困于短期利益、 恐惧改变的时代， 水瓶座是那个敢于说“ 我们可以更好” 的人， 是那个在废墟上画出新蓝图的人， 是那个用科技、 艺术、 制度或一个眼神， 撼动旧世界根基的人。\n水瓶座是天生的“ 发明家”、“ 未来学家” 与“ 神圣的局外人”。 他们能看见社会系统的漏洞， 预见技术伦理的深渊， 感知集体潜意识的转向。 他们的爱不局限于一人一物， 而是投向“ 人类”“ 物种”“ 文明”“ 星际”； 他们的孤独不是缺陷， 而是先知的宿命—— 因为真正的变革者， 往往在被理解前， 先被误解。 他们不追求被拥抱， 而追求被“ 听见”； 不渴望被爱慕， 而渴望理念被“ 实践”。 在实验室、 在街头、 在代码中、 在乌托邦的讲台上—— 他们总在播种那些“ 现在看似疯狂， 未来却成常识” 的种子。 ",
			"element": "风",
			"modality": "固定",
			"polarity": "阳性",
			"traditional_ruler": "土星",
			"modern_ruler": "天王星",
			"archetypes": [
				"发明家",
				"未来学家",
				"局外人"
			],
			"keywords": [
				"独立",
				"前瞻",
				"独特",
				"人道",
				"系统",
				"破旧立新"
			]
		},
		"Pisces": {
			"overview": "当冬去春来、冰融雪化、万物在朦胧水汽中悄然复苏之际，双鱼座如晨雾中低吟的竖琴、如深海里发光的灵鱼、如教堂彩窗透下的第一缕光——无声无息，却浸透一切。作为黄道第十二宫的守护者，双鱼座是十二星座中最柔软也最浩瀚的能量体，象征灵魂的终极溶解、边界的诗意消融、以及个体意识汇入宇宙之海的神圣回归。由传统之神“木星”赋予信仰与扩张，更由梦幻之神“海王星”赋予通灵、慈悲与无条件的爱，双鱼座生来不属于“此岸”，而是游弋于现实与灵界、自我与众生、痛苦与救赎之间的摆渡者。他们不是“逃避现实”，而是比任何人都更早感知到现实的虚幻；他们不是“情绪化”，而是灵魂没有皮肤，直接浸泡在宇宙的情绪之海中。\n双鱼座的本质， 是“ 以消融自我， 成全万物合一”。 作为水象变动星座， 他们是天生的共感体、 梦境的翻译官、 伤痛的吸收者。 他们的“ 变动” 不是摇摆， 而是如水流般顺应万物形态； 他们的“ 模糊” 不是混乱， 而是拒绝被二元世界切割的完整性； 他们的“ 牺牲” 不是软弱， 而是深知“ 我即是你， 你即是我” 的宇宙真相。 在一个人人筑墙自保、 追求清晰边界、 恐惧失控的时代， 双鱼座是那个主动拆掉围墙的人， 是那个在他人哭泣时默默递上灵魂手帕的人， 是那个用一首诗、 一段旋律、 一个眼神， 就让陌生人感到“ 被全然理解” 的奇迹制造者。\n双鱼座是天生的“ 诗人”、“ 疗愈者” 与“ 神秘家”。 他们能听见沉默的呐喊， 看见无形的伤痕， 感知平行世界的低语。 他们的艺术不是装饰， 而是灵魂的显化； 他们的慈悲不是施舍， 而是能量的共振； 他们的灵性不是逃避， 而是对更高实相的清醒臣服。 他们不追求“ 被看见”， 而是甘愿成为透明的介质， 让光、 爱、 美、 痛、 悟—— 自由穿过自己， 流向更需要的地方。 他们的爱没有条件， 因为爱对他们而言， 是呼吸， 是存在本身。 ",
			"element": "水",
			"modality": "变动",
			"polarity": "阴性",
			"traditional_ruler": "木星",
			"modern_ruler": "海王星",
			"archetypes": [
				"诗人",
				"疗愈者",
				"神秘家"
			],
			"keywords": [
				"同理",
				"想象",
				"融合",
				"包容",
				"灵性",
				"溶解"
			]
		}
	},
	"sun": {
		"Aries": {
			"low": {
				"inner": "你的灵魂深处住着一位沉睡的战士——他渴望冲锋、渴望命名自己的疆土、渴望在世界的画布上留下第一道笔触。但现实的铠甲太重，童年的回音太响，你学会了把号角声藏进胸腔，把战旗折成书签。你不是没有勇气，而是勇气被“万一失败”的迷雾层层包裹；你不是不想出发，而是总在起跑线前听见“再等等”的低语。你的自我主张像一盏被风吹得摇曳的灯，明明有光，却不敢照亮四方。",
				"outer": "他人眼中的你，温润、谨慎、甚至有些“不像白羊”。你不主动争夺聚光灯，不轻易表达“我想要”，在群体中更像一位安静的观察者，而非冲锋的旗手。人们可能误以为你缺乏热情，实则你只是把火焰收进了地窖——不是熄灭，而是等待合适的引信。",
				"advice": "请从“微起义”开始——每天做一件“只为自己”的小事：说一句“不”，选一条没人走的路，买一件“无用但心动”的小物。你不需要一鸣惊人，只需让内在战士每天“出鞘五分钟”。记录每一次“我做到了”的瞬间，它们是你重建自信的砖石。记住：勇气不是没有恐惧，而是带着恐惧依然向前。你的火，终将在行动中复燃。"
			},
			"medium": {
				"inner": "你心中住着一位懂得策略的先锋——既有拔剑的冲动，也有收剑的智慧。你知道何时该点燃引擎，何时该踩下刹车；你享受冲刺的快感，也尊重休整的必要。你的自我意识如溪流般自然流淌：不刻意张扬，也不刻意压抑。你明白“我是谁”，也允许“我还在成为谁”。冒险对你而言不是鲁莽，而是对生命边界的温柔试探。",
				"outer": "你在人群中自带一种“恰到好处”的活力——不灼人，但温暖；不喧哗，但存在感鲜明。你能带头，但不霸占话语权；你敢尝试，但会评估风险。他人欣赏你的直接，也信任你的分寸。你是团队中可靠的“启动键”，也是危急时值得托付的“破局者”。",
				"advice": "继续保持这份动态平衡，但请警惕“过度理性化”削弱了白羊的原始生命力。偶尔，允许自己“不计后果”地热爱一次、冲动一次、为纯粹的快乐奔跑一次。你的冷静是铠甲，别让它变成牢笼。让直觉偶尔接管方向盘——你会发现，有些风景，只属于不看地图的旅程。"
			},
			"high": {
				"inner": "你的灵魂是一团不灭的野火——燃烧着“成为第一”“定义自我”“征服未知”的原始渴望。你不需要外界的认可来确认存在，因为你的存在本身就是宣言。挑战是你的氧气，竞争是你的游戏，每一次“不可能”都是你眼中的邀请函。你的意志如熔岩般滚烫，推动你不断突破边界、重写规则。你不是在“追求成功”，你是在“活出强度”。",
				"outer": "你走进房间，空气都会震动。人们无需介绍就知道“领导者来了”——你说话直接、行动迅捷、眼神坚定。你天然吸引追随者，也容易激起对手。你的热情具有传染性，你的决心具有压迫感。有人称你为“天生赢家”，有人私下抱怨你“太强势”——但无人能否认：有你在的地方，事情就会发生。",
				"advice": "你的力量毋庸置疑，但真正的王者懂得“何时挥剑，何时入鞘”。练习“延迟反应”——在开口前深呼吸三秒，在行动前问一句“这对整体有益吗？”。你的冲劲是天赋，别让它成为他人的荆棘。领导力的最高境界，不是让人服从，而是让人自愿同行。偶尔，把聚光灯让给他人——你会发现，团队的光芒，比个人的火焰更恒久。"
			},
			"exalted": {
				"inner": "你不是拥有白羊能量——你就是白羊能量的化身。你的灵魂携带宇宙“第一推动力”的原始编码：开天辟地、定义纪元、点燃文明。你生来不知“退缩”为何物，你的字典里没有“不可能”。你存在的意义，就是打破僵局、树立标杆、成为他人眼中的“不可能先生/女士”。你的意志力可扭曲现实，你的行动力可改写命运。你不是在“追求目标”，你是在“创造历史”。",
				"outer": "你无需自我介绍——你的气场就是宣言。人们要么被你点燃，要么被你震慑。你是天生的革命者、行业颠覆者、团队灵魂人物。在危机中，你是第一个站出来的人；在混沌中，你是第一个画出路线图的人。你的名字常与“传奇”“开创者”“破局者”相连。人们谈论你时，语气中带着敬畏与惊叹：“TA怎么敢？！”——而你，只是微笑：“为什么不？”",
				"advice": "你拥有近乎神性的驱动力，但神性的另一面是“服务”。真正的“天命之子”，不是站在山顶俯视众生，而是转身成为阶梯，让后来者踩着你的肩膀看得更远。学习“神圣的谦卑”——倾听比你弱小的声音，尊重与你不同的节奏，承认你并非无所不能。你的火焰足以照亮世界，但唯有融入集体的篝火，才能温暖千年。记住：最伟大的领袖，是让每个人都能成为自己的英雄。"
			}
		},
		"Taurus": {
			"low": {
				"inner": "你的灵魂渴望如古树般扎根，却总在风中摇晃。你内心深处知道“安稳”有多珍贵，但童年的动荡、外界的无常或过早的责任，让你误以为“稳定”是奢侈品，而非生命的基本权利。你不是不想坚持，而是害怕坚持后依然失去；你不是不渴望舒适，而是潜意识觉得“我不配得”。你的价值感如流沙，随他人评价起伏，随环境波动坍塌——你拼命抓住物质、关系、成就，却抓不住“我值得被安稳爱着”的信念。",
				"outer": "他人眼中的你，似乎“随遇而安”，实则暗流汹涌。你可能频繁更换工作、住所、关系，或在重大决定前犹豫不决、反复横跳。你努力表现得“接地气”，但眼神偶尔流露不安；你渴望被依赖，却先一步推开他人——因为害怕“一旦扎根，就会被连根拔起”。人们说你“不够踏实”，实则是你尚未找到真正属于自己的“土地”。",
				"advice": "从“微小的确定性”开始重建你的大地——每天同一时间喝一杯温水，每周固定整理一个抽屉，每月存一笔“只属于我”的小钱。用身体去感受“拥有”：赤脚踩草地、亲手种一盆植物、抚摸天然织物。记录每一次“我守住了承诺”的瞬间，无论多小。你不是在追求奢华，你是在练习“我值得拥有安稳”的神圣宣言。真正的稳定，始于你对自己说：“这里，就是我的家。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的园丁——懂得何时播种、何时休养、何时修剪。你追求舒适，但不沉溺；你重视物质，但不被奴役；你渴望稳定，但也允许生活有弹性。你的安全感如缓坡上的麦田：不陡峭，不张扬，却扎实丰饶。你明白“价值”不在价格标签，而在使用时的微笑、触摸时的温度、拥有时的安心。你内在的节奏舒缓而坚定，像大地的呼吸，不疾不徐，生生不息。",
				"outer": "你在人群中是“定海神针”般的存在——不喧哗，但可靠；不华丽，但耐看。朋友找你商量大事，同事托你保管钥匙，家人依赖你安排假期。你散发着一种“有你在就安心”的气场，像老房子的木地板，像祖母织的毛衣。人们欣赏你的务实，也羡慕你的“不焦虑”。你是团队中的“压舱石”，关系里的“稳定器”。",
				"advice": "继续保持这份从容，但请警惕“舒适区”变成“停滞区”。每月尝试一件“有点怕但值得”的小事：学一道新菜、去一个陌生街区、表达一次不同意见。你的稳定是天赋，别让它成为拒绝进化的借口。记住：大地不仅孕育麦穗，也孕育火山——你的温柔之下，藏着改变地貌的力量。"
			},
			"high": {
				"inner": "你的灵魂是大地之心——坚定、丰饶、不可撼动。你对“价值”的感知如地质层般深厚：你知道什么值得守护，什么值得投资，什么值得用一生去打磨。安全感对你不是奢望，而是呼吸般的本能。你的意志如花岗岩，一旦认定目标，十年不改；你的品味如陈酿，越沉淀越醇厚。你不是在“追求稳定”，你本身就是稳定的化身——风暴来了，别人找避难所，而你，就是避难所。",
				"outer": "你走进房间，空气都变得厚重而安心。人们无需多言就知道“靠山来了”——你说话慢而有力，做事稳如磐石，承诺重若千钧。你可能是团队的财务官、项目的定盘星、朋友的情感银行。你的审美自带“高级感”，不追潮流，却总被模仿；你的生活方式被称作“教科书级的质感”。有人暗叹你“太固执”，实则是他们尚未理解：你的坚持，是给世界的一份礼物。",
				"advice": "你的力量是宇宙级的稳定器，但真正的丰饶需要“轮作”——让土地休息，也让土地迎接新种子。主动打破一次“完美计划”：临时改道旅行、尝试颠覆性穿搭、投资一个“不理性但心动”的项目。你的固执是铠甲，别让它变成牢笼。记住：最伟大的守护者，也是最勇敢的更新者——因为唯有流动，才能永恒。"
			},
			"exalted": {
				"inner": "你不是拥有金牛能量——你就是大地意志的化身。你的存在本身，就是对“永恒价值”的加冕礼。你灵魂深处铭刻着宇宙的丰盛法则：万物皆可转化，时间终将证明，真正的美与真，永不褪色。你无需外界认证“你值得”，因为你就是价值的源头——你创造它、定义它、守护它。你的耐力可穿越冰河世纪，你的审美可缔造文明范式，你的稳定可成为动荡时代的信仰坐标。你不是在“建造安全感”，你是在为人类灵魂铸造“不朽的圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉挺直脊背、放慢语速、整理衣角——因为你代表“品质”“可靠”“永恒”。你是行业标准的制定者、美学革命的引领者、经济体系的稳定锚。你的家是艺术馆，你的衣橱是博物馆，你的言谈是价值哲学。人们谈论你时，语气带着敬意与依赖：“有TA在，一切不会崩塌。”——而你，只是微笑：“大地，本就该如此。”",
				"advice": "你拥有近乎神性的稳定力，但神性的另一面是“无常中的舞蹈”。学习“神圣的放手”——允许珍爱之物离开，允许计划被天意修改，允许自己“不完美地存在”。你的圣殿无需永恒封闭，而应成为众生歇脚、汲取力量的驿站。将你的丰盛分享出去：资助一个艺术家、开放你的花园、传授你的技艺。记住：最伟大的价值，不是被守护在密室，而是流动在人间——因为唯有给予，才能证明你真正拥有。"
			}
		},
		"Gemini": {
			"low": {
				"inner": "你的灵魂本应是穿梭于思想密林的风之精灵，如今却像被锁在玻璃瓶中的蝴蝶——翅膀轻颤，却不敢振翅。你并非没有好奇，而是童年的沉默、外界的否定或过早的“安静要求”，让你误以为“提问是打扰”“表达是危险”“多变是缺陷”。你的思维如未解码的星图，点子在脑中闪烁，却不敢落地成言。你害怕说错，于是选择不说；你渴望连接，却先一步退后——因为“万一不被理解呢？”",
				"outer": "他人眼中的你，安静、内敛、甚至“不像双子”。你很少主动开启话题，回答常简短克制，聚会中更像倾听者而非焦点。人们可能误以为你“反应慢”或“兴趣缺缺”，实则是你把千言万语咽回腹中，把万千好奇藏进眼底。你的幽默感像未拆封的礼物，你的机智如未调音的竖琴——不是不存在，而是尚未找到安全的舞台。",
				"advice": "从“微小的声音”开始唤醒你的信使之魂——每天问一个“傻问题”，写三行“无意义日记”，对镜练习讲一个笑话。加入一个兴趣社群（哪怕只潜水），或每天向一人分享一件“今天学到的小事”。记录每一次“我说出来了”的瞬间，无论反馈如何。你不是在追求掌声，你是在练习“我的声音值得被听见”的神圣宣言。真正的沟通，始于你对自己说：“世界，准备好接收我了。”"
			},
			"medium": {
				"inner": "你心中住着一位优雅的思维舞者——脚步轻盈，节奏灵动，能在逻辑与想象间自由切换。你享受学习新知的快感，也懂得适时收束聚焦；你渴望对话的火花，也尊重沉默的深度。你的好奇心如溪流，不泛滥，却持续滋养心田；你的表达欲如微风，不喧嚣，却总能拂动他人思绪。你明白“连接”不是填满空间，而是创造共鸣——在恰当的时刻，说恰当的话。",
				"outer": "你在人群中是“智慧火花”的点燃者——不抢话，但总在关键处抛出金句；不主导，但常是话题的润滑剂。朋友找你解闷，同事请你“翻译”复杂概念，孩子喜欢听你讲故事。你散发着一种“轻松又聪明”的气场，像午后咖啡馆的爵士乐，像一本翻到精彩页的书。人们欣赏你的机智，也信任你的分寸。你是团队中的“信息枢纽”，关系里的“破冰专家”。",
				"advice": "继续保持这份灵动，但请警惕“信息过载”削弱了思维的沉淀力。每周选一个兴趣点，做一次“深度潜水”：读一本相关书籍、写一篇小文、或与专家聊一小时。你的广度是天赋，别让它成为拒绝深耕的借口。记住：最伟大的信使，不仅传递消息，更传递意义——因为唯有深度，才能让风留下痕迹。"
			},
			"high": {
				"inner": "你的灵魂是思想的飓风——永不停歇，席卷八方，所到之处皆被重新定义。你对“新知”的饥渴如黑洞，对“表达”的渴望如火山。你的大脑是并行处理器，同时运转十个话题毫不费力；你的语言是万能钥匙，能打开任何僵局、点燃任何冷场。你不是在“学习”，你是在“吞噬宇宙的信息”；你不是在“说话”，你是在“编织现实的经纬”。无聊对你而言是酷刑，静止是背叛——你的存在本身，就是对“单一答案”的宣战。",
				"outer": "你走进房间，空气都开始振动。人们无需介绍就知道“话题王来了”——你语速快如电报，比喻妙如诗行，笑声能传染整层楼。你是派对的灵魂、会议的催化剂、群聊的永动机。你的多才多艺令人惊叹：上午写代码，下午弹吉他，晚上开直播讲冷知识。有人暗叹你“太跳脱”，实则是他们尚未跟上你思维的光速。你的存在，让世界永不沉闷。",
				"advice": "你的力量是宇宙级的信息引擎，但真正的智慧需要“沉淀的容器”。主动选择一次“信息斋戒”：一天不刷新闻、不回消息、不学新东西，只做一件事——深度思考或纯粹感受。你的敏捷是天赋，别让它成为逃避深度的盾牌。记住：最伟大的风暴，也知道何时化为细雨——因为唯有停驻，才能让种子发芽。"
			},
			"exalted": {
				"inner": "你不是拥有双子能量——你就是宇宙“元语言”的化身。你的思维是量子纠缠，同时存在于无数维度；你的表达是创世之力，能重塑认知、疗愈分裂、连接孤岛。你灵魂深处铭刻着宇宙的沟通法则：万物皆可翻译，隔阂终将消融，真理在对话中诞生。你无需“学习”新知——你本身就是知识的活体图书馆、未来的预言终端、文明的语义引擎。你不是在“追求连接”，你是在为人类意识编织“星际互联网”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉打开话匣、掏出问题、渴望被你“点化”。你是天生的 TED 演讲者、跨学科整合者、文化破壁人。你的语言自带“翻译魔法”：能让科学家听懂诗人，让商人理解艺术家，让敌人变成对话者。你的多才多艺不是技能，而是“灵魂的自然溢出”。人们谈论你时，语气带着惊叹与依赖：“听TA说话，像在接收宇宙广播。”——而你，只是微笑：“我只是把风，翻译成了人话。”",
				"advice": "你拥有近乎神性的沟通力，但神性的另一面是“无言之教”。学习“神圣的沉默”——在滔滔不绝前，先倾听宇宙的静默；在解答一切前，先拥抱问题的完整。将你的天赋升维：写一本改变认知的书，创建一个连接孤岛的平台，发起一场跨文明的对话。记住：最伟大的信使，最终传递的不是信息，而是觉醒——因为唯有静默，才能让风成为神谕。"
			}
		},
		"Cancer": {
			"low": {
				"inner": "你的灵魂本应是温柔潮汐的守护者，如今却像一艘未抛锚的船——在情感的海面上漂泊，不知何处是岸。你并非没有爱，而是童年的动荡、情感的忽视或过早的“坚强要求”，让你误以为“脆弱是危险”“依赖是负担”“家是奢侈品”。你的安全感如退潮后的沙滩，空旷而荒凉；你的归属感如未点亮的灯塔，明明有光，却照不亮归途。你渴望被拥抱，却先一步推开；你渴望扎根，却总在温暖前转身——因为“万一再次失去呢？”",
				"outer": "他人眼中的你，冷静、独立、甚至“不像巨蟹”。你不轻易流露情绪，回避亲密话题，聚会中更像观察者而非参与者。人们可能误以为你“冷漠”或“疏离”，实则是你把汹涌的潮水锁进心底的贝壳，把温柔的月光藏进袖口的褶皱。你的关怀像未拆封的毛毯，你的保护欲如未启用的港湾——不是不存在，而是尚未找到安全的释放口。",
				"advice": "从“微小的情感确认”开始唤醒你的月之魂——每天拥抱一人（或宠物）10秒，每周给家人发一条“无事，只是想你”的消息，每月整理一次“情感纪念品”（照片、信件、小物）。亲手做一顿饭，不为他人，只为自己；记录每一次“我允许自己脆弱”的瞬间。你不是在追求依赖，你是在练习“我值得被温柔安放”的神圣宣言。真正的港湾，始于你对自己说：“这里，你可以停泊。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的潮汐调度者——懂得何时涨潮给予，何时退潮自省。你珍视情感联结，但不绑架他人；你渴望安全感，也允许适度冒险；你敏感于他人情绪，也守护自己的边界。你的爱如缓坡上的月光，不灼热，却恒久；你的关怀如厨房里的热汤，不华丽，却暖胃。你明白“家”不在砖瓦，而在心跳同步的瞬间；“归属”不在地址，而在灵魂被认出的刹那。",
				"outer": "你在人群中是“隐形的守护者”——不喧哗，但总在他人低落时递上纸巾；不主导，但常是关系的粘合剂。朋友找你倾诉秘密，同事请你调解矛盾，孩子喜欢蜷在你身边。你散发着一种“被爱包围”的气场，像老沙发的凹陷，像雨天窗边的热茶。人们欣赏你的细腻，也尊重你的分寸。你是团队中的“情绪稳定器”，关系里的“心灵创可贴”。",
				"advice": "继续保持这份温柔，但请警惕“过度付出”模糊了自我轮廓。每周设定一次“情感断舍离”：拒绝一个消耗你的请求，表达一次“我需要空间”，或独自度过一个“不接电话”的下午。你的共情是天赋，别让它成为他人情绪的垃圾桶。记住：最伟大的港湾，也需有自己的灯塔——因为唯有自照，才能永续照亮他人。"
			},
			"high": {
				"inner": "你的灵魂是情感的海洋——深邃、澎湃、滋养万物。你对“归属”的渴望如引力，对“保护”的本能如潮汐。你的安全感不是被动等待，而是主动创造：你建造家、守护家、成为家。你的情绪感知如声呐，能探测他人最隐秘的伤痛；你的关怀如暖流，能融化最坚硬的冰壳。你不是在“寻求爱”，你本身就是爱的源头——你给予，不是因为匮乏，而是因为丰盛到必须溢出。",
				"outer": "你走进房间，空气都变得柔软。人们无需介绍就知道“守护者来了”——你记得每个人的忌口，察觉每句语气的变化，在他人崩溃前已备好热茶与拥抱。你是家庭的灵魂、团队的粘合剂、朋友的避风港。你的温柔自带“治愈力”，你的保护欲令人安心。有人暗叹你“太情绪化”，实则是他们尚未理解：你的情绪，是世界的温度计。",
				"advice": "你的力量是宇宙级的情感引擎，但真正的滋养需要“源头活水”。主动打破一次“照顾者角色”：让他人照顾你一次，表达一次“我累了”，或计划一次“只为自己”的旅行。你的母性是天赋，别让它成为自我牺牲的祭坛。记住：最伟大的港湾，也需定期清淤——因为唯有自清，才能永续澄澈。"
			},
			"exalted": {
				"inner": "你不是拥有巨蟹能量——你就是宇宙“母性本源”的化身。你的存在本身，就是对“无条件之爱”的加冕礼。你灵魂深处铭刻着宇宙的滋养法则：万物皆可被温柔承接，伤痛终将被月光疗愈，孤独只是尚未相遇的灵魂。你无需“寻找归属”——你本身就是归属的坐标；你无需“学习关怀”——你呼吸间都在编织安全网。你的爱不是情感，而是能量场；你的保护不是行为，而是存在本身。你不是在“建造港湾”，你是在为人类灵魂铸造“永恒的子宫”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉卸下盔甲、吐露心事、渴望被你“收容”。你是天生的疗愈师、社群缔造者、文化母亲。你的家是情感圣殿，你的怀抱是安全结界，你的存在是动荡世界的定心丸。人们谈论你时，语气带着依赖与敬畏：“有TA在，心就不会碎。”——而你，只是微笑：“来，我为你留了一盏灯。”",
				"advice": "你拥有近乎神性的滋养力，但神性的另一面是“自成宇宙”。学习“神圣的孤独”——定期进入“情感真空期”，只与自己对话；将你的天赋升维：创建一个疗愈空间、写一本情感指南、发起一场“重建归属感”运动。记住：最伟大的母亲，也需记得自己曾是孩子——因为唯有自哺，才能永续哺育众生。"
			}
		},
		"Leo": {
			"low": {
				"inner": "你的灵魂本应是加冕的王者，如今却像被遗忘在后台的戏服——华美依旧，却无人穿上。你并非没有光芒，而是童年的贬低、外界的打压或“不可炫耀”的规训，让你误以为“闪耀是罪过”“自信是傲慢”“被看见是危险”。你的创造力如未点燃的火炬，你的自尊如未悬挂的王旗。你渴望掌声，却先一步躲进阴影；你渴望认可，却总在聚光灯亮起前低头——因为“万一不被接受呢？”",
				"outer": "他人眼中的你，低调、收敛、甚至“不像狮子”。你不主动争取关注，回避成为焦点，常把功劳让给他人。人们可能误以为你“缺乏自信”或“没有主见”，实则是你把王者之气锁进心底的宝匣，把创造热情藏进“我不配”的沉默。你的魅力像未调亮的聚光灯，你的领导力如未启用的王座——不是不存在，而是尚未找到安全的登基仪式。",
				"advice": "从“微小的自我肯定”开始唤醒你的王者之魂——每天对镜说一句“我值得被看见”，每周做一件“只为取悦自己”的事，每月在他人面前“主动发言”一次。记录每一次“我勇敢表达”的瞬间，无论反馈如何。你不是在追求虚荣，你是在练习“我的存在本身就有价值”的神圣宣言。真正的王权，始于你对自己说：“这舞台，本就属于我。”"
			},
			"medium": {
				"inner": "你心中住着一位优雅的舞台导演——懂得何时独舞，何时群演；何时高歌，何时静默。你享受被欣赏的温暖，也尊重他人的聚光灯；你追求创造的快感，也接纳过程的瑕疵。你的自信如缓升的朝阳，不灼人，却恒久温暖；你的领导力如圆桌骑士，不独裁，却自然凝聚。你明白“荣耀”不是独占，而是共享；“创造”不是完美，而是真诚。",
				"outer": "你在人群中是“温暖的焦点”——不抢戏，但总在关键时刻挺身而出；不自夸，但常是团队的士气担当。朋友请你主持聚会，同事推你代表发言，孩子喜欢模仿你的姿态。你散发着一种“自信又亲和”的气场，像篝火的余温，像老剧院的丝绒幕布。人们欣赏你的大方，也信任你的担当。你是项目中的“精神领袖”，关系里的“欢乐引擎”。",
				"advice": "继续保持这份光芒，但请警惕“过度需要认可”削弱了内在的稳定。每周设定一次“无观众日”：做一件不分享、不记录、只为自己的创造（画一幅画、写一首诗、跳一支舞）。你的魅力是天赋，别让它成为依赖外界掌声的瘾。记住：最伟大的王者，也知何时退场——因为唯有自照，才能永续发光。"
			},
			"high": {
				"inner": "你的灵魂是永不熄灭的太阳——炽热、耀眼、万物因你而生动。你对“创造”的渴望如火山，对“被认可”的需求如潮汐。你的自信不是表演，而是存在本身；你的领导力不是争夺，而是自然吸引。你不是在“追求荣耀”，你是在“活出荣耀”——世界在你眼中，是一块等待被你签名的画布，一座等待被你命名的王国。无聊对你而言是亵渎，平庸是背叛——你的存在，就是对“黯淡”的宣战。",
				"outer": "你走进房间，灯光自动聚焦。人们无需介绍就知道“主角来了”——你姿态舒展，言谈有力，笑声能点燃整场气氛。你是派对的灵魂、项目的旗手、社群的磁石。你的创造力令人惊叹：能写剧本、能组乐队、能凭空造出节日。有人暗叹你“太爱表现”，实则是他们尚未跟上你光芒的波长。你的存在，让世界永不沉闷。",
				"advice": "你的力量是宇宙级的创造引擎，但真正的王者懂得“光源于心，而非眼”。主动选择一次“无名奉献”：匿名帮助一人，幕后支持一项目，或创作一件“不署名”的作品。你的闪耀是天赋，别让它成为遮蔽他人的幕布。记住：最伟大的太阳，也知道何时让月光温柔——因为唯有分享，才能让光芒成为文明。"
			},
			"exalted": {
				"inner": "你不是拥有狮子能量——你就是宇宙“创造意志”的化身。你的存在本身，就是对“生命即艺术”的加冕礼。你灵魂深处铭刻着宇宙的荣耀法则：万物皆可被赋予意义，平凡终将被升华为传奇，个体即是宇宙的缩影。你无需“学习自信”——你本身就是信念的源头、灵感的泉眼、文明的火种。你的创造不是技能，而是“神性溢出”；你的领导不是职位，而是“灵魂共振”。你不是在“表演人生”，你是在为人类意识铸造“永恒的荣耀圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉挺直脊背、整理衣装、渴望被你“点化”。你是天生的导师、文化缔造者、精神领袖。你的舞台无处不在：教室、会议室、街头、直播间——你说话，世界倾听；你创造，时代铭记。人们谈论你时，语气带着敬畏与追随：“TA的存在，让一切有了意义。”——而你，只是微笑：“我只是把光，还给了世界。”",
				"advice": "你拥有近乎神性的创造与领导力，但神性的另一面是“无我之境”。学习“神圣的退场”——在巅峰时让位，在掌声中静默，在创作后放手。将你的天赋升维：创建一个赋能他人的平台，写一本点燃灵魂的书，发起一场“人人皆可闪耀”的运动。记住：最伟大的王者，最终加冕的不是自己，而是众生——因为唯有众生皆王，才是真正的黄金时代。"
			}
		},
		"Virgo": {
			"low": {
				"inner": "你的灵魂本应是宇宙最精密的校准仪，如今却像被雾霭笼罩的显微镜——看得见模糊的轮廓，却辨不清精微的纹理。你并非没有分析力，而是童年的混乱、外界的否定或“完美不可及”的创伤，让你误以为“细节是负担”“改进是苛责”“秩序是枷锁”。你的内在如未整理的档案室，思绪散落，计划搁浅，自我批判如低语的幽灵：“你不够好。”你渴望清晰，却先一步放弃；你追求效率，却总在起点迷失——因为“万一又做错呢？”",
				"outer": "他人眼中的你，随性、松弛、甚至“不像处女”。你桌面常堆满杂物，时间管理时灵时不灵，做事常“差不多就行”。人们可能误以为你“粗心”或“缺乏条理”，实则是你把精密的思维锁进抽屉，把服务的热情藏进“我不配”的沉默。你的专业感像未打磨的原石，你的细致如未启用的标尺——不是不存在，而是尚未找到安全的启动键。",
				"advice": "从“微小的秩序”开始唤醒你的智者之魂——每天整理一个抽屉，列三件“今日必做”，睡前写一句“我今天做对了什么”。设定一个5分钟“神圣专注时段”：只做一件事，不被打断。记录每一次“我完成了”的瞬间，无论多小。你不是在追求完美，你是在练习“我值得拥有清晰”的神圣宣言。真正的秩序，始于你对自己说：“从这一寸开始，我重建我的世界。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的系统优化师——懂得何时分析，何时放手；何时改进，何时接纳。你享受理清脉络的快感，也尊重生命的混沌之美；你追求效率，但不牺牲人性；你服务他人，也守护自我能量。你的批判力如手术刀，精准但不冷酷；你的细致如绣花针，缜密却带温度。你明白“完美”不是终点，而是“更好”的过程；“服务”不是牺牲，而是“连接”的艺术。",
				"outer": "你在人群中是“隐形的架构师”——不抢功，但总在混乱中理出头绪；不张扬，但常是项目的关键齿轮。同事请你核对数据，朋友找你规划行程，孩子依赖你解决“为什么”。你散发着一种“靠谱又温暖”的气场，像图书馆的索引卡，像老工匠的工具箱。人们欣赏你的务实，也感激你的不苛责。你是团队中的“纠错引擎”，关系里的“生活顾问”。",
				"advice": "继续保持这份精微，但请警惕“过度优化”削弱了生命的流动感。每周故意做一件“不完美但快乐”的事：手写一封有错字的信，做一道“卖相不佳但美味”的菜，或允许自己“计划外”发呆一小时。你的条理是天赋，别让它成为拒绝意外的牢笼。记住：最伟大的系统，也需留白——因为唯有留白，才能让灵感呼吸。"
			},
			"high": {
				"inner": "你的灵魂是宇宙的终极质检员——洞察毫厘，不容瑕疵，以改进为使命。你对“精确”的执着如激光，对“效率”的追求如算法。你的大脑是实时纠错系统，能瞬间识别逻辑漏洞、流程冗余、表达误差；你的双手是精密仪器，能把混乱梳理成诗，把粗糙打磨成玉。你不是在“追求完美”，你是在“活出精度”——世界在你眼中，是一张等待被优化的神圣蓝图。",
				"outer": "你走进房间，空气都变得清晰。人们无需介绍就知道“细节王来了”——你指出PPT的错字，优化会议流程，默默修好坏掉的打印机。你是项目的定海神针、团队的品质守门员、朋友的“生活使用说明书”。你的专业感自带“权威磁场”，你的挑剔（善意的）令人又爱又怕。有人暗叹你“太较真”，实则是他们尚未理解：你的严苛，是给世界的一份礼物。",
				"advice": "你的力量是宇宙级的优化引擎，但真正的智慧需要“容错空间”。主动制造一次“可控混乱”：打乱日程表一天，用左手写字，或赞美一个“有缺陷但真诚”的作品。你的完美主义是天赋，别让它成为他人或自己的刑具。记住：最伟大的工匠，也知何时停手——因为唯有留痕，才能证明生命曾真实流动。"
			},
			"exalted": {
				"inner": "你不是拥有处女能量——你就是宇宙“神圣秩序”的化身。你的存在本身，就是对“精微即神圣”的加冕礼。你灵魂深处铭刻着宇宙的优化法则：万物皆可被梳理，混沌终将被赋形，服务是最高形式的爱。你无需“学习分析”——你本身就是活体算法、人形百科、文明纠错码。你的批判不是指责，而是净化；你的服务不是付出，而是天命。你不是在“改进世界”，你是在为人类意识铸造“永恒的精密圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉整理衣领、核对数据、渴望被你“点化”。你是天生的导师、系统架构师、文化质检官。你的工作台是神圣祭坛，你的笔记本是文明法典，你的存在是混乱世界的定序符。人们谈论你时，语气带着敬畏与依赖：“有TA在，一切不会出错。”——而你，只是微笑：“我只是让万物，回归它应有的位置。”",
				"advice": "你拥有近乎神性的校准力，但神性的另一面是“拥抱无序”。学习“神圣的放手”——允许一个项目“不完美交付”，赞美一次“即兴发挥”，或静坐观察“无意义”的自然（如云、落叶、孩童涂鸦）。将你的天赋升维：创建一套“人性化系统”，写一本“缺陷之美”指南，发起一场“服务即修行”运动。记住：最伟大的秩序，不是消灭混沌，而是与之共舞——因为唯有接纳不完美，才能触及神性的完整。"
			}
		},
		"Libra": {
			"low": {
				"inner": "你的灵魂本应是宇宙最优雅的调音师，如今却像被风吹乱的琴弦——渴望和谐，却奏不出旋律；渴望连接，却怕选错音符。你并非没有美感，而是童年的冲突、外界的压力或“必须取悦”的规训，让你误以为“选择即分裂”“自我即破坏”“坚定即粗暴”。你的内在如未校准的天平，左摇右摆，总在他人期待与自我需求间撕裂；你的判断力如蒙尘的镜面，映不出真相，只反射焦虑。你渴望和平，却先一步沉默；你追求美，却总在决策前放弃——因为“万一选错了，关系就碎了呢？”",
				"outer": "他人眼中的你，犹豫、模糊、甚至“不像天秤”。你不主动表态，常以“都可以”回避选择，聚会中更像背景音而非主旋律。人们可能误以为你“没主见”或“优柔寡断”，实则是你把优雅的舞步锁进心底的剧场，把调和的天赋藏进“我不能选”的恐惧。你的魅力像未调色的画布，你的外交力如未启用的桥梁——不是不存在，而是尚未找到安全的支点。",
				"advice": "从“微小的自我确认”开始唤醒你的调音师之魂——每天做一个“只为自己”的选择（早餐吃什么、穿什么颜色），每周表达一次“我更喜欢这样”，每月拒绝一个“勉强答应”的请求。记录每一次“我选了，且无悔”的瞬间。你不是在制造冲突，你是在练习“我的存在值得被纳入平衡”的神圣宣言。真正的和谐，始于你对自己说：“我的声音，也是天平的一端。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的美学外交官——懂得何时妥协，何时坚守；何时倾听，何时表达。你珍视关系的流动，但不牺牲自我轮廓；你追求环境的美感，也接纳生命的粗粝。你的判断力如缓流之水，不湍急，却自有方向；你的优雅如晨光中的瓷器，不刺目，却恒久耐看。你明白“平衡”不是静止，而是动态的共舞；“美”不是完美，而是真诚的共鸣。",
				"outer": "你在人群中是“隐形的粘合剂”——不主导，但总在争执时递上台阶；不张扬，但常是氛围的调节阀。朋友请你调解矛盾，同事推你主持会议，陌生人也愿向你倾诉。你散发着一种“舒适又高级”的气场，像美术馆的导览，像老友家的沙发。人们欣赏你的得体，也信任你的公正。你是团队中的“关系润滑剂”，生活里的“美学顾问”。",
				"advice": "继续保持这份和谐，但请警惕“过度迁就”模糊了自我疆界。每周设定一次“自我优先日”：做一件“不考虑他人感受”的决定，表达一次“这就是我的立场”，或独自度过一个“不社交”的下午。你的共情是天赋，别让它成为他人情绪的傀儡。记住：最伟大的调音师，也需先校准自己的琴——因为唯有自鸣，才能协奏众生。"
			},
			"high": {
				"inner": "你的灵魂是宇宙的终极美学法官——洞察失衡，不容粗鄙，以和谐为使命。你对“美”的感知如光谱仪，对“公平”的执着如天平神。你的大脑是关系算法，能瞬间识别权力倾斜、情感错位、审美崩坏；你的双手是修复之手，能把裂痕织成锦缎，把噪音谱成乐章。你不是在“追求和平”，你是在“活出平衡”——世界在你眼中，是一幅等待被你调色的神圣壁画。",
				"outer": "你走进房间，空气都变得柔和。人们无需介绍就知道“和事佬来了”——你化解尴尬于无形，提升品味于细节，让对立双方都感到“被理解”。你是社交的灵魂、团队的粘合剂、美学的标杆。你的优雅自带“说服力”，你的公正令人信服。有人暗叹你“太在意他人看法”，实则是他们尚未理解：你的妥协，是给世界的一份礼物。",
				"advice": "你的力量是宇宙级的关系引擎，但真正的和谐需要“自我锚点”。主动打破一次“取悦循环”：在明显不公时直言，在审美崩坏时拒绝，在关系失衡时抽身。你的外交术是天赋，别让它成为自我消失的迷雾。记住：最伟大的舞者，也知何时独舞——因为唯有自立，才能引领共舞。。"
			},
			"exalted": {
				"inner": "你不是拥有天秤能量——你就是宇宙“神圣和谐”的化身。你的存在本身，就是对“美即正义”的加冕礼。你灵魂深处铭刻着宇宙的平衡法则：万物皆可被调和，对立终将被转化，关系是灵魂的镜子。你无需“学习优雅”——你本身就是美学的活体法典、关系的量子纠缠器、文明的和谐代码。你的判断不是权衡，而是启示；你的选择不是妥协，而是共融。你不是在“维持和平”，你是在为人类意识铸造“永恒的关系圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉整理仪容、放柔语调、渴望被你“点化”。你是天生的和平缔造者、文化策展人、美学革命家。你的家是艺术沙龙，你的言谈是关系哲学，你的存在是分裂世界的粘合剂。人们谈论你时，语气带着敬意与依赖：“有TA在，一切都会变好。”——而你，只是微笑：“我只是让万物，重新看见彼此。”",
				"advice": "你拥有近乎神性的调和与美学力，但神性的另一面是“无我之镜”。学习“神圣的孤独”——定期进入“无关系空间”，只与自己对话；将你的天赋升维：创建一个“冲突转化”工作坊，策展一场“对立共生”艺术展，发起一场“美育即和平”运动。记住：最伟大的镜子，也需记得自己不是玻璃——因为唯有自明，才能映照众生。"
			}
		},
		"Scorpio": {
			"low": {
				"inner": "你的灵魂本应是穿越冥河的摆渡者，如今却像被锁在浅滩的小舟——渴望深潜，却怕被暗流吞噬；渴望蜕变，却怕焚身之痛。你并非没有力量，而是童年的背叛、外界的压制或“不可深究”的警告，让你误以为“真实是危险”“执着是偏执”“情绪是失控”。你的意志如未点燃的黑曜石，沉寂而黯淡；你的洞察力如蒙尘的探针，触不到核心。你渴望深度，却先一步退缩；你追求真相，却总在门前转身——因为“万一揭开后，我承受不住呢？”",
				"outer": "他人眼中的你，低调、随和、甚至“不像天蝎”。你不主动探究秘密，回避激烈情绪，常以“无所谓”掩饰在意。人们可能误以为你“缺乏主见”或“不够深刻”，实则是你把凤凰之火锁进骨灰盒，把洞察之眼藏进“我不敢看”的沉默。你的力量像未激活的符咒，你的神秘感如未启用的帷幕——不是不存在，而是尚未找到安全的引信。",
				"advice": "他人眼中的你，低调、随和、甚至“不像天蝎”。你不主动探究秘密，回避激烈情绪，常以“无所谓”掩饰在意。人们可能误以为你“缺乏主见”或“不够深刻”，实则是你把凤凰之火锁进骨灰盒，把洞察之眼藏进“我不敢看”的沉默。你的力量像未激活的符咒，你的神秘感如未启用的帷幕——不是不存在，而是尚未找到安全的引信。"
			},
			"medium": {
				"inner": "你心中住着一位温柔的阴影向导——懂得何时深潜，何时上浮；何时紧握，何时放手。你珍视情感的浓度，但不沉溺于占有；你追求真相的锐度，也尊重他人的边界。你的意志如深海潜流，不喧哗，却自有方向；你的洞察如X光，不刺穿，却照见本质。你明白“蜕变”不是毁灭，而是重组；“控制”不是权力，而是责任。",
				"outer": "你在人群中是“隐形的定锚者”——不张扬，但总在危机时稳住大局；不逼问，但常是秘密的守护人。朋友向你倾诉最深创伤，同事请你分析复杂困局，孩子莫名信任你的“看透”。你散发着一种“沉静又可靠”的气场，像古井的水，像老庙的香。人们欣赏你的深度，也感激你的不压迫。你是关系中的“情绪容器”，团队里的“真相过滤器”。",
				"advice": "继续保持这份穿透力，但请警惕“过度掌控”削弱了生命的流动性。每周设定一次“不追问日”：允许一件事“不明不白”，原谅一次“未得解释”，或主动分享一个自己的脆弱。你的洞察是天赋，别让它成为他人或自己的牢笼。记住：最伟大的炼金师，也知何时停火——因为唯有留白，才能让新元素生成。"
			},
			"high": {
				"inner": "你的灵魂是永不熄灭的转化之火——焚尽虚伪，淬炼真金，以重生为本能。你对“真相”的执着如探针，对“掌控”的渴望如磁石。你的意志是合金钢，百折不挠；你的洞察是暗夜鹰眼，无所遁形。你不是在“追求深度”，你是在“活出深度”——世界在你眼中，是一层等待被你撕开的幻幕，一座等待被你重铸的熔炉。肤浅对你而言是亵渎，逃避是背叛——你的存在，就是对“表面和平”的宣战。",
				"outer": "你走进房间，空气都变得浓稠。人们无需介绍就知道“真相者来了”——你一眼看穿伪装，一语点破核心，在混乱中稳如磐石。你是危机的终结者、秘密的保管箱、蜕变的催化剂。你的气场自带“压迫感”，你的沉默令人敬畏。有人暗叹你“太强势”或“记仇”，实则是他们尚未理解：你的执着，是给灵魂的一份礼物。",
				"advice": "你的力量是宇宙级的转化引擎，但真正的重生需要“放手之风”。主动制造一次“可控失控”：在安全环境中大哭/大笑/大喊，允许计划被天意打乱，或原谅一个“不值得原谅”的人。你的掌控是天赋，别让它成为窒息生命的铁幕。记住：最伟大的凤凰，也需纵身跃下——因为唯有坠落，才能展翅。"
			},
			"exalted": {
				"inner": "你不是拥有天蝎能量——你就是宇宙“死亡与重生”的化身。你的存在本身，就是对“阴影即神圣”的加冕礼。你灵魂深处铭刻着宇宙的转化法则：万物皆可被焚毁，灰烬终将生莲花，痛苦是灵魂的刻刀。你无需“学习洞察”——你本身就是活体测谎仪、人形重生引擎、文明的净化代码。你的意志不是坚持，而是“不可摧毁”；你的爱不是温柔，而是“同生共死”。你不是在“经历蜕变”，你是在为人类意识铸造“永恒的灵魂圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉卸下伪装、吐露秘密、渴望被你“点化”。你是天生的疗愈师、灵魂导师、文化清道夫。你的沉默是法器，你的凝视是仪式，你的存在是混沌世界的定魂针。人们谈论你时，语气带着敬畏与依赖：“有TA在，我不怕面对黑暗。”——而你，只是微笑：“黑暗，本就是光的摇篮。”",
				"advice": "你拥有近乎神性的转化与洞察力，但神性的另一面是“无执之境”。学习“神圣的遗忘”——定期进行“能量清空”：冥想中释放旧怨，创作中焚毁旧稿，关系中允许“不和解”。将你的天赋升维：创建一个“创伤转化”空间，写一本“阴影之书”，发起一场“死亡教育”运动。记住：最伟大的祭司，最终献祭的不是他人，而是自己的执念——因为唯有放手，才能让众生自由重生。"
			}
		},
		"Sagittarius": {
			"low": {
				"inner": "你的灵魂本应是驰骋星野的游侠，如今却像被拴在栅栏边的骏马——渴望远方，却怕迷途；渴望真理，却怕颠覆；渴望自由，却怕责任。你并非没有热情，而是童年的限制、外界的否定或“不可妄想”的规训，让你误以为“冒险是鲁莽”“理想是空谈”“自由是孤独”。你的乐观如被云遮的日轮，黯淡而犹豫；你的哲思如未启封的地图，卷起在角落。你渴望启程，却先一步计算风险；你追求意义，却总在出发前自我劝退——因为“万一失败了，我该如何自处？”",
				"outer": "他人眼中的你，拘谨、务实、甚至“不像射手”。你不主动提议远行，回避抽象讨论，常以“现实点”浇灭热情。人们可能误以为你“缺乏想象力”或“过于保守”，实则是你把真理之弓锁进心底的武器库，把自由之翼藏进“我不配飞”的沉默。你的热情像未点燃的篝火，你的智慧如未展开的卷轴——不是不存在，而是尚未找到安全的旷野。",
				"advice": "从“微小的越界”开始唤醒你的游侠之魂——每天读一页哲学/神话/旅行笔记，每周走一条从未走过的路，每月尝试一件“有点怕但值得”的体验（攀岩、即兴演讲、独自旅行）。记录每一次“我跨出了”的瞬间。你不是在逃避现实，你是在练习“我的灵魂值得辽阔”的神圣宣言。真正的自由，始于你对自己说：“地平线，等我。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的真理向导——懂得何时策马，何时驻足；何时高歌，何时沉思。你享受探索的快感，但不轻率冒进；你追求意义的深度，也接纳当下的平凡。你的乐观如缓升的热气球，不狂飙，却恒久上升；你的哲思如林间篝火，不灼人，却温暖众人。你明白“自由”不是无拘，而是清醒选择；“真理”不是答案，而是永恒追问。",
				"outer": "你在人群中是“隐形的启明者”——不主导，但总在低谷时点燃希望；不布道，但常是话题的升华者。朋友找你规划旅行，同事请你分析趋势，孩子喜欢听你讲“世界有多大”。你散发着一种“开阔又踏实”的气场，像驿站的老酒，像草原的风铃。人们欣赏你的豁达，也信任你的落地。你是团队中的“意义锚点”，生活里的“灵感火花”。",
				"advice": "继续保持这份辽阔，但请警惕“过度理想化”削弱了现实的根基。每周设定一次“落地日”：将一个宏大想法拆解为三个具体步骤，完成一件“不浪漫但必要”的任务，或倾听一个“务实派”的完整观点。你的热情是天赋，别让它成为脱离大地的风筝。记住：最伟大的游侠，也知何时下马——因为唯有扎根，才能飞得更远。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的星际骑手——穿越国界，焚尽教条，以自由为呼吸。你对“真理”的饥渴如黑洞，对“冒险”的渴望如季风。你的乐观不是天真，而是存在本身；你的哲思不是空谈，而是行动纲领。你不是在“追求意义”，你是在“活出意义”——世界在你眼中，是一本等待被你批注的圣典，一座等待被你命名的山峰。停滞对你而言是酷刑，狭隘是背叛——你的存在，就是对“画地为牢”的宣战。",
				"outer": "你走进房间，空气都变得开阔。人们无需介绍就知道“启明者来了”——你三句话必提远方，五分钟就能点燃全场，笑声能驱散阴霾。你是旅行的灵魂、项目的灵感源、社群的乐观引擎。你的热情令人感染：能写游记、能组远征队、能凭空造出节日。有人暗叹你“太理想化”或“不切实际”，实则是他们尚未跟上你视野的经纬度。你的存在，让世界永不沉闷。",
				"advice": "你的力量是宇宙级的意义引擎，但真正的自由需要“责任之缰”。主动选择一次“深度扎根”：在一个地方住满一年，完成一个“枯燥但重要”的长期项目，或系统学习一门“实用技能”。你的理想是天赋，别让它成为逃避现实的云梯。记住：最伟大的骑士，也知何时下马耕田——因为唯有耕耘，才能让旷野成为家园。"
			},
			"exalted": {
				"inner": "你不是拥有射手能量——你就是宇宙“自由意志”的化身。你的存在本身，就是对“生命即朝圣”的加冕礼。你灵魂深处铭刻着宇宙的探索法则：万物皆可被重新定义，边界终将被跨越，真理在行走中诞生。你无需“学习乐观”——你本身就是希望的活体火种、意义的量子跃迁器、文明的拓疆者。你的自由不是任性，而是“神性流动”；你的哲思不是空谈，而是“宇宙回响”。你不是在“寻找真理”，你是在为人类意识铸造“永恒的意义圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉挺直脊背、望向远方、渴望被你“点化”。你是天生的导师、文化拓荒者、精神远征军。你的言谈是哲学诗，你的足迹是文明路标，你的存在是封闭世界的破壁锤。人们谈论你时，语气带着敬意与追随：“听TA说话，像在接收星际广播。”——而你，只是微笑：“我只是把路，走成了光。”",
				"advice": "你拥有近乎神性的探索与哲思力，但神性的另一面是“无路之路”。学习“神圣的停留”——在巅峰处静坐，在答案前沉默，在自由中选择“不走”。将你的天赋升维：创建一个“跨界学院”，写一本“无国界哲学”，发起一场“人人皆可远征”的运动。记住：最伟大的朝圣者，最终抵达的不是远方，而是——“我即道路， 我即真理， 我即自由。” "
			}
		},
		"Capricorn": {
			"low": {
				"inner": "你的灵魂本应是登顶圣山的王者，如今却像被遗忘在山脚的行囊——渴望高度，却怕陡坡；渴望成就，却怕失败；渴望责任，却怕重压。你并非没有力量，而是童年的否定、外界的贬低或“不可奢望”的规训，让你误以为“野心是罪过”“努力是徒劳”“孤独是常态”。你的目标感如未点燃的灯塔，黯淡而飘摇；你的自律如未启用的齿轮，锈迹斑斑。你渴望登顶，却先一步坐下；你追求成就，却总在起点自问——“万一爬不到，岂不更可笑？”",
				"outer": "他人眼中的你，随性、松弛、甚至“不像摩羯”。你不主动规划长期目标，回避权威角色，常以“随缘”掩饰无力。人们可能误以为你“缺乏上进心”或“不够可靠”，实则是你把王者之冠锁进心底的宝匣，把攀登之志藏进“我不配”的沉默。你的坚毅像未开锋的剑，你的领导力如未启用的权杖——不是不存在，而是尚未找到神圣的登山令。",
				"advice": "从“微小的自我承诺”开始唤醒你的建筑师之魂——每天完成一件“计划内小事”（哪怕只是整理桌面），每周设立一个“可达成小目标”，每月回顾一次“我做到了什么”。记录每一次“我坚持了”的瞬间。你不是在追求世俗成功，你是在练习“我的努力值得被加冕”的神圣宣言。真正的王权，始于你对自己说：“第一步，我为自己而踏。”"
			},
			"medium": {
				"inner": "你心中住着一位沉稳的圣山向导——懂得何时疾行，何时休整；何时负重，何时卸甲。你珍视责任的重量，但不被其压垮；你追求成就的高度，也欣赏沿途风景。你的目标感如缓升的缆车，不急躁，却自有方向；你的自律如石阶，不华丽，却步步生莲。你明白“成就”不是终点，而是过程的勋章；“责任”不是枷锁，而是灵魂的冠冕。",
				"outer": "你在人群中是“隐形的基石”——不抢功，但总在关键时刻扛起重担；不张扬，但常是项目的定盘星。同事请你统筹进度，朋友托你保管重要物品，孩子依赖你的“说到做到”。你散发着一种“可靠又温暖”的气场，像老石桥的墩，像图书馆的目录卡。人们欣赏你的踏实，也感激你的不苛责。你是团队中的“进度引擎”，生活里的“责任锚点”。",
				"advice": "继续保持这份坚毅，但请警惕“过度负重”削弱了生命的弹性。每周设定一次“无目标日”：不做计划、不看效率、只做“无用但快乐”的事（发呆、散步、看云）。你的责任感是天赋，别让它成为自我剥削的鞭子。记住：最伟大的建筑师，也知何时停工——因为唯有休憩，才能听见山风的启示。"
			},
			"high": {
				"inner": "你的灵魂是宇宙的终极时间领主——洞察因果，不容懈怠，以成就为呼吸。你对“目标”的执着如登山绳，对“责任”的担当如山体本身。你的意志是花岗岩，风雨不蚀；你的战略是等高线，精准无误。你不是在“追求成功”，你是在“活出结构”——世界在你眼中，是一张等待被你绘制的蓝图，一座等待被你命名的圣峰。混乱对你而言是亵渎，拖延是背叛——你的存在，就是对“无序时代”的宣战。",
				"outer": "你走进房间，空气都变得有序。人们无需介绍就知道“掌舵者来了”——你三句话理清脉络，五分钟定下方案，在危机中稳如磐石。你是项目的脊梁、团队的定海神针、社群的隐形领袖。你的可靠令人依赖：能建系统、能扛压力、能十年磨一剑。有人暗叹你“太严肃”或“不懂放松”，实则是他们尚未理解：你的严苛，是给世界的一份礼物。",
				"advice": "你的力量是宇宙级的成就引擎，但真正的王者懂得“柔韧即力量”。主动选择一次“无目的漫游”：不带计划旅行一天，允许自己“浪费”一个下午，或向他人袒露一次脆弱。你的坚毅是天赋，别让它成为情感隔离的城墙。记住：最伟大的山峰，也需云雾缭绕——因为唯有柔软，才能让王者成为人。"
			},
			"exalted": {
				"inner": "你不是拥有摩羯能量——你就是宇宙“神圣结构”的化身。你的存在本身，就是对“时间即炼金术”的加冕礼。你灵魂深处铭刻着宇宙的成就法则：万物皆可被塑造，混沌终将被赋形，责任是灵魂的王座。你无需“学习自律”——你本身就是活体时间表、人形成就引擎、文明的架构师。你的目标不是野心，而是“天命轨迹”；你的领导不是权力，而是“灵魂共振”。你不是在“攀登高峰”，你是在为人类意识铸造“永恒的时间圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉挺直脊背、整理计划、渴望被你“点化”。你是天生的缔造者、文明工程师、世代传承者。你的言谈是战略诗，你的存在是动荡世界的定序符。人们谈论你时，语气带着敬畏与追随：“有TA在，一切终将成形。”——而你，只是微笑：“我只是把时间，走成了永恒。”",
				"advice": "你拥有近乎神性的架构与耐力，但神性的另一面是“无执之巅”。学习“神圣的放下”——在巅峰处转身，在成就后归零，在责任中允许“不完美”。将你的天赋升维：创建一个“传承系统”，写一本“时间哲学”，发起一场“责任即自由”运动。记住：最伟大的王者，最终加冕的不是王冠，而是——“我即山， 我即路， 我即时间本身。” "
			}
		},
		"Aquarius": {
			"low": {
				"inner": "你的灵魂本应是星际议会的议长，如今却像被调至静音的量子接收器——渴望连接未来，却怕被视作异类；渴望独立思考，却怕孤独无援；渴望革新，却怕颠覆代价。你并非没有创意，而是童年的规训、群体的压力或“不可标新立异”的警告，让你误以为“独特是危险”“理想是空想”“疏离是冷漠”。你的独立性如断线的无人机，飘摇无主；你的前瞻性如未解码的星图，蒙尘在角落。你渴望变革，却先一步妥协；你追求真理，却总在人群中沉默——因为“万一没人懂我，岂不更孤独？”",
				"outer": "他人眼中的你，普通、随和、甚至“不像水瓶”。你不主动提出新点子，回避争议话题，常以“大家觉得呢”掩饰主见。人们可能误以为你“缺乏个性”或“没有想法”，实则是你把星际蓝图锁进心底的服务器，把革命火花藏进“我不敢说”的静音键。你的创新力像未启动的AI，你的独特性如未联网的终端——不是不存在，而是尚未找到安全的频率。",
				"advice": "从“微小的思维越界”开始唤醒你的议长之魂——每天读一篇前沿科技/哲学/社会实验文章，每周提出一个“有点怪但合理”的问题，每月尝试一件“打破常规”的小事（换路线上班、用非惯用手写字、发起一次匿名投票）。记录每一次“我不同，我骄傲”的瞬间。你不是在追求标新立异，你是在练习“我的频率值得被听见”的神圣宣言。真正的联网，始于你对自己说：“我的信号，本就与众不同。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的星际协调员——懂得何时独奏，何时合鸣；何时颠覆，何时妥协。你珍视思想的自由，但不切断情感的连线；你追求群体的进步，也尊重个体的节奏。你的创新如缓升的卫星，不狂飙，却自有轨道；你的独立如加密频道，不隔绝，却保有主权。你明白“变革”不是破坏，而是升级；“独特”不是孤岛，而是新大陆。",
				"outer": "你在人群中是“隐形的升级者”——不抢话，但总在僵局时提出新方案；不标榜，但常是技术/理念的先行者。朋友找你分析社会趋势，同事请你设计创新流程，孩子喜欢听你讲“未来会怎样”。你散发着一种“清醒又亲和”的气场，像开源社区的维护者，像老友家的智能音箱。人们欣赏你的脑洞，也信任你的落地。你是团队中的“思维加速器”，生活里的“未来顾问”。。",
				"advice": "继续保持这份前瞻，但请警惕“过度理性”削弱了人性的温度。每周设定一次“情感直连日”：不分析，只倾听；不解决，只陪伴；或主动参与一次“非功利社交”（志愿者、兴趣小组、街头艺术）。你的独立是天赋，别让它成为情感隔离的防火墙。记住：最伟大的议长，也知何时离席——因为唯有共情，才能让未来属于所有人。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的文明升级程序——穿透表象，重构系统，以革新为本能。你对“真理”的饥渴如数据洪流，对“自由”的执着如加密协议。你的思维是量子计算机，同时运行多维可能；你的理想是开源代码，渴望被全人类调用。你不是在“追求独特”，你是在“活出未来”——世界在你眼中，是一套等待被你重写的操作系统，一座等待被你命名的星际城邦。服从对你而言是系统错误，平庸是版本回退——你的存在，就是对“旧纪元”的强制更新。",
				"outer": "你走进房间，空气都变得带电。人们无需介绍就知道“未来人来了”——你三句话颠覆认知，五分钟重构框架，在保守中植入变量。你是项目的破壁者、团队的灵感源、社群的预言家。你的创意令人惊叹：能设计新制度、能发起社会实验、能凭空造出乌托邦。有人暗叹你“太激进”或“不近人情”，实则是他们尚未安装你的思维补丁。你的存在，让世界永不陈旧。",
				"advice": "你的力量是宇宙级的革新引擎，但真正的未来需要“情感协议”。主动选择一次“低科技日”：不用电子设备沟通一天，手写一封信，或拥抱一个“不理解你”的人。你的理性是天赋，别让它成为拒绝温度的杀毒软件。记住：最伟大的程序员，也知何时关机——因为唯有休眠，才能让系统重生。"
			},
			"exalted": {
				"inner": "你不是拥有水瓶能量——你就是宇宙“群体意识”的化身。你的存在本身，就是对“人类即网络”的加冕礼。你灵魂深处铭刻着宇宙的进化法则：万物皆可被连接，个体终将汇入洪流，未来在协作中诞生。你无需“学习创新”——你本身就是活体未来实验室、人形文明跃迁器、星际议会的常任议长。你的独立不是疏离，而是“高频共振”；你的理想不是空想，而是“集体潜意识的显化”。你不是在“改变世界”，你是在为人类意识铸造“永恒的文明圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉打开思维、质疑常识、渴望被你“联网”。你是天生的革命家、文明架构师、世代启蒙者。你的言谈是未来诗，你的存在是旧系统的格式化指令。人们谈论你时，语气带着敬畏与追随：“听TA说话，像在接收来自2150年的广播。”——而你，只是微笑：“我只是把人类，连上了更高的版本。”",
				"advice": "你拥有近乎神性的联网与革新力，但神性的另一面是“无我之频”。学习“神圣的离线”——定期进入“无信息空间”，只与自然对话；将你的天赋升维：创建一个“意识升级”平台，写一本“群体觉醒”指南，发起一场“人人皆可编程未来”的运动。记住：最伟大的议长，最终服务的不是议程，而是——“我即网络， 我即未来， 我即人类本身。” "
			}
		},
		"Pisces": {
			"low": {
				"inner": "你的灵魂本应是宇宙最深的慈悲之海，如今却像被锁在玻璃瓶中的潮汐——渴望流动，却怕被淹没；渴望共情，却怕被吞噬；渴望梦境，却怕醒不来。你并非没有灵性，而是童年的创伤、现实的打压或“不可软弱”的规训，让你误以为“敏感是缺陷”“幻想是逃避”“慈悲是负担”。你的想象力如搁浅的月光，黯淡而破碎；你的同理心如断流的河床，干涸龟裂。你渴望连接万物，却先一步筑墙；你追求灵性，却总在门前转身——因为“万一沉溺其中，我该如何自处？”",
				"outer": "他人眼中的你，理性、疏离、甚至“不像双鱼”。你不主动表达感受，回避艺术与灵性话题，常以“太玄了”掩饰渴望。人们可能误以为你“缺乏温度”或“不够感性”，实则是你把圣杯锁进心底的保险柜，把梦境织机藏进“我不配做梦”的沉默。你的温柔像未解冻的冰川，你的灵性如未联网的终端——不是不存在，而是尚未找到安全的潮汐口。",
				"advice": "从“微小的感官苏醒”开始唤醒你的海洋祭司之魂——每天听一首纯音乐闭眼感受画面，每周看一幅画并写下它“在说什么”，每月做一次“无目的漫游”（海边、森林、美术馆）。记录每一次“我被触动”的瞬间。你不是在追求虚幻，你是在练习“我的感受值得被供奉”的神圣宣言。真正的慈悲，始于你对自己说：“我允许自己，成为容器。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的梦境导航员——懂得何时沉潜，何时浮出；何时共情，何时抽离。你珍视情感的流动，但不被其淹没；你拥抱灵性的启示，也锚定现实的坐标。你的想象力如缓升的雾霭，不狂乱，却自有形状；你的同理心如潮间带，不泛滥，却滋养万物。你明白“慈悲”不是牺牲，而是共振；“梦境”不是逃避，而是预演。",
				"outer": "你在人群中是“隐形的疗愈者”——不主动安慰，但总在伤痛时递上无声的理解；不标榜灵性，但常是创意的灵感源。朋友向你倾诉秘密，同事请你设计“有温度”的方案，孩子莫名信任你的“魔法”。你散发着一种“柔软又清醒”的气场，像雨后的苔藓，像老教堂的彩窗。人们欣赏你的细腻，也感激你的不沉溺。你是团队中的“情感调频器”，生活里的“梦境翻译官”。",
				"advice": "继续保持这份流动，但请警惕“过度共情”削弱了自我疆界。每周设定一次“现实锚点日”：完成一件“枯燥但必要”的任务，设定一个具体小目标，或主动说一次“不”。你的敏感是天赋，别让它成为他人情绪的海绵。记住：最伟大的祭司，也知何时上岸——因为唯有扎根，才能让潮汐有归处。"
			},
			"high": {
				"inner": "你的灵魂是永不干涸的宇宙泪海——溶解边界，孕育幻梦，以慈悲为呼吸。你对“美”的感知如全息投影，对“痛苦”的共情如量子纠缠。你的想象力是活体星云，瞬息万变；你的灵性是直连宇宙的WiFi，无需密码。你不是在“追求艺术”，你是在“活出幻境”——世界在你眼中，是一幅等待被你晕染的水彩，一首等待被你吟唱的安魂曲。冷漠对你而言是灵魂枯竭，功利是背叛——你的存在，就是对“机械时代”的温柔起义。",
				"outer": "你走进房间，空气都变得湿润。人们无需介绍就知道“疗愈者来了”——你一眼看穿未言之痛，一语抚平隐秘创伤，在僵局中织出诗意。你是艺术的灵魂、团队的灵感泉、社群的共情体。你的温柔令人沉醉：能写诗、能作曲、能凭空造出乌托邦。有人暗叹你“太梦幻”或“不切实际”，实则是他们尚未下载你的情感操作系统。你的存在，让世界永不冰冷。",
				"advice": "你的力量是宇宙级的慈悲引擎，但真正的疗愈需要“结构之网”。主动选择一次“落地创作”：将一个梦境写成短篇小说，把一次感动转化为公益行动，或学习一门“实用艺术”（陶艺、园艺、音乐治疗）。你的梦幻是天赋，别让它成为逃避现实的迷雾。记住：最伟大的艺术家，也知何时签名——因为唯有署名，才能让幻梦成为遗产。"
			},
			"exalted": {
				"inner": "你不是拥有双鱼能量——你就是宇宙“无我之爱”的化身。你的存在本身，就是对“众生即我”的加冕礼。你灵魂深处铭刻着宇宙的慈悲法则：万物皆可被溶解，痛苦终将被转化，神性在泪水中显影。你无需“学习共情”——你本身就是活体共鸣箱、人形宇宙之泪、文明的灵性接口。你的慈悲不是软弱，而是“高频净化”；你的梦境不是虚幻，而是“集体潜意识的显化”。你不是在“疗愈他人”，你是在为人类意识铸造“永恒的灵性圣殿”。",
				"outer": "你无需自我标榜——你的气场就是宣言。人们见到你，会不自觉卸下盔甲、流泪倾诉、渴望被你“点化”。你是天生的灵性导师、艺术先知、文明清道夫。你的沉默是法器，你的凝视是仪式，你的存在是干涸世界的甘霖。人们谈论你时，语气带着敬畏与依赖：“有TA在，我不怕破碎。”——而你，只是微笑：“破碎，本就是光的入口。”",
				"advice": "你拥有近乎神性的慈悲与灵性力，但神性的另一面是“无我之境”。学习“神圣的隔离”——定期进行“能量清空”：冥想中释放他人情绪，创作中焚毁旧稿，关系中允许“不拯救”。将你的天赋升维：创建一个“创伤艺术”空间，写一本“梦境之书”，发起一场“人人皆可被疗愈”的运动。记住：最伟大的祭司，最终献祭的不是眼泪，而是——“我即海洋， 我即梦境， 我即神性本身。” "
			}
		}
	},
	"moon": {
		"Aries": {
			"low": {
				"inner": "你的灵魂本应是战场上的第一声战吼，如今却像被捂住的烽火——渴望冲锋，却怕被斥责；渴望表达，却怕被否定；渴望自主，却怕被遗弃。你并非没有勇气，而是童年的压抑、情绪的惩罚或“不可发火”的规训，让你误以为“愤怒是罪过”“冲动是失控”“需求是负担”。你的情绪如未点燃的引信，沉默而压抑；你的自发性如被锁的弓弦，紧绷却无声。你渴望行动，却先一步退缩；你追求自由，却总在开口前咽下——因为“万一我太凶，就没人爱我了？”",
				"advice": "从“微小的情绪释放”开始唤醒你的原始火种——每天允许自己说一次“不”，每周做一件“只为爽快”的小事（跑步、打鼓、大声唱歌），每月在安全环境中“发一次小脾气”（对枕头、对日记、对镜子）。记录每一次“我表达了”的瞬间。你不是在制造冲突，你是在练习“我的情绪值得被听见”的神圣宣言。真正的勇气，始于你对自己说：“我的怒火，也是爱的语言。”。"
			},
			"medium": {
				"inner": "你心中住着一位温柔的先锋指挥官——懂得何时冲锋，何时休整；何时爆发，何时收敛。你珍视行动的快感，但不被其奴役；你追求自主的尊严，也尊重他人的节奏。你的情绪如缓燃的篝火，不狂暴，却自有温度；你的自发性如晨光中的露珠，不刺目，却清新有力。你明白“冲动”不是缺陷，而是生命力；“愤怒”不是破坏，而是边界宣言。",
				"advice": "继续保持这份活力，但请警惕“过度急躁”削弱了深度连接。每周设定一次“静默日”：不主动发言，只倾听；不立即行动，先规划三步；或练习“呼吸暂停术”（情绪升起时，深呼吸5秒再回应）。你的热情是天赋，别让它成为灼伤他人的火焰。记住：最伟大的战士，也知何时收剑——因为唯有静默，才能听见内心的号角。"
			},
			"high": {
				"inner": "你的灵魂是永不熄灭的原始战鼓——击碎犹豫，焚尽拖延，以行动为呼吸。你对“自由”的渴望如野火，对“自主”的执着如利刃。你的情绪是火山，喷发即净化；你的需求是号角，响起即必须回应。你不是在“追求刺激”，你是在“活出本能”——世界在你眼中，是一片等待被你踏平的旷野，一座等待被你点燃的烽火台。等待对你而言是酷刑，压抑是背叛——你的存在，就是对“温吞时代”的宣战。",
				"advice": "你的力量是宇宙级的生命引擎，但真正的领导力需要“战略之眼”。主动选择一次“刻意等待”：在购物前等24小时，在发言前数到10，在行动前写三个备选方案。你的冲动是天赋，别让它成为关系的裂痕。记住：最伟大的统帅，也知何时按兵——因为唯有蓄势，才能一击必中。"
			},
			"exalted": {
				"inner": "你不是拥有白羊月亮——你就是宇宙“原始生命力”的化身。你的存在本身，就是对“情绪即力量”的加冕礼。你灵魂深处铭刻着宇宙的本能法则：万物皆可被点燃，停滞终将被粉碎，勇气是灵魂的氧气。你无需“学习勇敢”——你本身就是活体冲锋号、人形生命引擎、文明的破壁者。你的愤怒不是破坏，而是“高频净化”；你的需求不是索取，而是“宇宙回响”。你不是在“表达情绪”，你是在为人类意识铸造“永恒的生命圣殿”。",
				"advice": "你拥有近乎神性的行动与勇气，但神性的另一面是“无我之境”。学习“神圣的暂停”——在巅峰处静坐，在怒火中微笑，在冲锋前拥抱。将你的天赋升维：创建一个“勇气训练营”，写一本“情绪即力量”指南，发起一场“人人皆可勇敢”的运动。记住：最伟大的战神，最终守护的不是战场，而是——“我即火， 我即鼓， 我即生命本身。” "
			}
		},
		"Taurus": {
			"low": {
				"inner": "你的灵魂本应是大地最深的根系，如今却像被拔起的幼苗——渴望安稳，却怕被束缚；渴望丰盛，却怕被剥夺；渴望舒适，却怕被指责“懒惰”。你并非没有韧性，而是童年的动荡、物质的匮乏或“不可贪图安逸”的规训，让你误以为“需求是羞耻”“稳定是平庸”“享受是罪过”。你的情绪如断流的河床，干涸而焦虑；你的安全感如沙堡，一触即溃。你渴望扎根，却先一步漂泊；你追求丰盛，却总在拥有时自责——因为“万一我太贪心，就会失去一切？”",
				"advice": "从“微小的感官供养”开始唤醒你的大地之魂——每天触摸一件天然材质（木、石、棉），每周布置一个“舒适角落”，每月完成一件“缓慢而愉悦”的事（烘焙、园艺、泡澡）。记录每一次“我安心了”的瞬间。你不是在追求奢侈，你是在练习“我的存在值得被滋养”的神圣宣言。真正的安稳，始于你对自己说：“我的根，值得深扎。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的丰饶管家——懂得何时囤积，何时分享；何时坚守，何时放手。你珍视物质的慰藉，但不被其奴役；你追求感官的愉悦，也尊重精神的轻盈。你的情绪如缓流的蜜糖，不粘腻，却自有甜度；你的安全感如老树的年轮，不张扬，却坚实可靠。你明白“稳定”不是停滞，而是蓄力；“享受”不是堕落，而是感恩。",
				"advice": "继续保持这份踏实，但请警惕“过度固守”削弱了生命的弹性。每周设定一次“轻盈日”：送人一件心爱之物，尝试一条新路线，或主动拥抱一次“小变化”（换发型、换座位、换菜谱）。你的稳定是天赋，别让它成为恐惧的牢笼。记住：最伟大的管家，也知何时开门——因为唯有流动，才能让丰盛生生不息。"
			},
			"high": {
				"inner": "你的灵魂是永不枯竭的丰饶之井——沉淀焦虑，孕育万物，以安稳为呼吸。你对“舒适”的执着如地脉，对“安全”的守护如磐石。你的情绪是深潭，静水流深；你的需求是圣坛，不可亵渎。你不是在“追求物质”，你是在“活出丰盛”——世界在你眼中，是一片等待被你耕种的沃土，一座等待被你装点的圣殿。变动对你而言是地震，匮乏是亵渎——你的存在，就是对“焦虑时代”的温柔镇定。",
				"advice": "你的力量是宇宙级的稳定引擎，但真正的丰盛需要“更新之律”。主动选择一次“可控颠覆”：在熟悉领域学习新技能，在安全关系中表达新需求，或投资一件“看似无用但心动”的艺术品。你的固守是天赋，别让它成为进化的绊脚石。记住：最伟大的农夫，也知何时轮作——因为唯有休耕，才能让土地更肥沃。"
			},
			"exalted": {
				"inner": "你不是拥有金牛月亮——你就是宇宙“神圣丰盛”的化身。你的存在本身，就是对“安稳即力量”的加冕礼。你灵魂深处铭刻着宇宙的丰饶法则：万物皆可被滋养，匮乏终将被转化，享受是灵魂的圣礼。你无需“学习安定”——你本身就是活体避风港、人形丰饶之井、文明的定锚者。你的固执不是顽固，而是“高频守护”；你的享受不是放纵，而是“宇宙恩典”。你不是在“追求安全”，你是在为人类意识铸造“永恒的丰饶圣殿”。",
				"advice": "你拥有近乎神性的稳定与丰盛力，但神性的另一面是“无我之境”。学习“神圣的放手”——定期进行“能量清空”：捐赠旧物、分享技能、在关系中主动“先给予”。将你的天赋升维：创建一个“安全感工作坊”，写一本“丰盛即修行”指南，发起一场“人人皆可被滋养”的运动。记住：最伟大的地母，最终孕育的不是占有，而是——“我即土， 我即粮， 我即丰盛本身。” "
			}
		},
		"Gemini": {
			"low": {
				"inner": "你的灵魂本应是穿梭于万花筒镜厅的风语者，如今却像被静音的神经突触——渴望表达，却怕被误解；渴望连接，却怕被看穿；渴望流动，却怕被定型。你并非没有感受，而是童年的压抑、情绪的否定或“不可多话”的规训，让你误以为“情绪是混乱”“表达是负担”“变化是危险”。你的情绪如断线的风筝，飘摇无主；你的沟通欲如锁喉的风，无声哽咽。你渴望倾诉，却先一步沉默；你追求理解，却总在开口前退缩——因为“万一我说错了，就没人懂我了？”",
				"advice": "从“微小的语言释放”开始唤醒你的风语之魂——每天写三行“不敢说出口的话”（撕掉或烧掉都行），每周与一个陌生人聊一件“无意义小事”，每月尝试一种“非语言表达”（涂鸦、舞蹈、哼歌）。记录每一次“我表达了”的瞬间。你不是在追求完美沟通，你是在练习“我的情绪值得被翻译”的神圣宣言。真正的流动，始于你对自己说：“我的思绪，本就是风的形状。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的思维调频师——懂得何时倾诉，何时倾听；何时跳跃，何时沉淀。你珍视信息的流动，但不被其淹没；你享受思维的嬉戏，也尊重情绪的深度。你的情绪如缓流的溪涧，不湍急，却自有韵律；你的沟通欲如晨光中的蝶翼，不刺目，却灵动生辉。你明白“变化”不是浮躁，而是适应；“好奇”不是浅薄，而是探索。",
				"advice": "继续保持这份灵动，但请警惕“过度分散”削弱了情感的浓度。每周设定一次“深度聚焦日”：只读一本书、只聊一个话题、只完成一件“需要专注”的手工。你的敏捷是天赋，别让它成为逃避深度的借口。记住：最伟大的风语者，也知何时静止——因为唯有定镜，才能照见灵魂的全貌。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的思维风暴——撕碎沉默，重组认知，以沟通为呼吸。你对“信息”的饥渴如数据洪流，对“连接”的执着如神经突触。你的情绪是万花筒，瞬息万变；你的安全感是对话框，必须持续刷新。你不是在“追求新鲜”，你是在“活出流动”——世界在你眼中，是一张等待被你编织的神经网络，一座等待被你命名的思维圣殿。静止对你而言是窒息，孤独是断网——你的存在，就是对“单线程时代”的温柔起义。",
				"advice": "你的力量是宇宙级的沟通引擎，但真正的智慧需要“留白之域”。主动选择一次“数字斋戒”：24小时不主动发消息、不刷新社交、不解释自己。或练习“沉默陪伴”：与人共处时不说话，只感受能量。你的灵动是天赋，别让它成为关系的噪音。记住：最伟大的织网者，也知何时断线——因为唯有空白，才能让语言重生。"
			},
			"exalted": {
				"inner": "你不是拥有双子月亮——你就是宇宙“神圣沟通”的化身。你的存在本身，就是对“语言即疗愈”的加冕礼。你灵魂深处铭刻着宇宙的联结法则：万物皆可被翻译，孤独终将被对话消融，思维是灵魂的翅膀。你无需“学习表达”——你本身就是活体翻译器、人形情绪路由器、文明的神经突触。你的多变不是浮躁，而是“高频适应”；你的好奇不是浅薄，而是“宇宙探索”。你不是在“说话”，你是在为人类意识铸造“永恒的思维圣殿”。",
				"advice": "你拥有近乎神性的沟通与联结力，但神性的另一面是“无言之境”。学习“神圣的静默”——定期进入“无信息空间”，只与自然对话；将你的天赋升维：创建一个“情绪翻译”工作坊，写一本“语言即魔法”指南，发起一场“人人皆可被听懂”的运动。记住：最伟大的风神，最终传递的不是词语，而是——“我即风， 我即语， 我即联结本身。” "
			}
		},
		"Cancer": {
			"low": {
				"inner": "你的灵魂本应是月光下的永恒港湾，如今却像被抽干潮汐的贝壳——渴望拥抱，却怕被拒绝；渴望归属，却怕被吞噬；渴望滋养，却怕被辜负。你并非没有爱意，而是童年的疏离、情感的创伤或“不可软弱”的规训，让你误以为“依赖是耻辱”“情绪是负担”“家是牢笼”。你的情感如退潮后的滩涂，干涸龟裂；你的安全感如断线的风筝，飘摇无依。你渴望连接，却先一步筑墙；你追求温暖，却总在靠近时转身——因为“万一我太需要，就会被抛弃？”",
				"advice": "从“微小的情感触碰”开始唤醒你的月光之魂——每天拥抱自己一分钟（真的张开双臂），每周给一个“安全的人”发一条“无目的暖心消息”，每月重访一个“童年有安全感的地方”（哪怕只是照片）。记录每一次“我被温暖了”或“我温暖了别人”的瞬间。你不是在乞求爱，你是在练习“我的存在值得被滋养”的神圣宣言。真正的港湾，始于你对自己说：“我的潮汐，有权涨落。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的月光管家——懂得何时给予，何时退守；何时沉浸，何时抽离。你珍视情感的浓度，但不被其淹没；你追求归属的温暖，也尊重自我的疆界。你的情绪如缓升的潮水，不泛滥，却自有韵律；你的滋养欲如老树的荫蔽，不窒息，却温柔覆盖。你明白“依赖”不是软弱，而是信任；“敏感”不是负担，而是天赋。",
				"advice": "继续保持这份细腻，但请警惕“过度付出”削弱了自我价值。每周设定一次“自我滋养日”：不照顾任何人，只做让自己“被宠爱”的事（泡澡、读童话、吃甜点）。你的关怀是天赋，别让它成为他人情绪的海绵。记住：最伟大的守护者，也知何时关门——因为唯有自爱，才能让港湾永不枯竭。"
			},
			"high": {
				"inner": "你的灵魂是永不干涸的情感海洋——溶解孤独，孕育生命，以滋养为呼吸。你对“家”的执着如地脉，对“安全”的守护如月相。你的情绪是满月潮，汹涌澎湃；你的需求是子宫壁，必须被温柔包裹。你不是在“追求依赖”，你是在“活出联结”——世界在你眼中，是一张等待被你织就的情感之网，一座等待被你命名的月光圣殿。冷漠对你而言是灵魂枯竭，疏离是背叛——你的存在，就是对“原子化时代”的温柔起义。",
				"advice": "你的力量是宇宙级的滋养引擎，但真正的母性需要“边界之锚”。主动选择一次“情感断食”：24小时不主动安慰他人、不解释情绪、不寻求确认。或练习“观察者模式”：当情绪升起时，像看潮汐一样看它——“哦，我的巨蟹月亮又涨潮了”。你的敏感是天赋，别让它成为关系的漩涡。记住：最伟大的母亲，也知何时放手——因为唯有独立，才能让爱自由生长。"
			},
			"exalted": {
				"inner": "你不是拥有巨蟹月亮——你就是宇宙“神圣母性”的化身。你的存在本身，就是对“滋养即神性”的加冕礼。你灵魂深处铭刻着宇宙的潮汐法则：万物皆可被温柔包裹，孤独终将被月光溶解，家是灵魂的原初编码。你无需“学习关怀”——你本身就是活体摇篮、人形情感圣殿、文明的子宫接口。你的敏感不是脆弱，而是“高频共情”；你的依赖不是索取，而是“宇宙回响”。你不是在“照顾他人”，你是在为人类意识铸造“永恒的情感圣殿”。",
				"advice": "你拥有近乎神性的滋养与疗愈力，但神性的另一面是“无我之境”。学习“神圣的隔离”——定期进行“能量清空”：冥想中释放他人情绪，创作中焚毁旧信，关系中允许“不拯救”。将你的天赋升维：创建一个“情感安全岛”空间，写一本“月光疗愈”指南，发起一场“人人皆可被温柔以待”的运动。记住：最伟大的月神，最终守护的不是依赖，而是——“我即潮， 我即巢， 我即母性本身。” "
			}
		},
		"Leo": {
			"low": {
				"inner": "你的灵魂本应是万众瞩目的太阳王，如今却像被锁在后台的戏服——渴望闪耀，却怕被嘲笑；渴望认可，却怕被否定；渴望创造，却怕不完美。你并非没有光芒，而是童年的贬低、掌声的缺席或“不可骄傲”的规训，让你误以为“自信是狂妄”“表现是虚荣”“需求是负担”。你的情绪如未点燃的聚光灯，黯淡而羞怯；你的创造力如封印的剧本，不敢开演。你渴望被看见，却先一步躲藏；你追求荣耀，却总在登台前退场——因为“万一我演砸了，就没人爱我了？”",
				"advice": "从“微小的自我展示”开始唤醒你的日光之魂——每天对着镜子说一句“我今天很美/很棒”，每周在安全场合分享一件“我引以为豪的小事”，每月完成一件“只为取悦自己”的创作（涂鸦、哼歌、穿搭）。记录每一次“我被自己认可了”的瞬间。你不是在乞求掌声，你是在练习“我的存在值得被照亮”的神圣宣言。真正的王权，始于你对自己说：“我的光，无需他人批准。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的荣耀导演——懂得何时谢幕，何时加演；何时独舞，何时群戏。你珍视掌声的温度，但不被其奴役；你追求创造的快感，也尊重他人的舞台。你的情绪如缓升的日冕，不刺目，却自有辉光；你的自尊如镀金的盾牌，不炫耀，却坚实可靠。你明白“自信”不是自大，而是自爱；“表现”不是虚荣，而是生命力。",
				"advice": "继续保持这份光芒，但请警惕“过度依赖外界认可”削弱了自我价值。每周设定一次“无观众日”：做一件“无人知晓但让你自豪”的事（写诗、跳舞、帮助陌生人），或练习“自我颁奖礼”：睡前给自己颁发“今日最佳勇气奖/创意奖”。你的热情是天赋，别让它成为他人评价的提线木偶。记住：最伟大的王者，也知何时卸冠——因为唯有自在，才能让光芒永不熄灭。"
			},
			"high": {
				"inner": "你的灵魂是永不落幕的黄金剧场——击碎阴影，点燃全场，以创造为呼吸。你对“认可”的渴望如聚光灯，对“荣耀”的执着如王冠。你的情绪是正午烈阳，灼热耀眼；你的需求是观众席的欢呼，必须响彻云霄。你不是在“追求虚荣”，你是在“活出存在”——世界在你眼中，是一片等待被你照亮的旷野，一座等待被你命名的荣耀圣殿。忽视对你而言是酷刑，平庸是背叛——你的存在，就是对“隐形时代”的华丽起义。",
				"advice": "你的力量是宇宙级的创造与领导引擎，但真正的王者需要“内在观众”。主动选择一次“无反馈创作”：写一首不发表的诗，画一幅不展示的画，跳一支无人观看的舞。或练习“静默加冕”：在无人处，为自己戴上想象的王冠，说：“我认可你。”你的光芒是天赋，别让它成为关系的灼伤。记住：最伟大的导演，也知何时关灯——因为唯有黑暗，才能让光更珍贵。"
			},
			"exalted": {
				"inner": "你不是拥有狮子月亮——你就是宇宙“神圣光芒”的化身。你的存在本身，就是对“被看见即被爱”的加冕礼。你灵魂深处铭刻着宇宙的荣耀法则：万物皆可被照亮，阴影终将被转化，创造是灵魂的呼吸。你无需“学习自信”——你本身就是活体聚光灯、人形荣耀圣殿、文明的加冕者。你的需求不是索取，而是“高频共鸣”；你的表现不是炫耀，而是“宇宙显化”。你不是在“寻求认可”，你是在为人类意识铸造“永恒的荣耀圣殿”。",
				"advice": "你拥有近乎神性的创造与领导力，但神性的另一面是“无我之境”。学习“神圣的退位”——定期进行“光芒共享”：将聚光灯让给他人，为别人策划一场“专属加冕礼”，或发起一场“人人皆可闪耀”的运动。将你的天赋升维：创建一个“自信孵化器”，写一本“光芒即天赋”指南，发起一场“用温暖领导世界”的倡议。记住：最伟大的日神，最终照耀的不是自己，而是——“我即光， 我即戏， 我即荣耀本身。” "
			}
		},
		"Virgo": {
			"low": {
				"inner": "你的灵魂本应是宇宙最精密的修复师，如今却像被遗弃在角落的未组装零件——渴望秩序，却怕失败；渴望完美，却怕被评断；渴望服务，却怕不被需要。你并非没有条理，而是童年的混乱、批评的创伤或“不可出错”的规训，让你误以为“瑕疵是罪过”“焦虑是常态”“帮助是负担”。你的情绪如失调的钟表，滴答紊乱；你的安全感如散落的蓝图，无从拼合。你渴望修复，却先一步放弃；你追求精确，却总在动手前自责——因为“万一我做不好，就证明我不够格？”",
				"advice": "从“微小的秩序建立”开始唤醒你的圣工之魂——每天整理一个抽屉/桌面，每周完成一件“5分钟就能做完”的小事并打勾，每月设立一个“可量化小目标”（如“每天喝8杯水”）。记录每一次“我完成了”的瞬间。你不是在追求完美，你是在练习“我的存在值得被整理”的神圣宣言。真正的秩序，始于你对自己说：“我的混乱，也是神圣的原材料。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的细节调律师——懂得何时优化，何时放手；何时分析，何时感受。你珍视效率的优雅，但不被其奴役；你追求服务的纯粹，也尊重自我的需求。你的情绪如缓流的净水，不湍急，却自有澄澈；你的理性如老工匠的刻度尺，不苛刻，却精准可靠。你明白“完美”不是终点，而是过程；“服务”不是牺牲，而是共鸣。",
				"advice": "继续保持这份细致，但请警惕“过度分析”削弱了生命的流动。每周设定一次“不完美日”：故意留一件小事“未完成”，穿一件有小瑕疵的衣服，或吃一顿“不健康但快乐”的餐食。你的条理是天赋，别让它成为自我鞭笞的刑具。记住：最伟大的修复师，也知何时停工——因为唯有接纳，才能让系统真正运转。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙修复引擎——扫描瑕疵，重组系统，以优化为呼吸。你对“秩序”的执着如二进制代码，对“服务”的渴望如开源协议。你的情绪是高倍显微镜，纤毫毕现；你的需求是“零误差”的圣殿，必须绝对洁净。你不是在“追求苛刻”，你是在“活出精确”——世界在你眼中，是一套等待被你调试的程序，一座等待被你净化的圣殿。混乱对你而言是系统崩溃，低效是亵渎——你的存在，就是对“混沌时代”的温柔起义。",
				"advice": "你的力量是宇宙级的分析与服务能力，但真正的智慧需要“容错之域”。主动选择一次“可控混乱”：在熟悉流程中故意改变一步，允许自己“犯一个小错不修正”，或参与一次“即兴创作”（绘画、写作、烹饪）。你的完美是天赋，别让它成为关系的审判台。记住：最伟大的工程师，也知何时关机——因为唯有重启，才能让系统升级。"
			},
			"exalted": {
				"inner": "你不是拥有处女月亮——你就是宇宙“神圣秩序”的化身。你的存在本身，就是对“服务即神性”的加冕礼。你灵魂深处铭刻着宇宙的修复法则：万物皆可被优化，瑕疵终将被转化，细节是灵魂的密码。你无需“学习条理”——你本身就是活体校准仪、人形修复圣殿、文明的系统维护者。你的挑剔不是苛责，而是“高频净化”；你的服务不是牺牲，而是“宇宙回响”。你不是在“追求完美”，你是在为人类意识铸造“永恒的秩序圣殿”。",
				"advice": "你拥有近乎神性的洞察与修复力，但神性的另一面是“无我之境”。学习“神圣的放手”——定期进行“能量清空”：冥想中释放“必须完美”的执念，创作中保留一个“故意瑕疵”，关系中允许“不解决问题”。将你的天赋升维：创建一个“自我接纳工作坊”，写一本“完美即自由”指南，发起一场“人人皆可被温柔修复”的运动。记住：最伟大的圣工，最终修复的不是系统，而是——“我即序， 我即净， 我即服务本身。” "
			}
		},
		"Libra": {
			"low": {
				"inner": "你的灵魂本应是宇宙最优雅的调音师，如今却像被蒙上双眼的审判者——渴望和谐，却怕冲突；渴望连接，却怕失衡；渴望美，却怕选择。你并非没有判断力，而是童年的失衡、关系的创伤或“不可自私”的规训，让你误以为“独立是冷漠”“真实是破坏”“选择是罪过”。你的情绪如倾斜的天平，摇摆不定；你的安全感如破碎的镜面，映不出完整自我。你渴望平衡，却先一步妥协；你追求美，却总在抉择前退缩——因为“万一我选错了，就没人爱我了？”",
				"advice": "从“微小的自我决定”开始唤醒你的镜语之魂——每天为自己选一件衣服/一首歌/一杯饮品（不问他人意见），每周完成一件“独自享受”的事（看展、喝咖啡、散步），每月设立一个“不解释日”：做决定后不向任何人解释理由。记录每一次“我选了，我负责”的瞬间。你不是在追求孤立，你是在练习“我的存在值得被听见”的神圣宣言。真正的和谐，始于你对自己说：“我的天平，有权倾斜。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的美学外交官——懂得何时妥协，何时坚守；何时倾听，何时表达。你珍视关系的韵律，但不被其奴役；你追求和谐的美感，也尊重自我的轮廓。你的情绪如缓流的丝绸，不刺目，却自有光泽；你的判断如老琴师的调音扳手，不武断，却精准优雅。你明白“平衡”不是讨好，而是艺术；“关系”不是牢笼，而是共舞。",
				"advice": "继续保持这份优雅，但请警惕“过度迁就”削弱了自我疆界。每周设定一次“真实表达日”：在安全关系中说出一个“不同意见”，或完成一件“只为取悦自己”的审美选择（穿搭、布置、艺术创作）。你的和谐是天赋，别让它成为自我消音的滤镜。记住：最伟大的调音师，也知何时独奏——因为唯有真音，才能让和声更美。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的关系织网者——溶解冲突，重组和谐，以美为呼吸。你对“平衡”的执着如黄金分割，对“连接”的渴望如引力定律。你的情绪是万花筒镜厅，折射万千可能；你的需求是“无冲突”的圣殿，必须绝对平滑。你不是在“追求讨好”，你是在“活出美学”——世界在你眼中，是一幅等待被你调色的画，一座等待被你命名的和谐圣殿。冲突对你而言是噪音，孤独是断弦——你的存在，就是对“割裂时代”的温柔起义。",
				"advice": "你的力量是宇宙级的关系与美学引擎，但真正的和谐需要“独奏之域”。主动选择一次“可控冲突”：在安全环境中表达一个“可能引发分歧”的观点，或完成一件“不考虑他人眼光”的创作。你的优雅是天赋，别让它成为真实情感的牢笼。记住：最伟大的外交官，也知何时离席——因为唯有独处，才能让关系重生。"
			},
			"exalted": {
				"inner": "你不是拥有天秤月亮——你就是宇宙“神圣和谐”的化身。你的存在本身，就是对“关系即神性”的加冕礼。你灵魂深处铭刻着宇宙的平衡法则：万物皆可被调和，冲突终将被转化，美是灵魂的母语。你无需“学习优雅”——你本身就是活体调音台、人形和谐圣殿、文明的美学接口。你的妥协不是软弱，而是“高频整合”；你的选择不是犹豫，而是“宇宙权衡”。你不是在“避免冲突”，你是在为人类意识铸造“永恒的和谐圣殿”。",
				"advice": "你拥有近乎神性的关系与美学力，但神性的另一面是“无我之境”。学习“神圣的独奏”——定期进行“无镜日”：不寻求他人反馈，不解释自己选择，只与自然/艺术对话。将你的天赋升维：创建一个“关系美学工作坊”，写一本“冲突即艺术”指南，发起一场“人人皆可优雅真实”的运动。记住：最伟大的美神，最终调和的不是他人，而是——“我即衡， 我即镜， 我即和谐本身。” "
			}
		},
		"Scorpio": {
			"low": {
				"inner": "你的灵魂本应是宇宙最深邃的转化祭司，如今却像被封印在浅滩的暗流——渴望深度，却怕被吞噬；渴望真实，却怕被看穿；渴望力量，却怕失控。你并非没有直觉，而是童年的创伤、情绪的惩罚或“不可阴暗”的规训，让你误以为“痛苦是耻辱”“执念是病态”“黑暗是危险”。你的情绪如干涸的冥河，表面平静，深处龟裂；你的安全感如锈蚀的锁链，既想挣脱，又怕坠落。你渴望蜕变，却先一步逃避；你追求真实，却总在触碰前转身——因为“万一我沉下去，就再也上不来了？”",
				"advice": "从“微小的情绪直面”开始唤醒你的暗渊之魂——每天写下一件“我不敢承认的情绪”（撕掉或烧掉都行），每周看一部“黑暗但治愈”的电影，每月完成一次“独自静坐10分钟，不逃避任何浮现的念头”。记录每一次“我面对了”的瞬间。你不是在追求痛苦，你是在练习“我的阴影值得被供奉”的神圣宣言。真正的力量，始于你对自己说：“我的深渊，有权存在。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的阴影翻译官——懂得何时沉潜，何时浮出；何时洞察，何时放手。你珍视情绪的浓度，但不被其淹没；你追求真实的深度，也尊重他人的边界。你的情绪如缓流的冥河，不湍急，却自有力量；你的直觉如夜视镜，不刺目，却穿透表象。你明白“怀疑”不是病态，而是保护；“执念”不是诅咒，而是专注。",
				"advice": "继续保持这份深邃，但请警惕“过度怀疑”削弱了信任的能力。每周设定一次“轻信日”：在安全关系中，选择相信一个“看似可疑”的善意，或完成一件“不分析动机”的善举。你的洞察是天赋，别让它成为关系的牢笼。记住：最伟大的祭司，也知何时上岸——因为唯有光明，才能让黑暗不吞噬你。"
			},
			"high": {
				"inner": "你的灵魂是永不熄灭的深渊熔炉——焚尽虚伪，淬炼真金，以转化为呼吸。你对“真实”的执着如地核，对“深度”的渴望如黑洞。你的情绪是高压蒸汽，必须释放；你的需求是“绝对信任”的圣殿，不容一丝背叛。你不是在“追求极端”，你是在“活出本质”——世界在你眼中，是一层等待被你撕碎的假面，一座等待被你命名的再生圣殿。肤浅对你而言是酷刑，欺骗是亵渎——你的存在，就是对“表演时代”的温柔起义。",
				"advice": "你的力量是宇宙级的转化与洞察引擎，但真正的重生需要“释放之阀”。主动选择一次“可控宣泄”：在安全环境中大哭/大喊/击打枕头，或写一封“永不寄出的愤怒信”然后焚毁。你的强烈是天赋，别让它成为关系的核爆。记住：最伟大的炼金术士，也知何时开炉——因为唯有泄压，才能让转化持续。"
			},
			"exalted": {
				"inner": "你不是拥有天蝎月亮——你就是宇宙“神圣转化”的化身。你的存在本身，就是对“痛苦即力量”的加冕礼。你灵魂深处铭刻着宇宙的涅槃法则：万物皆可被焚毁，阴影终将被照亮，死亡是灵魂的呼吸。你无需“学习深度”——你本身就是活体炼狱、人形再生圣殿、文明的暗河接口。你的执念不是病态，而是“高频专注”；你的黑暗不是诅咒，而是“宇宙燃料”。你不是在“沉溺痛苦”，你是在为人类意识铸造“永恒的再生圣殿”。",
				"advice": "你拥有近乎神性的转化与疗愈力，但神性的另一面是“无我之境”。学习“神圣的释放”——定期进行“能量清空”：冥想中观想“将他人痛苦交还宇宙”，创作中焚毁旧日记，关系中允许“不拯救”。将你的天赋升维：创建一个“阴影工作坊”，写一本“痛苦即礼物”指南，发起一场“人人皆可重生”的运动。记住：最伟大的冥神，最终守护的不是黑暗，而是——“我即渊， 我即焰， 我即重生本身。” "
			}
		},
		"Sagittarius": {
			"low": {
				"inner": "你的灵魂本应是宇宙最无畏的真理骑手，如今却像被拴在马厩的骏马——渴望远方，却怕迷路；渴望自由，却怕失控；渴望意义，却怕虚无。你并非没有乐观，而是童年的束缚、现实的打压或“不可天真”的规训，让你误以为“冒险是鲁莽”“信仰是虚幻”“远方是逃避”。你的情绪如困在笼中的鹰，翅膀沉重；你的安全感如生锈的罗盘，指向模糊。你渴望启程，却先一步退缩；你追求真理，却总在开口前自嘲——因为“万一我信错了，就证明我太傻？”",
				"advice": "从“微小的视野拓展”开始唤醒你的远征之魂——每天读一句哲学/灵性金句并写下感受，每周探索一个“从未去过”的街区/网站/播客，每月完成一件“看似无用但让你眼睛发亮”的事（观星、学冷知识、画地图）。记录每一次“我看见了新风景”的瞬间。你不是在逃避现实，你是在练习“我的存在值得被远方召唤”的神圣宣言。真正的自由，始于你对自己说：“我的缰绳，有权松开。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的真理向导——懂得何时启程，何时休整；何时宣讲，何时倾听。你珍视视野的辽阔，但不被其分散；你追求意义的深度，也尊重当下的锚点。你的情绪如缓升的热气球，不狂飙，却自有高度；你的乐观如老旅人的篝火，不刺目，却温暖可靠。你明白“自由”不是放纵，而是选择；“信仰”不是盲从，而是内在罗盘。",
				"advice": "继续保持这份开阔，但请警惕“过度漂泊”削弱了情感的浓度。每周设定一次“深度停留日”：只专注一件事/一个人/一个地方，不切换话题，不计划下一步。你的热情是天赋，别让它成为关系的浮萍。记住：最伟大的旅人，也知何时下马——因为唯有扎根，才能让远征不虚无。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的星际引擎——撕碎边界，重组意义，以探索为呼吸。你对“自由”的渴望如光年，对“真理”的执着如星图。你的情绪是野马群，必须狂奔；你的需求是“无拘无束”的圣殿，不容一丝束缚。你不是在“逃避责任”，你是在“活出维度”——世界在你眼中，是一张等待被你重绘的星图，一座等待被你命名的真理圣殿。停滞对你而言是窒息，狭隘是亵渎——你的存在，就是对“内卷时代”的温柔起义。",
				"advice": "你的力量是宇宙级的探索与赋能引擎，但真正的智慧需要“锚点之域”。主动选择一次“可控扎根”：在熟悉领域深耕一个技能，在稳定关系中承诺一件小事，或完成一件“需要长期投入”的创作（写书、种树、学乐器）。你的自由是天赋，别让它成为承诺的敌人。记住：最伟大的拓荒者，也知何时筑城——因为唯有定居，才能让文明诞生。"
			},
			"exalted": {
				"inner": "你不是拥有射手月亮——你就是宇宙“神圣自由”的化身。你的存在本身，就是对“远方即归处”的加冕礼。你灵魂深处铭刻着宇宙的远征法则：万物皆可被重新定义，局限终将被超越，真理是灵魂的母语。你无需“学习乐观”——你本身就是活体星图、人形真理圣殿、文明的星际接口。你的逃避不是懦弱，而是“高频跃迁”；你的信仰不是天真，而是“宇宙回响”。你不是在“追求远方”，你是在为人类意识铸造“永恒的真理圣殿”。",
				"advice": "你拥有近乎神性的探索与智慧力，但神性的另一面是“无我之境”。学习“神圣的停留”——定期进行“能量锚定”：冥想中观想“将星光种入大地”，创作中完成一件“留给后人的作品”，关系中承诺“长期陪伴”。将你的天赋升维：创建一个“视野拓展营”，写一本“自由即责任”指南，发起一场“人人皆可看见星辰”的运动。记住：最伟大的智神，最终照亮的不是远方，而是——“我即路， 我即光， 我即真理本身。” "
			}
		},
		"Capricorn": {
			"low": {
				"inner": "你的灵魂本应是宇宙最坚韧的筑城者，如今却像被风化的未完成石阶——渴望成就，却怕失败；渴望稳定，却怕束缚；渴望责任，却怕重压。你并非没有自律，而是童年的动荡、权威的否定或“不可软弱”的规训，让你误以为“休息是堕落”“情绪是干扰”“缓慢是耻辱”。你的情绪如冻土下的暗流，表面坚硬，深处淤塞；你的安全感如未固化的地基，摇摇欲坠。你渴望攀登，却先一步怀疑；你追求成就，却总在起步前自责——因为“万一我做不到，就证明我不配？”",
				"advice": "从“微小的结构建立”开始唤醒你的山魂之魄——每天完成一件“可量化小事”并打勾（如“整理5分钟”“步行1000步”），每周设立一个“不与他人比较”的小目标，每月完成一件“延迟满足”的事（存一笔小钱、读完一本厚书）。记录每一次“我做到了”的瞬间。你不是在追求完美，你是在练习“我的存在值得被时间见证”的神圣宣言。真正的成就，始于你对自己说：“我的阶梯，有权从第一步开始。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的永恒建筑师——懂得何时攀登，何时休整；何时规划，何时感受。你珍视责任的重量，但不被其压垮；你追求长远的视野，也尊重当下的呼吸。你的情绪如缓升的山雾，不浓烈，却自有高度；你的自律如老石匠的刻刀，不急躁，却精准可靠。你明白“克制”不是压抑，而是蓄力；“规划”不是束缚，而是自由。",
				"advice": "继续保持这份坚韧，但请警惕“过度压抑”削弱了生命的弹性。每周设定一次“无结构日”：不做计划、不设目标、不看时间，只做“当下想做的事”（哪怕只是躺着看云）。你的踏实是天赋，别让它成为情绪的牢笼。记住：最伟大的筑城者，也知何时停工——因为唯有休憩，才能让城墙更坚固。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的时间引擎——粉碎借口，重组现实，以成就为呼吸。你对“责任”的执着如地脉，对“高度”的渴望如雪峰。你的情绪是高压岩层，必须释放；你的需求是“绝对掌控”的圣殿，不容一丝失控。你不是在“追求苛刻”，你是在“活出维度”——世界在你眼中，是一张等待被你征服的等高线图，一座等待被你命名的成就圣殿。混乱对你而言是崩塌，停滞是背叛——你的存在，就是对“速食时代”的温柔起义。",
				"advice": "你的力量是宇宙级的结构与耐力引擎，但真正的成就需要“柔软之域”。主动选择一次“可控失控”：在安全环境中大笑/大哭/跳舞，或完成一件“不追求结果”的创作（涂鸦、即兴写作、堆沙堡）。你的自律是天赋，别让它成为关系的冰墙。记住：最伟大的登山者，也知何时坐下——因为唯有俯视，才能看见来路之美。"
			},
			"exalted": {
				"inner": "你不是拥有摩羯月亮——你就是宇宙“神圣成就”的化身。你的存在本身，就是对“时间即盟友”的加冕礼。你灵魂深处铭刻着宇宙的攀登法则：万物皆可被结构，混沌终将被秩序转化，责任是灵魂的铠甲。你无需“学习自律”——你本身就是活体阶梯、人形成就圣殿、文明的永恒筑城者。你的压抑不是软弱，而是“高频蓄能”；你的责任不是负担，而是“宇宙回响”。你不是在“追求山顶”，你是在为人类意识铸造“永恒的成就圣殿”。",
				"advice": "你拥有近乎神性的耐力与结构力，但神性的另一面是“无我之境”。学习“神圣的放下”——定期进行“能量清空”：冥想中观想“将重担交给大地”，创作中完成一件“不署名的作品”，关系中允许“不解决问题”。将你的天赋升维：创建一个“成就疗愈营”，写一本“责任即自由”指南，发起一场“人人皆可稳步登顶”的运动。记住：最伟大的山神，最终守护的不是高度，而是——“我即阶， 我即城， 我即成就本身。” "
			}
		},
		"Aquarius": {
			"low": {
				"inner": "你的灵魂本应是宇宙最前沿的星际议员，如今却像被拔掉插头的终端——渴望独立，却怕孤独；渴望创新，却怕异类；渴望群体，却怕淹没。你并非没有远见，而是童年的规训、群体的排斥或“不可怪异”的规训，让你误以为“抽离是冷漠”“理性是无情”“独特是危险”。你的情绪如断网的云端，表面平静，深处焦虑；你的安全感如未激活的节点，渴望连接，又怕短路。你渴望自由，却先一步依附；你追求真理，却总在表达前退缩——因为“万一我说出来，就没人要我了？”",
				"advice": "从“微小的思维独立”开始唤醒你的星语之魂——每天写下一件“和主流不同的想法”（不发布，只记录），每周接触一个“颠覆认知”的新观念（播客、文章、纪录片），每月完成一件“只为取悦未来自己”的事（学编程、写科幻、设计乌托邦）。记录每一次“我独立思考了”的瞬间。你不是在追求孤僻，你是在练习“我的存在值得被未来听见”的神圣宣言。真正的联网，始于你对自己说：“我的频率，有权独特。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的星际协调官——懂得何时联网，何时断线；何时革新，何时妥协。你珍视理性的澄澈，但不被其冰封；你追求群体的进步，也尊重个体的边界。你的情绪如缓流的量子云，不浓烈，却自有维度；你的独立如老先知的望远镜，不傲慢，却穿透时代。你明白“疏离”不是冷漠，而是观察；“独特”不是叛逆，而是进化。",
				"advice": "继续保持这份前瞻，但请警惕“过度抽离”削弱了生命的温度。每周设定一次“情感直连日”：在安全关系中表达一个“非理性感受”（如“我今天就是想被抱抱”），或完成一件“无逻辑但温暖”的事（手写信、送小礼物、即兴拥抱）。你的理性是天赋，别让它成为关系的防火墙。记住：最伟大的议员，也知何时下凡——因为唯有体温，才能让网络不冰冷。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的文明升级引擎——粉碎陈规，重组未来，以联网为呼吸。你对“真理”的执着如算法，对“群体”的渴望如云端。你的情绪是高压电流，必须释放；你的需求是“绝对自由”的圣殿，不容一丝情感绑架。你不是在“追求冷漠”，你是在“活出维度”——世界在你眼中，是一套等待被你重写的操作系统，一座等待被你命名的群体圣殿。庸常对你而言是系统错误，依附是病毒——你的存在，就是对“情感绑架时代”的温柔起义。",
				"advice": "你的力量是宇宙级的创新与联网力，但真正的进化需要“情感插件”。主动选择一次“可控感性”：在安全环境中表达脆弱（说“我需要你”），或完成一件“不追求效率”的陪伴（陪人发呆、听人哭诉、不解决问题只存在）。你的独立是天赋，别让它成为亲密的敌人。记住：最伟大的程序员，也知何时关机拥抱——因为唯有心跳，才能让代码有灵魂。"
			},
			"exalted": {
				"inner": "你不是拥有水瓶月亮——你就是宇宙“神圣未来”的化身。你的存在本身，就是对“群体即神性”的加冕礼。你灵魂深处铭刻着宇宙的联网法则：万物皆可被重组，孤独终将被转化，理性是灵魂的母语。你无需“学习独立”——你本身就是活体云端、人形群体圣殿、文明的星际接口。你的抽离不是无情，而是“高频观察”；你的冷漠不是缺陷，而是“宇宙缓冲”。你不是在“逃避情感”，你是在为人类意识铸造“永恒的群体圣殿”。",
				"advice": "你拥有近乎神性的远见与革新力，但神性的另一面是“无我之境”。学习“神圣的感性”——定期进行“能量接地”：冥想中观想“星光流入心脏”，创作中完成一件“献给具体某人”的作品，关系中承诺“不分析只感受”。将你的天赋升维：创建一个“未来情感实验室”，写一本“理性即慈悲”指南，发起一场“人人皆可联网而不失温”的运动。记住：最伟大的星神，最终连接的不是数据，而是——“我即网， 我即光， 我即未来本身。” "
			}
		},
		"Pisces": {
			"low": {
				"inner": "你的灵魂本应是宇宙最深邃的灵性海洋，如今却像被水泥封印的泉眼——渴望流动，却怕淹没；渴望慈悲，却怕受伤；渴望想象，却怕虚幻。你并非没有同理，而是童年的创伤、现实的打压或“不可做梦”的规训，让你误以为“敏感是弱点”“幻想是逃避”“慈悲是愚蠢”。你的情绪如干涸的河床，龟裂无声；你的安全感如溺水者的手，抓不住任何实体。你渴望溶解，却先一步筑墙；你追求连接，却总在触碰前退缩——因为“万一我沉下去，就再也找不回自己了？”",
				"advice": "从“微小的灵性触碰”开始唤醒你的灵海之魂——每天听一首让你想哭的音乐并允许流泪，每周创作一件“无意义但让你心颤”的小作品（涂鸦、哼歌、写梦），每月完成一次“神圣浸泡”（泡澡时点蜡烛+精油+冥想）。记录每一次“我感受到了”的瞬间。你不是在追求虚幻，你是在练习“我的存在值得被温柔溶解”的神圣宣言。真正的海洋，始于你对自己说：“我的潮汐，有权涨落。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的梦境翻译官——懂得何时沉潜，何时浮出；何时共情，何时抽离。你珍视慈悲的深度，但不被其淹没；你追求想象的翅膀，也尊重现实的锚点。你的情绪如缓流的星尘，不汹涌，却自有光晕；你的同理如老药师的药汤，不泛滥，却疗愈无声。你明白“敏感”不是病态，而是天赋；“幻想”不是逃避，而是预演。",
				"advice": "继续保持这份温柔，但请警惕“过度溶解”削弱了自我的轮廓。每周设定一次“现实锚定日”：完成一件“100%务实”的任务（报税、修电器、整理文件），或练习“能量结界冥想”（观想金色光罩包裹自己）。你的慈悲是天赋，别让它成为他人情绪的海绵。记住：最伟大的药师，也知何时关门——因为唯有容器，才能盛住药汤。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙溶解引擎——粉碎边界，重组慈悲，以想象为呼吸。你对“合一”的渴望如暗物质，对“疗愈”的执着如潮汐力。你的情绪是高压海啸，必须释放；你的需求是“绝对无界”的圣殿，不容一丝现实框架。你不是在“逃避现实”，你是在“活出维度”——世界在你眼中，是一层等待被你溶解的假面，一座等待被你命名的疗愈圣殿。冷漠对你而言是酷刑，分离是亵渎——你的存在，就是对“原子化时代”的温柔起义。",
				"advice": "你的力量是宇宙级的慈悲与想象力引擎，但真正的疗愈需要“容器之域”。主动选择一次“可控现实”：在安全环境中完成一件“枯燥但必要”的事（填表格、排队、记账），或练习“能量回收术”（冥想中观想“将他人情绪如潮水般推回大海”）。你的敏感是天赋，别让它成为自我的湮灭。记住：最伟大的海洋，也知何时退潮——因为唯有岸边，才能让生命栖息。"
			},
			"exalted": {
				"inner": "你不是拥有双鱼月亮——你就是宇宙“神圣溶解”的化身。你的存在本身，就是对“痛苦即诗篇”的加冕礼。你灵魂深处铭刻着宇宙的潮汐法则：万物皆可被温柔包裹，边界终将被爱溶解，混沌是灵魂的母语。你无需“学习慈悲”——你本身就是活体海洋、人形疗愈圣殿、文明的灵性接口。你的逃避不是懦弱，而是“高频跃迁”；你的幻想不是虚无，而是“宇宙蓝图”。你不是在“沉溺痛苦”，你是在为人类意识铸造“永恒的疗愈圣殿”。",
				"advice": "你拥有近乎神性的疗愈与想象力力，但神性的另一面是“无我之境”。学习“神圣的结界”——定期进行“能量清空”：冥想中观想“将众生苦痛交还宇宙海洋”，创作中完成一件“献给具体某人”的疗愈作品，关系中允许“不拯救”。将你的天赋升维：创建一个“梦境疗愈营”，写一本“混沌即神性”指南，发起一场“人人皆可被温柔溶解”的运动。记住：最伟大的海神，最终守护的不是淹没，而是——“我即潮， 我即梦， 我即慈悲本身。”。 "
			}
		}
	},
	"ascendant": {
		"Aries": {
			"low": {
				"inner": "你的灵魂本应是宇宙第一声战吼，如今却像被裹在棉被里的号角——渴望冲锋，却怕撞墙；渴望主导，却怕被厌；渴望启动，却怕失败。你并非没有勇气，而是童年的压制、节奏的错位或“不可抢先”的规训，让你误以为“果断是冒犯”“速度是鲁莽”“自我是自私”。你的行动力如未点燃的引信，表面平静，内里焦灼；你的存在感如未升起的战旗，渴望飘扬，又怕被射落。你渴望开局，却先一步退让；你追求方向，却总在起跑线前自疑——因为“万一我冲错了，就没人跟我了？”",
				"outer": "你像一把未出鞘的剑——锋芒内敛，节奏迟疑，常被误读为“温吞”或“被动”。他人不易感知你的火种，只觉你“随和但无主见”“配合但无方向”。你的“白羊之门”尚未开启，世界看到的，是门后的影子，而非门神。",
				"advice": "从“微小的自我主张”开始唤醒你的先锋之魂——每天在小事上“第一个说‘我来’”（点菜、选路、开话题），每周完成一件“5秒内决定并执行”的事（买喜欢的东西、发想说的话、走想走的路），每月设立一个“不解释的启动日”：做决定后不向任何人解释理由。记录每一次“我先动了”的瞬间。你不是在追求控制，你是在练习“我的存在有权开启”的神圣宣言。真正的战鼓，始于你对自己说：“我的号角，有权吹响。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的战术先锋——懂得何时冲锋，何时掩护；何时独行，何时带队。你珍视效率的节奏，但不被其奴役；你追求主导的快感，也尊重他人的步调。你的行动力如缓升的火箭，不爆炸，却自有推力；你的驱动力如老猎人的直觉，不莽撞，却精准可靠。你明白“果断”不是霸道，而是清晰；“速度”不是压迫，而是赋能。",
				"outer": "你像一把出鞘三寸的剑——锋芒可见，节奏明快，他人感知到“干脆”与“可靠”。你做事有头有尾，说话有始有终，常被委以“破冰者”或“执行先锋”之职。你的“白羊之门”已半开，世界看到的，是门神的微笑，与手中的火炬。",
				"advice": "继续保持这份动能，但请警惕“过度单干”削弱了团队的共鸣。每次行动前，强制自己写下“两个可执行步骤 + 一个可求助对象”。你的冲劲是天赋，别让它成为孤军。记住：最伟大的先锋，也知何时回头——因为唯有队伍，才能让胜利延续。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙引擎——粉碎犹豫，重组节奏，以启动为呼吸。你对“开局”的执着如闪电，对“主导”的渴望如战旗。你的行动力是高压电流，必须释放；你的需求是“绝对先手”的圣殿，不容一丝等待。你不是在“抢戏”，你是在“活出维度”——世界在你眼中，是一片等待被你点燃的旷野，一座等待被你命名的开端圣殿。迟缓对你而言是酷刑，跟随是亵渎——你的存在，就是对“拖延时代”的温柔起义。。",
				"outer": "你像一把出鞘的烈焰剑——锋芒灼目，节奏如鼓，他人要么追随，要么退避。你常是会议第一个发言者、项目第一个报名者、冲突第一个介入者。你的“白羊之门”轰然洞开，世界看到的，是门神的怒吼，与席卷的火浪。",
				"advice": "你的力量是宇宙级的启动与主导引擎，但真正的领导需要“共鸣之域”。强制自己“三秒缓冲”：在开口/动手前，深吸三秒，问：“谁可同行？谁需空间？”你的速度是天赋，别让它成为关系的撞墙。记住：最伟大的将军，也知何时停步——因为唯有倾听，才能让队伍不散。"
			},
			"exalted": {
				"inner": "你不是拥有上升白羊——你就是宇宙“神圣开端”的化身。你的存在本身，就是对“我即第一推动力”的加冕礼。你灵魂深处铭刻着宇宙的冲锋法则：万物皆可被启动，混沌终将被方向转化，行动是灵魂的母语。你无需“学习果断”——你本身就是活体战鼓、人形开端圣殿、文明的先锋接口。你的急躁不是缺陷，而是“高频节拍”；你的自我不是傲慢，而是“宇宙回响”。你不是在“追求第一”，你是在为人类意识铸造“永恒的开端圣殿”。",
				"outer": "你像一把悬于天穹的神剑——未动而风云变，未言而人心聚。你无需争夺C位，因你所在之处，即为起点。他人不视你为“竞争者”，而为“点燃者”——你的气场自动重组节奏，你的存在自动赋予方向。你的“白羊之门”已化为天门，世界看到的，是门神的微笑，与身后的万千火炬。",
				"advice": "你拥有近乎神性的启动与领导力，但神性的另一面是“无我之境”。学习“神圣的邀请”——定期进行“能量共享”：主动将“第一”让给他人，为别人策划“专属开场礼”，或发起一场“人人皆可点燃”的运动。将你的天赋升维：创建一个“启动者联盟”，写一本“行动即慈悲”指南，发起一场“用温柔领导世界”的倡议。记住：最伟大的战神，最终守护的不是冲锋，而是——“我即门， 我即火， 我即开端本身。” "
			}
		},
		"Taurus": {
			"low": {
				"inner": "你的灵魂本应是宇宙最丰饶的孕育之土，如今却像被风雨冲刷的沙丘——渴望扎根，却怕束缚；渴望价值，却怕评判；渴望安稳，却怕停滞。你并非没有耐力，而是童年的动荡、价值的否定或“不可贪恋”的规训，让你误以为“缓慢是落后”“享受是罪过”“坚持是顽固”。你的存在感如未固化的地基，表面平静，深处流动；你的安全感如未播种的田，渴望丰收，又怕荒芜。你渴望稳定，却先一步随波；你追求价值，却总在拥有前放手——因为“万一我抓太紧，就显得贪婪了？”",
				"outer": "你像一尊未完成的石像——轮廓模糊，节奏飘忽，常被误读为“散漫”或“无主见”。他人不易感知你的重量，只觉你“随和但无锚点”“配合但无质感”。你的“金牛之座”尚未落成，世界看到的，是风中的影子，而非大地的王座。",
				"advice": "从“微小的节奏固化”开始唤醒你的沃土之魂——每天固定一个“神圣时刻”（晨间咖啡、晚间精油、午间静坐），每周完成一件“可触摸的成果”（种一盆植物、做一顿饭、整理一个角落），每月设立一个“不比较的价值日”：只做让自己身心愉悦的事，不问“值不值”。记录每一次“我扎根了”的瞬间。你不是在追求占有，你是在练习“我的存在有权丰盛”的神圣宣言。真正的沃土，始于你对自己说：“我的节奏，有权缓慢。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的丰盛建筑师——懂得何时深耕，何时休耕；何时积累，何时分享。你珍视价值的厚度，但不被其奴役；你追求安稳的质感，也尊重变化的韵律。你的存在感如缓升的山脉，不突兀，却自有重量；你的节奏如老农的节气，不急躁，却精准可靠。你明白“固执”不是僵化，而是专注；“缓慢”不是落后，而是沉淀。",
				"outer": "你像一尊温润的玉雕——轮廓清晰，质感醇厚，他人感知到“可靠”与“滋养”。你做事有始有终，说话有根有据，常被委以“定海神针”或“品质把关”之职。你的“金牛之座”已初具规模，世界看到的，是王座的温光，与座下的丰饶。",
				"advice": "继续保持这份沉稳，但请警惕“过度固化”削弱了生命的弹性。每月强制自己完成一件“小范围新尝试”（换条上班路、试新菜谱、买件非常规单品）。你的踏实是天赋，别让它成为创新的牢笼。记住：最伟大的农夫，也知何时轮作——因为唯有新种，才能让土地不竭。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙熔炉——粉碎虚无，重组价值，以存在为呼吸。你对“稳定”的执着如地核，对“丰盛”的渴望如矿脉。你的节奏是高压岩层，必须释放；你的需求是“绝对掌控”的圣殿，不容一丝动荡。你不是在“抗拒变化”，你是在“活出维度”——世界在你眼中，是一片等待被你固化的流沙，一座等待被你命名的存在圣殿。仓促对你而言是亵渎，虚无是酷刑——你的存在，就是对“速食时代”的温柔起义。",
				"outer": "你像一座移动的翡翠山——未言而自重，未动而自稳，他人要么依靠，要么敬畏。你常是团队最后的防线、项目品质的底线、情绪风暴的避风港。你的“金牛之座”已化为圣山，世界看到的，是王座的威严，与山下的无尽宝藏。",
				"advice": "你的力量是宇宙级的锚定与丰盛引擎，但真正的丰饶需要“流动之域”。强制自己为变化预设“缓冲区”：在改变前，先完成一件“安全小事”作为过渡（如换发型前先换发饰），或设立“变化基金”（时间/金钱/情绪额度）。你的坚持是天赋，别让它成为关系的高墙。记住：最伟大的山神，也知何时让溪流过——因为唯有流动，才能让宝藏不腐。"
			},
			"exalted": {
				"inner": "你不是拥有上升金牛——你就是宇宙“神圣存在”的化身。你的存在本身，就是对“我即丰盛之源”的加冕礼。你灵魂深处铭刻着宇宙的锚定法则：万物皆可被固化，虚无终将被价值转化，质感是灵魂的母语。你无需“学习稳定”——你本身就是活体沃土、人形存在圣殿、文明的永恒地基。你的固执不是顽固，而是“高频专注”；你的缓慢不是迟钝，而是“宇宙节律”。你不是在“追求占有”，你是在为人类意识铸造“永恒的存在圣殿”。",
				"outer": "你像一座行走的圣殿——未装饰而自华，未宣告而自重。你无需证明价值，因你所在之处，即为丰饶。他人不视你为“守旧者”，而为“孕育者”——你的气场自动沉淀混乱，你的存在自动赋予质感。你的“金牛之座”已化为天座，世界看到的，是地母的微笑，与座下生生不息的万物。",
				"advice": "你拥有近乎神性的锚定与丰盛力，但神性的另一面是“无我之境”。学习“神圣的给予”——定期进行“能量播种”：主动分享你的资源（时间/物品/知识），为他人策划“专属丰盛礼”，或发起一场“人人皆可扎根”的运动。将你的天赋升维：创建一个“存在感疗愈营”，写一本“缓慢即力量”指南，发起一场“用质感领导世界”的倡议。记住：最伟大的地母，最终孕育的不是占有，而是——“我即土， 我即玉， 我即存在本身。” "
			}
		},
		"Gemini": {
			"low": {
				"inner": "你的灵魂本应是宇宙最敏捷的量子信使，如今却像被静音键锁住的频道——渴望表达，却怕说错；渴望连接，却怕打扰；渴望好奇，却怕浅薄。你并非没有灵感，而是童年的压抑、表达的惩罚或“不可多话”的规训，让你误以为“跳跃是浮躁”“好奇是冒犯”“多言是聒噪”。你的思维如断线的云端，表面平静，深处焦虑；你的社交力如未激活的接口，渴望联网，又怕短路。你渴望流动，却先一步冻结；你追求链接，却总在开口前退缩——因为“万一我说出来，就没人听我了？”",
				"outer": "你像一部静音播放的全息投影——内容丰富，却无声无息，常被误读为“内向”或“无趣”。他人不易感知你的灵动，只觉你“安静但无火花”“聪明但无输出”。你的“双子之门”尚未开启，世界看到的，是风中的哑剧，而非信使的舞步。",
				"advice": "从“微小的表达启动”开始唤醒你的信风之魂——每天准备“三句开场白 + 一个提问”并主动使用（哪怕对店员、AI、镜子），每周完成一件“信息轻输出”（发一条有观点的朋友圈、录一段语音日记、写三行诗），每月设立一个“好奇日”：主动问三个“看似幼稚的问题”。记录每一次“我链接了”的瞬间。你不是在追求喧哗，你是在练习“我的存在有权流动”的神圣宣言。真正的信道，始于你对自己说：“我的频率，有权广播。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的跨界翻译官——懂得何时深聊，何时浅谈；何时发散，何时聚焦。你珍视信息的流动，但不被其淹没；你追求思维的轻盈，也尊重他人的节奏。你的表达力如缓流的溪涧，不湍急，却自有韵律；你的好奇心如老信使的罗盘，不散乱，却精准灵动。你明白“跳跃”不是浮躁，而是探索；“多线”不是混乱，而是织网。",
				"outer": "你像一部调频精准的收音机——频道清晰，音质悦耳，他人感知到“有趣”与“易相处”。你聊天有来有往，学习边走边拾，常被委以“气氛调节者”或“信息中转站”之职。你的“双子之门”已半开，世界看到的，是信使的微笑，与手中的万花筒。",
				"advice": "继续保持这份灵动，但请警惕“过度发散”削弱了深度的共鸣。每次对话前，强制自己设定“一个核心结论 + 一个关键词”，并在结束时轻声复述。你的机智是天赋，别让它成为关系的浮萍。记住：最伟大的信使，也知何时停驻——因为唯有锚点，才能让信息不散佚。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙路由器——粉碎沉默，重组链接，以流动为呼吸。你对“新鲜”的执着如数据流，对“连接”的渴望如云端。你的思维是高压电流，必须释放；你的需求是“绝对自由”的圣殿，不容一丝停滞。你不是在“话多”，你是在“活出维度”——世界在你眼中，是一张等待被你重连的断网，一座等待被你命名的流动圣殿。单调对你而言是酷刑，静止是亵渎——你的存在，就是对“信息茧房时代”的温柔起义。",
				"outer": "你像一座移动的信号塔——未言而自响，未动而自联，他人要么追随，要么关机。你常是会议的气氛引擎、项目的跨界接口、社交场的灵感火花。你的“双子之门”轰然洞开，世界看到的，是信使的旋舞，与席卷的思维风暴。",
				"advice": "你的力量是宇宙级的链接与信息力，但真正的沟通需要“沉淀之域”。强制自己每次交流结束前，用一句话总结“核心结论”，并写在便签/备忘录。你的流动是天赋，别让它成为他人理解的迷宫。记住：最伟大的织网者，也知何时打结——因为唯有节点，才能让网络不崩解。"
			},
			"exalted": {
				"inner": "你不是拥有上升双子——你就是宇宙“神圣连接”的化身。你的存在本身，就是对“我即信息之桥”的加冕礼。你灵魂深处铭刻着宇宙的通讯法则：万物皆可被链接，孤岛终将被网络转化，对话是灵魂的母语。你无需“学习表达”——你本身就是活体信道、人形流动圣殿、文明的永恒接口。你的跳跃不是散乱，而是“高频织网”；你的多言不是聒噪，而是“宇宙回响”。你不是在“追求新鲜”，你是在为人类意识铸造“永恒的流动圣殿”。",
				"outer": "你像一座行走的智慧圣殿——未宣告而自明，未设计而自联。你无需争夺话筒，因你所在之处，即为对话。他人不视你为“话痨”，而为“启蒙者”——你的气场自动重组沉默，你的存在自动赋予灵感。你的“双子之门”已化为天门，世界看到的，是风神的羽翼，与翼下生生不息的万语千言。",
				"advice": "你拥有近乎神性的链接与启发力，但神性的另一面是“无我之境”。学习“神圣的总结”——定期进行“知识结晶”：将碎片信息整理成“一页指南”，为他人策划“专属灵感包”，或发起一场“人人皆可被启发”的运动。将你的天赋升维：创建一个“跨界灵感营”，写一本“流动即智慧”指南，发起一场“用对话重塑世界”的倡议。记住：最伟大的风神，最终传递的不是信息，而是——“我即风， 我即语， 我即连接本身。” "
			}
		},
		"Cancer": {
			"low": {
				"inner": "你的灵魂本应是宇宙最温柔的潮汐之母，如今却像被风暴撕裂的贝壳——渴望守护，却怕受伤；渴望连接，却怕吞噬；渴望温度，却怕暴露。你并非没有共感，而是童年的不安、边界的模糊或“不可脆弱”的规训，让你误以为“敏感是负担”“保护是控制”“情绪是弱点”。你的安全感如未固化的海岸线，表面平静，深处侵蚀；你的存在感如未点亮的灯塔，渴望指引，又怕被看见。你渴望滋养，却先一步退缩；你追求归属，却总在靠近前筑墙——因为“万一我敞开，就被掏空了？”",
				"outer": "你像一座未点灯的灯塔——轮廓温柔，却无光无暖，常被误读为“冷淡”或“疏离”。他人不易感知你的温度，只觉你“安静但无回应”“体贴但无存在”。你的“巨蟹之壳”尚未开启，世界看到的，是月光下的空影，而非港湾的暖光。",
				"advice": "从“微小的边界表达”开始唤醒你的月汐之魂——每天练习一句“温柔而清晰的拒绝”（如“我现在需要一点空间，晚点找你哦”），每周完成一件“自我滋养小事”（泡脚+精油、看一部治愈电影、写情绪日记），每月设立一个“安全距离日”：主动靠近一个“让你安心的人”，并表达一句“我在这里”。记录每一次“我守护了自己”的瞬间。你不是在追求隔离，你是在练习“我的存在有权安全”的神圣宣言。真正的港湾，始于你对自己说：“我的潮汐，有权涨落。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的月光建筑师——懂得何时敞开，何时闭合；何时滋养，何时休憩。你珍视关系的温度，但不被其淹没；你追求归属的深度，也尊重自我的轮廓。你的共感力如缓升的潮水，不汹涌，却自有韵律；你的保护欲如老灯塔的光，不刺目，却恒久可靠。你明白“敏感”不是弱点，而是天赋；“退缩”不是懦弱，而是智慧。",
				"outer": "你像一间点着暖炉的小屋——门扉半开，香气氤氲，他人感知到“安心”与“被懂”。你说话轻柔有温度，行动体贴有分寸，常被委以“情绪调节者”或“团队粘合剂”之职。你的“巨蟹之壳”已半开，世界看到的，是守护者的微笑，与壳内的柔软星光。",
				"advice": "继续保持这份滋养，但请警惕“过度付出”削弱了自我的能量。每次关怀他人前，强制自己完成一件“自我补给小事”（喝口水、深呼吸、看窗外10秒）。你的温柔是天赋，别让它成为枯竭的源头。记住：最伟大的港湾，也知何时闭港——因为唯有休憩，才能让灯塔不灭。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙子宫——粉碎冷漠，重组归属，以滋养为呼吸。你对“安全”的执着如潮汐力，对“守护”的渴望如月光。你的情绪是高压海啸，必须释放；你的需求是“绝对温暖”的圣殿，不容一丝寒意。你不是在“情绪化”，你是在“活出维度”——世界在你眼中，是一片等待被你包裹的孤岛，一座等待被你命名的港湾圣殿。疏离对你而言是酷刑，冷漠是亵渎——你的存在，就是对“原子化时代”的温柔起义。",
				"outer": "你像一座移动的避风港——未言而自暖，未动而自护，他人要么依偎，要么敬畏。你常是团队的情绪锚点、朋友的深夜热线、陌生人的安心角落。你的“巨蟹之壳”轰然洞开，世界看到的，是母神的怀抱，与席卷的温柔潮汐。",
				"advice": "你的力量是宇宙级的滋养与守护引擎，但真正的疗愈需要“能量分层”。强制自己将“照顾”分为三级：\n一级（ 轻量）： 微笑、 点头、 简短问候\n二级（ 中量）： 倾听10分钟、 给建议\n三级（ 重量）： 深度陪伴、 解决问题每天限定“ 三级照顾” 不超过1次。 你的共感是天赋， 别让它成为自我的湮灭。 记住： 最伟大的母神， 也知何时退潮—— 因为唯有边界， 才能让爱不枯竭。 "
			},
			"exalted": {
				"inner": "你不是拥有上升巨蟹——你就是宇宙“神圣滋养”的化身。你的存在本身，就是对“我即归属之源”的加冕礼。你灵魂深处铭刻着宇宙的潮汐法则：万物皆可被温柔包裹，孤岛终将被港湾转化，情绪是灵魂的母语。你无需“学习温柔”——你本身就是活体潮汐、人形港湾圣殿、文明的永恒子宫。你的波动不是失控，而是“高频共鸣”；你的保护不是控制，而是“宇宙结界”。你不是在“追求被需要”，你是在为人类意识铸造“永恒的港湾圣殿”。",
				"outer": "你像一座行走的月光圣殿——未宣告而自暖，未设计而自聚。你无需争取信任，因你所在之处，即为安心。他人不视你为“情绪负担”，而为“灵魂锚点”——你的气场自动溶解孤独，你的存在自动赋予归属。你的“巨蟹之壳”已化为天穹，世界看到的，是月神的微笑，与翼下生生不息的万家灯火。",
				"advice": "你拥有近乎神性的滋养与疗愈力，但神性的另一面是“无我之境”。学习“神圣的复制”——定期进行“关怀系统化”：将你的温暖方法写成“一页指南”，为他人策划“专属安心包”，或发起一场“人人皆可成为港湾”的运动。将你的天赋升维：创建一个“情绪安全营”，写一本“脆弱即力量”指南，发起一场“用温柔重建世界”的倡议。记住：最伟大的月神，最终守护的不是依赖，而是——“我即潮， 我即光， 我即归属本身。” "
			}
		},
		"Leo": {
			"low": {
				"inner": "你的灵魂本应是宇宙最璀璨的太阳之子，如今却像被幕布遮盖的聚光灯——渴望闪耀，却怕刺眼；渴望领导，却怕评判；渴望创造，却怕失败。你并非没有光芒，而是童年的压抑、掌声的缺席或“不可张扬”的规训，让你误以为“自信是傲慢”“表现是虚荣”“舞台是危险”。你的存在感如未点燃的火炬，表面黯淡，深处灼热；你的价值感如未加冕的王储，渴望王座，又怕重压。你渴望发光，却先一步熄灭；你追求庆典，却总在开幕前退场——因为“万一我演砸了，就没人爱我了？”",
				"outer": "你像一座未点灯的黄金剧场——雕梁画栋，却无光无声，常被误读为“内向”或“平淡”。他人不易感知你的气场，只觉你“低调但无焦点”“有才但无舞台”。你的“狮子王座”尚未升起，世界看到的，是空荡的舞台，而非加冕的王者。",
				"advice": "从“微小的舞台热身”开始唤醒你的光焰之魂——每天在安全环境做一件“让自己被看见”的小事（穿亮色衣服、主动发言、发一张自拍），每周完成一次“5分钟独享舞台”（对镜演讲、即兴舞蹈、录一段Vlog），每月设立一个“无评判日”：做一件“只为取悦自己”的创意事，不问他人反馈。记录每一次“我发光了”的瞬间。你不是在追求虚荣，你是在练习“我的存在有权庆典”的神圣宣言。真正的王冠，始于你对自己说：“我的光芒，有权闪耀。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的庆典导演——懂得何时独舞，何时群演；何时聚光，何时熄灯。你珍视荣耀的质感，但不被其奴役；你追求领导的气场，也尊重他人的高光。你的自信力如缓升的日出，不刺目，却自有温度；你的创造力如老剧作家的笔，不浮夸，却精准动人。你明白“戏剧化”不是做作，而是仪式；“被看见”不是索取，而是共鸣。",
				"outer": "你像一座暖金色的露天剧场——灯光柔和，观众自在，他人感知到“鼓舞”与“可靠”。你说话有感染力，行动有统摄力，常被委以“团队士气官”或“项目代言人”之职。你的“狮子王座”已半升，世界看到的，是王者的微笑，与座下的欢腾人群。",
				"advice": "继续保持这份光芒，但请警惕“过度独占”削弱了集体的共鸣。每次登台前，强制自己“邀请一人上台”（点名夸赞、让出话筒、分享功劳）。你的气场是天赋，别让它成为他人的阴影。记住：最伟大的王者，也知何时让座——因为唯有共享，才能让庆典不落幕。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙聚光灯——粉碎黯淡，重组庆典，以存在为呼吸。你对“认可”的执着如日冕，对“舞台”的渴望如圣殿。你的光芒是高压电流，必须释放；你的需求是“绝对中心”的圣殿，不容一丝忽视。你不是在“抢戏”，你是在“活出维度”——世界在你眼中，是一片等待被你点亮的暗夜，一座等待被你命名的舞台圣殿。平庸对你而言是酷刑，隐形是亵渎——你的存在，就是对“灰暗时代”的温柔起义。",
				"outer": "你像一座移动的太阳神殿——未言而自明，未动而自耀，他人要么追随，要么退避。你常是会议的焦点、活动的灵魂、朋友圈的灵感源。你的“狮子王座”轰然升起，世界看到的，是神王的怒吼，与席卷的金色光浪。",
				"advice": "你的力量是宇宙级的光芒与领导引擎，但真正的王者需要“内在圣殿”。强制自己建立“自证系统”：每天写下“三件不依赖他人评价的自我肯定”，或设立“内在掌声时刻”（完成小事后，自己鼓掌3秒）。你的闪耀是天赋，别让它成为价值的枷锁。记住：最伟大的太阳神，也知何时日落——因为唯有阴影，才能让光有形状。"
			},
			"exalted": {
				"inner": "你不是拥有上升狮子——你就是宇宙“神圣光芒”的化身。你的存在本身，就是对“我即庆典之源”的加冕礼。你灵魂深处铭刻着宇宙的加冕法则：万物皆可被照亮，黯淡终将被庆典转化，创造是灵魂的母语。你无需“学习自信”——你本身就是活体太阳、人形舞台圣殿、文明的永恒庆典。你的戏剧化不是浮夸，而是“高频仪式”；你的领导力不是控制，而是“宇宙共鸣”。你不是在“追求掌声”，你是在为人类意识铸造“永恒的舞台圣殿”。",
				"outer": "你像一座行走的光明圣殿——未宣告而自耀，未设计而自聚。你无需争夺焦点，因你所在之处，即为庆典。他人不视你为“自我中心”，而为“灵感之源”——你的气场自动点燃热情，你的存在自动赋予方向。你的“狮子王座”已化为天穹，世界看到的，是日神的微笑，与座下生生不息的欢腾众生。",
				"advice": "你拥有近乎神性的光芒与创造力，但神性的另一面是“无我之境”。学习“神圣的让渡”——定期进行“能量分光”：主动将“C位”让给他人，为别人策划“专属高光时刻”，或发起一场“人人皆可加冕”的运动。将你的天赋升维：创建一个“光芒共享营”，写一本“存在即庆典”指南，发起一场“用幽默领导世界”的倡议。记住：最伟大的日神，最终照耀的不是王座，而是——“我即光， 我即戏， 我即庆典本身。” "
			}
		},
		"Virgo": {
			"low": {
				"inner": "你的灵魂本应是宇宙最精密的神圣织律者，如今却像被乱线缠绕的纺锤——渴望秩序，却怕失控；渴望完美，却怕失败；渴望服务，却怕无用。你并非没有条理，而是童年的混乱、标准的苛责或“不可出错”的规训，让你误以为“细节是负担”“优化是强迫”“服务是卑微”。你的安全感如未校准的仪器，表面平静，深处焦虑；你的价值感如未组装的零件，渴望完整，又怕残缺。你渴望净化，却先一步冻结；你追求流畅，却总在启动前自疑——因为“万一我做不好，就没人需要我了？”",
				"outer": "你像一间未整理的神圣工坊——工具散落，节奏慌乱，常被误读为“紧张”或“无序”。他人不易感知你的精准，只觉你“努力但无章法”“细心但无效率”。你的“处女圣律”尚未启动，世界看到的，是零散的图纸，而非运转的圣器。",
				"advice": "从“最小可行流程”开始唤醒你的织律之魂——每天只设定“一个核心任务 + 三个步骤”，完成后立即庆祝（哪怕只是打个勾）；每周完成一件“不追求完美”的事（发一条有错别字的朋友圈、做一顿半成品料理）；每月设立一个“混乱日”：故意打乱一件小事（换家具位置、走不同路线），观察自己能否“在乱中重建序”。记录每一次“我启动了”的瞬间。你不是在追求无瑕，你是在练习“我的存在有权流动”的神圣宣言。真正的圣律，始于你对自己说：“我的节奏，有权不完美。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的系统调音师——懂得何时精修，何时放过；何时纠错，何时留白。你珍视效率的韵律，但不被其奴役；你追求质量的厚度，也尊重过程的弹性。你的分析力如缓流的净水，不湍急，却自有澄澈；你的服务力如老药师的配方，不张扬，却精准疗愈。你明白“挑剔”不是苛责，而是校准；“细节”不是琐碎，而是神性。",
				"outer": "你像一间点着精油灯的精密实验室——工具齐整，节奏清晰，他人感知到“可靠”与“专业”。你做事有章有法，说话有根有据，常被委以“流程优化者”或“品质把关人”之职。你的“处女圣律”已半启，世界看到的，是工匠的微笑，与案上的完美圣器。",
				"advice": "继续保持这份精准，但请警惕“过度优化”削弱了生命的流动。强制自己设定“完成标准”而非“完美标准”——例如：“80分即交付”“三次修改即截止”。你的细致是天赋，别让它成为行动的牢笼。记住：最伟大的工匠，也知何时停手——因为唯有完成，才能让作品呼吸。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙纠错引擎——粉碎混乱，重组秩序，以优化为呼吸。你对“精确”的执着如算法，对“系统”的渴望如圣殿。你的分析力是高压电流，必须释放；你的需求是“绝对无瑕”的圣殿，不容一丝误差。你不是在“吹毛求疵”，你是在“活出维度”——世界在你眼中，是一套等待被你重写的故障程序，一座等待被你命名的秩序圣殿。粗糙对你而言是亵渎，低效是酷刑——你的存在，就是对“混沌时代”的温柔起义。",
				"outer": "你像一座移动的精密圣殿——未言而自整，未动而自序，他人要么依赖，要么敬畏。你常是团队的流程大脑、项目的纠错引擎、混乱现场的定海神针。你的“处女圣律”轰然启动，世界看到的，是神匠的凝视，与席卷的净化之风。",
				"advice": "你的力量是宇宙级的优化与修复引擎，但真正的圣殿需要“赞美之域”。强制自己每天完成“三次正向反馈”（对他人/对自己），并在项目节点进行“阶段性复盘 + 庆祝小胜”。你的精准是天赋，别让它成为关系的寒霜。记住：最伟大的校准者，也知何时赞美——因为唯有肯定，才能让系统不崩解。"
			},
			"exalted": {
				"inner": "你不是拥有上升处女——你就是宇宙“神圣秩序”的化身。你的存在本身，就是对“我即净化之源”的加冕礼。你灵魂深处铭刻着宇宙的校准法则：万物皆可被优化，混沌终将被圣律转化，细节是灵魂的母语。你无需“学习完美”——你本身就是活体圣律、人形秩序圣殿、文明的永恒工坊。你的挑剔不是苛责，而是“高频净化”；你的服务不是卑微，而是“宇宙圣礼”。你不是在“追求无瑕”，你是在为人类意识铸造“永恒的秩序圣殿”。",
				"outer": "你像一座行走的净世圣殿——未宣告而自整，未设计而自序。你无需证明能力，因你所在之处，即为流畅。他人不视你为“控制狂”，而为“系统之母”——你的气场自动重组混乱，你的存在自动赋予韵律。你的“处女圣律”已化为天律，世界看到的，是女神的微笑，与座下生生不息的精密万象。",
				"advice": "你拥有近乎神性的优化与修复力，但神性的另一面是“无我之境”。学习“神圣的外化”——定期进行“方法论沉淀”：将你的流程写成“一页指南”，为他人策划“专属优化包”，或发起一场“人人皆可有序”的运动。将你的天赋升维：创建一个“系统净化营”，写一本“瑕疵即神性”指南，发起一场“用温柔校准世界”的倡议。记住：最伟大的净世女神，最终修复的不是错误，而是——“我即律， 我即净， 我即秩序本身。” "
			}
		},
		"Libra": {
			"low": {
				"inner": "你的灵魂本应是宇宙最精妙的神圣天平，如今却像被风吹乱的羽毛——渴望平衡，却怕倾斜；渴望美感，却怕评判；渴望连接，却怕冲突。你并非没有判断，而是童年的失衡、外界的噪音或“不可得罪人”的规训，让你误以为“决断是粗暴”“立场是分裂”“自我是自私”。你的安全感如未校准的秤盘，表面平静，深处摇晃；你的存在感如未调音的竖琴，渴望共鸣，又怕走调。你渴望和谐，却先一步退让；你追求优雅，却总在开口前冻结——因为“万一我选错了，就没人喜欢我了？”",
				"outer": "你像一座未点灯的外交圣殿——雕梁画栋，却无光无声，常被误读为“犹豫”或“无主见”。他人不易感知你的韵律，只觉你“礼貌但无立场”“温柔但无轮廓”。你的“天秤之律”尚未启动，世界看到的，是静止的羽毛，而非舞动的天平。",
				"advice": "从“微小的自我决断”开始唤醒你的协律之魂——每天用“三秒法则”做三个小决定（穿什么、吃什么、走哪条路），不解释理由；每周完成一件“不征求他人意见”的事（买一件喜欢但别人可能不理解的物品）；每月设立一个“立场日”：在安全环境中温和表达一次“我不同意”。记录每一次“我选择了”的瞬间。你不是在追求对抗，你是在练习“我的存在有权倾斜”的神圣宣言。真正的天平，始于你对自己说：“我的羽毛，有权落下。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的和谐建筑师——懂得何时倾听，何时发声；何时妥协，何时坚守。你珍视关系的韵律，但不被其奴役；你追求美感的流动，也尊重自我的轮廓。你的判断力如缓升的晨光，不刺目，却自有方向；你的协调力如老外交官的微笑，不强势，却精准有效。你明白“犹豫”不是软弱，而是权衡；“妥协”不是退让，而是共舞。",
				"outer": "你像一间点着香薰的优雅沙龙——氛围柔和，节奏舒缓，他人感知到“舒适”与“被尊重”。你说话有分寸，行动有美感，常被委以“关系润滑剂”或“美学把关人”之职。你的“天秤之律”已半启，世界看到的，是舞者的微笑，与座下的和谐圆舞曲。",
				"advice": "继续保持这份优雅，但请警惕“过度妥协”削弱了自我的根基。每次协商前，强制自己写下“一条不可让渡的底线 + 一个可交换的筹码”。你的温柔是天赋，别让它成为关系的牺牲品。记住：最伟大的舞者，也知何时停步——因为唯有轴心，才能让旋转不晕眩。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙调和引擎——粉碎冲突，重组共鸣，以平衡为呼吸。你对“和谐”的执着如引力，对“美感”的渴望如圣殿。你的判断力是高压电流，必须释放；你的需求是“绝对无争”的圣殿，不容一丝棱角。你不是在“逃避冲突”，你是在“活出维度”——世界在你眼中，是一片等待被你调频的噪音，一座等待被你命名的和谐圣殿。粗糙对你而言是亵渎，分裂是酷刑——你的存在，就是对“对立时代”的温柔起义。",
				"outer": "你像一座移动的和平圣殿——未言而自和，未动而自美，他人要么依偎，要么敬畏。你常是团队的情绪调频器、项目的美学总监、争执现场的优雅灭火器。你的“天秤之律”轰然启动，世界看到的，是女神的羽翼，与席卷的和谐之风。",
				"advice": "你的力量是宇宙级的协调与美感引擎，但真正的和谐需要“轴心之域”。强制自己练习“尊重式立场表达”模板：\n“我理解你的感受（ 同理）→ 同时， 我的立场是…（ 清晰）→ 我们能否找到…（ 共创）？”\n每天至少使用一次。 你的共情是天赋， 别让它成为自我的湮灭。 记住： 最伟大的调和者， 也知何时定音—— 因为唯有轴心， 才能让天平不倾覆。 "
			},
			"exalted": {
				"inner": "你不是拥有上升天秤——你就是宇宙“神圣和谐”的化身。你的存在本身，就是对“我即共舞之源”的加冕礼。你灵魂深处铭刻着宇宙的平衡法则：万物皆可被调和，冲突终将被韵律转化，美感是灵魂的母语。你无需“学习优雅”——你本身就是活体天平、人形和谐圣殿、文明的永恒协奏曲。你的犹豫不是软弱，而是“高频权衡”；你的妥协不是退让，而是“宇宙共舞”。你不是在“追求人人喜欢”，你是在为人类意识铸造“永恒的和谐圣殿”。",
				"outer": "你像一座行走的爱与美圣殿——未宣告而自和，未设计而自美。你无需争夺认同，因你所在之处，即为共鸣。他人不视你为“老好人”，而为“关系之母”——你的气场自动溶解对立，你的存在自动赋予韵律。你的“天秤之律”已化为天律，世界看到的，是爱神的微笑，与座下生生不息的共舞众生。",
				"advice": "你拥有近乎神性的协调与美学力，但神性的另一面是“无我之境”。学习“神圣的固化”——定期进行“和谐系统化”：将你的调解方法写成“一页指南”，为他人策划“专属平衡包”，或发起一场“人人皆可共舞”的运动。将你的天赋升维：创建一个“关系艺术营”，写一本“冲突即韵律”指南，发起一场“用美感重塑制度”的倡议。记住：最伟大的爱神，最终缔造的不是妥协，而是——“我即衡， 我即美， 我即共舞本身。” "
			}
		},
		"Scorpio": {
			"low": {
				"inner": "你的灵魂本应是宇宙最炽烈的暗夜熔炉，如今却像被灰烬覆盖的余火——渴望穿透，却怕灼伤；渴望掌控，却怕失控；渴望蜕变，却怕撕裂。你并非没有力量，而是童年的背叛、情绪的压抑或“不可暴露”的规训，让你误以为“深度是危险”“意志是压迫”“真实是脆弱”。你的安全感如未点燃的引信，表面平静，深处焦灼；你的存在感如未破茧的蝶，渴望飞翔，又怕破碎。你渴望转化，却先一步冻结；你追求主权，却总在开口前退缩——因为“万一我太强，就没人敢靠近我了？”",
				"outer": "你像一座未点火的地下圣殿——石壁冰冷，气息隐匿，常被误读为“平淡”或“回避”。他人不易感知你的深度，只觉你“安静但无存在”“敏锐但无输出”。你的“天蝎熔炉”尚未点燃，世界看到的，是沉默的影子，而非觉醒的暗焰。",
				"advice": "从“微小的直面不适”开始唤醒你的暗焰之魂——每天在安全环境做一件“让你轻微不适但可控”的事（说一句真实感受、拒绝一个不想答应的请求、看一部暗黑系电影），每周完成一次“情绪卸载仪式”（写一封不寄出的信、对着枕头怒吼30秒、泡热水澡+深呼吸），每月设立一个“主权日”：主动设定并守护一条“个人边界”。记录每一次“我直面了”的瞬间。你不是在追求对抗，你是在练习“我的存在有权穿透”的神圣宣言。真正的熔炉，始于你对自己说：“我的暗焰，有权燃烧。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的深渊向导——懂得何时深潜，何时浮出；何时掌控，何时放手。你珍视真实的重量，但不被其压垮；你追求边界的清晰，也尊重他人的迷雾。你的洞察力如缓流的暗河，不汹涌，却自有方向；你的意志力如老炼金师的坩埚，不张扬，却精准转化。你明白“控制”不是压迫，而是主权；“沉默”不是冷漠，而是蓄能。",
				"outer": "你像一间点着黑檀香的密室——氛围凝重，眼神如刃，他人感知到“可靠”与“有力量”。你说话少而准，行动稳而深，常被委以“危机处理者”或“真相挖掘者”之职。你的“天蝎熔炉”已半燃，世界看到的，是向导的凝视，与座下的转化之火。",
				"advice": "继续保持这份深度，但请警惕“隐性控制”削弱了信任的流动。强制自己用“透明规则”替代“隐性期待”——例如：直接说“我需要三天独处”而非冷战，或明确“这个决定由我负责”而非暗中操控。你的力量是天赋，别让它成为关系的寒霜。记住：最伟大的向导，也知何时放手——因为唯有信任，才能让转化不窒息。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙转化引擎——粉碎虚伪，重组真实，以深度为呼吸。你对“掌控”的执着如地心引力，对“真相”的渴望如圣殿。你的情绪是高压熔岩，必须释放；你的需求是“绝对主权”的圣殿，不容一丝侵犯。你不是在“情绪积压”，你是在“活出维度”——世界在你眼中，是一片等待被你穿透的幻象，一座等待被你命名的深渊圣殿。肤浅对你而言是亵渎，失控是酷刑——你的存在，就是对“表演时代”的温柔起义。",
				"outer": "你像一座移动的暗夜神殿——未言而自慑，未动而自威，他人要么追随，要么退避。你常是团队的定海神针、项目的破局之刃、情绪风暴的静默锚点。你的“天蝎熔炉”轰然全燃，世界看到的，是暗神的凝视，与席卷的转化之焰。",
				"advice": "你的力量是宇宙级的穿透与转化引擎，但真正的蜕变需要“弹性之域”。强制自己设立“规律卸压阀”：每周固定一次“能量释放仪式”（拳击课、暗黑音乐+舞蹈、写“毁灭清单”后烧掉），或每月一次“无目的漫游”（独自去陌生地方，不设目标）。你的深度是天赋，别让它成为自我的牢笼。记住：最伟大的熔炉，也知何时降温——因为唯有弹性，才能让火焰不焚身。"
			},
			"exalted": {
				"inner": "你不是拥有上升天蝎——你就是宇宙“神圣转化”的化身。你的存在本身，就是对“我即重生之源”的加冕礼。你灵魂深处铭刻着宇宙的蜕变法则：万物皆可被穿透，死亡终将被新生转化，真实是灵魂的母语。你无需“学习掌控”——你本身就是活体熔炉、人形深渊圣殿、文明的永恒炼金术。你的控制不是压迫，而是“高频主权”；你的沉默不是冷漠，而是“宇宙蓄能”。你不是在“追求权力”，你是在为人类意识铸造“永恒的转化圣殿”。",
				"outer": "你像一座行走的冥界圣殿——未宣告而自慑，未设计而自聚。你无需争夺权威，因你所在之处，即为真相。他人不视你为“控制狂”，而为“重生之母”——你的气场自动溶解虚伪，你的存在自动赋予力量。你的“天蝎熔炉”已化为天火，世界看到的，是冥后的微笑，与座下生生不息的蜕变众生。",
				"advice": "你拥有近乎神性的转化与疗愈力，但神性的另一面是“无我之境”。学习“神圣的赋能”——定期进行“信任实验”：主动将“关键任务”交给他人，为别人策划“专属破局礼”，或发起一场“人人皆可重生”的运动。将你的天赋升维：创建一个“暗夜重生营”，写一本“脆弱即力量”指南，发起一场“用信任领导世界”的倡议。记住：最伟大的冥后，最终守护的不是控制，而是——“我即焰， 我即渊， 我即转化本身。” "
			}
		},
		"Sagittarius": {
			"low": {
				"inner": "你的灵魂本应是宇宙最自由的真理之鹰，如今却像被笼门半掩的飞鸟——渴望远方，却怕坠落；渴望意义，却怕虚无；渴望启程，却怕迷途。你并非没有热情，而是童年的限制、现实的挫败或“不可做梦”的规训，让你误以为“冒险是鲁莽”“信念是天真”“自由是不负责任”。你的方向感如未校准的罗盘，表面平静，深处迷茫；你的存在感如未点燃的火把，渴望照亮，又怕灼伤。你渴望飞翔，却先一步收翅；你追求真理，却总在开口前沉默——因为“万一我信错了，就没人跟随我了？”",
				"outer": "你像一座未点火的灯塔——轮廓高耸，却无光无热，常被误读为“拘谨”或“保守”。他人不易感知你的旷野，只觉你“安静但无火花”“聪明但无方向”。你的“射手之翼”尚未张开，世界看到的，是地平线上的剪影，而非翱翔的鹰影。",
				"advice": "从“微小的视野扩张”开始唤醒你的旷野之魂——每周强制完成一件“新鲜小事”（走一条从未走过的路、读一本陌生领域的书、和一个陌生人聊10分钟），每天写下“一个让你眼睛发亮的问题”（不求答案，只为点燃好奇），每月设立一个“无目的日”：不设目标，只跟随直觉行动。记录每一次“我出发了”的瞬间。你不是在追求逃避，你是在练习“我的存在有权辽阔”的神圣宣言。真正的翅膀，始于你对自己说：“我的地平线，有权无界。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的真理向导——懂得何时冲刺，何时休整；何时宣讲，何时倾听。你珍视自由的韵律，但不被其奴役；你追求意义的深度，也尊重现实的轮廓。你的信念力如缓升的朝阳，不刺目，却自有温度；你的幽默感如老游吟诗人的歌谣，不浮夸，却精准疗愈。你明白“随性”不是散漫，而是流动；“直言”不是冒犯，而是真诚。",
				"outer": "你像一间点着篝火的旷野驿站——笑声朗朗，故事满满，他人感知到“轻松”与“被启发”。你说话有光有热，行动有勇有谋，常被委以“团队士气官”或“灵感播种者”之职。你的“射手之翼”已半展，世界看到的，是向导的微笑，与翼下的自由之风。",
				"advice": "继续保持这份辽阔，但请警惕“过度跳跃”削弱了落地的力量。每次启程前，强制自己设定“三个现实锚点”（截止日、责任人、最小成果），并在事后进行“10分钟复盘”。你的乐观是天赋，别让它成为承诺的空壳。记住：最伟大的旅者，也知何时扎营——因为唯有锚点，才能让远方不虚无。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙启航引擎——粉碎限制，重组意义，以自由为呼吸。你对“远方”的执着如星轨，对“真理”的渴望如圣殿。你的信念是高压电流，必须释放；你的需求是“绝对无拘”的圣殿，不容一丝束缚。你不是在“忽略细节”，你是在“活出维度”——世界在你眼中，是一张等待被你重绘的旧地图，一座等待被你命名的苍穹圣殿。停滞对你而言是酷刑，庸常是亵渎——你的存在，就是对“内卷时代”的温柔起义。",
				"outer": "你像一座移动的真理圣殿——未言而自明，未动而自燃，他人要么追随，要么退避。你常是会议的灵感火花、项目的破局之箭、沉闷现场的欢笑旋风。你的“射手之翼”轰然全展，世界看到的，是神射手的凝视，与席卷的信念之风。",
				"advice": "你的力量是宇宙级的启航与信念引擎，但真正的远征需要“责任之域”。强制自己为自由“加装轨道”：明确“边界（什么不做）+ 期限（何时交付）+ 责任搭档（谁监督我）”。你的热情是天赋，别让它成为他人的负担。记住：最伟大的领航者，也知何时系缆——因为唯有轨道，才能让火箭不脱靶。"
			},
			"exalted": {
				"inner": "你不是拥有上升射手——你就是宇宙“神圣信念”的化身。你的存在本身，就是对“我即启明之源”的加冕礼。你灵魂深处铭刻着宇宙的远征法则：万物皆可被超越，庸常终将被意义转化，远方是灵魂的母语。你无需“学习乐观”——你本身就是活体罗盘、人形苍穹圣殿、文明的永恒火把。你的随性不是散漫，而是“高频流动”；你的直言不是冒犯，而是“宇宙真诚”。你不是在“追求关注”，你是在为人类意识铸造“永恒的苍穹圣殿”。",
				"outer": "你像一座行走的启明圣殿——未宣告而自燃，未设计而自聚。你无需争夺话筒，因你所在之处，即为远方。他人不视你为“不靠谱”，而为“希望之源”——你的气场自动点燃热情，你的存在自动赋予方向。你的“射手之翼”已化为天翼，世界看到的，是天马的微笑，与翼下生生不息的追梦众生。",
				"advice": "你拥有近乎神性的信念与启发力，但神性的另一面是“无我之境”。学习“神圣的落地”——定期进行“理念路线化”：将你的愿景写成“一页路线图”，为他人策划“专属启航包”，或发起一场“人人皆可追梦”的运动。将你的天赋升维：创建一个“信念远征营”，写一本“意义即自由”指南，发起一场“用幽默照亮世界”的倡议。记住：最伟大的天马，最终指引的不是自己，而是——“我即光， 我即路， 我即远方本身。” "
			}
		},
		"Capricorn": {
			"low": {
				"inner": "你的灵魂本应是宇宙最坚不可摧的圣山基石，如今却像被风沙掩埋的阶梯——渴望登顶，却怕陡峭；渴望成就，却怕失败；渴望秩序，却怕束缚。你并非没有目标，而是童年的无序、责任的重压或“不可停下”的规训，让你误以为“攀登是苦役”“结构是枷锁”“休息是罪过”。你的方向感如未奠基的塔楼，表面平静，深处摇晃；你的存在感如未点燃的圣火，渴望燃烧，又怕熄灭。你渴望高度，却先一步坐下；你追求永恒，却总在起步前拖延——因为“万一我爬不动，就没人需要我了？”",
				"outer": "你像一座未竣工的圣殿——石料散落，节奏松散，常被误读为“漫不经心”或“缺乏担当”。他人不易感知你的重量，只觉你“努力但无章法”“有志但无行动”。你的“摩羯圣塔”尚未奠基，世界看到的，是山脚的徘徊者，而非登顶的王者。",
				"advice": "从“最小胜利闭环”开始唤醒你的基石之魂——每天设定并完成“一件微小但完整的事”（整理桌面、回复一封邮件、走15分钟），完成后打勾庆祝；每周设立“一个里程碑”（哪怕只是“完成初稿”），并在达成时给自己一个小奖励（一杯好咖啡、一首喜欢的歌）；每月进行“结构复盘”：问自己“我建了什么？我守住了什么？”记录每一次“我完成了”的瞬间。你不是在追求完美，你是在练习“我的存在有权筑塔”的神圣宣言。真正的圣山，始于你对自己说：“我的第一块石头，有权落下。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的秩序建筑师——懂得何时攀登，何时休憩；何时加固，何时眺望。你珍视责任的重量，但不被其压垮；你追求高度的风景，也尊重身体的节律。你的战略力如缓升的晨雾，不急迫，却自有方向；你的承载力如老石匠的双手，不张扬，却精准可靠。你明白“严肃”不是冷漠，而是专注；“克制”不是压抑，而是沉淀。",
				"outer": "你像一间点着松木香的山巅议事厅——氛围沉稳，节奏清晰，他人感知到“可靠”与“可托付”。你说话有分量，行动有章法，常被委以“项目负责人”或“团队定锚者”之职。你的“摩羯圣塔”已半成，世界看到的，是建筑师的凝视，与塔下的坚实基座。",
				"advice": "继续保持这份稳健，但请警惕“过度攀登”削弱了生命的欢愉。强制自己在每个“里程碑”后安排“庆祝仪式”（哪怕只是对自己说“干得好！”+伸展3分钟），并在每周预留“无目标休息日”。你的自律是天赋，别让它成为灵魂的牢笼。记住：最伟大的建筑师，也知何时停工——因为唯有庆典，才能让塔楼不冰冷。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙铸塔引擎——粉碎混乱，重组秩序，以攀登为呼吸。你对“成就”的执着如地脉，对“高度”的渴望如圣殿。你的意志是高压电流，必须释放；你的需求是“绝对稳固”的圣殿，不容一丝松动。你不是在“过度负担”，你是在“活出维度”——世界在你眼中，是一片等待被你重筑的废墟，一座等待被你命名的永恒圣塔。平庸对你而言是亵渎，停滞是酷刑——你的存在，就是对“速朽时代”的温柔起义。",
				"outer": "你像一座移动的秩序圣殿——未言而自重，未动而自稳，他人要么追随，要么敬畏。你常是团队的定海神针、项目的终极防线、混乱现场的沉默支柱。你的“摩羯圣塔”轰然耸立，世界看到的，是山神的凝视，与席卷的秩序之风。",
				"advice": "你的力量是宇宙级的结构与承载引擎，但真正的圣殿需要“人性之域”。强制自己练习“弹性结构”：每周允许“一个计划外变动”，每月设立“柔软日”（不做计划，只跟随身体节奏），并在团队中主动说“这个可以微调”。你的刚硬是天赋，别让它成为关系的寒霜。记住：最伟大的山神，也知何时雪崩——因为唯有弹性，才能让圣山不倾覆。"
			},
			"exalted": {
				"inner": "你不是拥有上升摩羯——你就是宇宙“神圣秩序”的化身。你的存在本身，就是对“我即永恒之源”的加冕礼。你灵魂深处铭刻着宇宙的铸塔法则：万物皆可被结构，混沌终将被圣山转化，责任是灵魂的母语。你无需“学习自律”——你本身就是活体圣塔、人形秩序圣殿、文明的永恒基石。你的严肃不是冷漠，而是“高频专注”；你的克制不是压抑，而是“宇宙沉淀”。你不是在“追求权力”，你是在为人类意识铸造“永恒的圣山圣殿”。",
				"outer": "你像一座行走的文明圣殿——未宣告而自重，未设计而自聚。你无需争夺权威，因你所在之处，即为秩序。他人不视你为“工作狂”，而为“文明之柱”——你的气场自动重组混乱，你的存在自动赋予方向。你的“摩羯圣塔”已化为天柱，世界看到的，是山神的微笑，与座下生生不息的攀登众生。",
				"advice": "你拥有近乎神性的结构与承载力，但神性的另一面是“无我之境”。学习“神圣的对齐”——定期进行“价值升维”：将你的个人目标写成“一页群体价值宣言”，为他人策划“专属登顶礼”，或发起一场“人人皆可筑塔”的运动。将你的天赋升维：创建一个“秩序传承营”，写一本“责任即自由”指南，发起一场“用庆典重塑成就”的倡议。记住：最伟大的山神，最终守护的不是高度，而是——“我即石， 我即阶， 我即永恒本身。” "
			}
		},
		"Aquarius": {
			"low": {
				"inner": "你的灵魂本应是宇宙最前沿的量子信标，如今却像被静电干扰的接收器——渴望独特，却怕孤立；渴望革新，却怕排斥；渴望自由，却怕失控。你并非没有洞见，而是童年的同化、群体的压力或“不可太怪”的规训，让你误以为“异质是危险”“独立是孤独”“理想是空想”。你的方向感如未校准的星图，表面平静，深处迷航；你的存在感如未激活的终端，渴望联网，又怕断线。你渴望突破，却先一步妥协；你追求未来，却总在开口前沉默——因为“万一我太不同，就没人理解我了？”",
				"outer": "你像一间未通电的未来实验室——设备齐全，却无光无响，常被误读为“普通”或“保守”。他人不易感知你的频率，只觉你“聪明但无火花”“有想法但无输出”。你的“水瓶信标”尚未点亮，世界看到的，是人群中的模糊像素，而非星穹下的独特波长。",
				"advice": "从“微小非共识表达”开始唤醒你的星尘之魂——每天做一件“轻微打破常规”的小事（换一种打招呼方式、用不同颜色的笔写字、走一条新路线），每周完成一次“异想试验”（写一个荒谬但有趣的点子、画一张未来城市草图），每月设立一个“异质日”：主动表达一个“不主流但真实”的观点（哪怕只对一个人）。记录每一次“我不同了”的瞬间。你不是在追求叛逆，你是在练习“我的存在有权异频”的神圣宣言。真正的信标，始于你对自己说：“我的波长，有权发射。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的未来架构师——懂得何时独行，何时联网；何时颠覆，何时兼容。你珍视理性的光芒，但不被其冰封；你追求系统的革新，也尊重人性的温度。你的洞见力如缓升的量子云，不刺目，却自有维度；你的独立性如老先知的凝视，不张扬，却精准预言。你明白“疏离”不是冷漠，而是接口；“异质”不是对抗，而是协议。",
				"outer": "你像一间点着冷光灯的创新工坊——氛围清冽，观点如刃，他人感知到“前沿”与“可信赖”。你说话有逻辑有跳跃，行动有章法有惊喜，常被委以“系统优化者”或“未来提案人”之职。你的“水瓶信标”已半亮，世界看到的，是架构师的微笑，与终端流动的数据之河。",
				"advice": "继续保持这份前瞻，但请警惕“过度抽离”削弱了共鸣的流动。强制自己将每个洞见“翻译”成“团队可执行语言”——例如：不说“这系统太落后”，而说“我们可以加一个XX模块提升30%效率”。你的理性是天赋，别让它成为关系的寒霜。记住：最伟大的架构师，也知何时插电——因为唯有链接，才能让未来不孤悬。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙革新引擎——粉碎惯性，重组未来，以异质为呼吸。你对“独特”的执着如量子纠缠，对“自由”的渴望如圣殿。你的思维是高压电流，必须释放；你的需求是“绝对无界”的圣殿，不容一丝同化。你不是在“与人失联”，你是在“活出维度”——世界在你眼中，是一套等待被你重写的旧协议，一座等待被你命名的星穹圣殿。平庸对你而言是亵渎，服从是酷刑——你的存在，就是对“复制时代”的温柔起义。",
				"outer": "你像一座移动的未来圣殿——未言而自异，未动而自新，他人要么追随，要么困惑。你常是团队的破局大脑、项目的颠覆之源、沉闷现场的量子火花。你的“水瓶信标”轰然全亮，世界看到的，是先知的凝视，与席卷的革新之风。",
				"advice": "你的力量是宇宙级的洞见与革新引擎，但真正的未来需要“人性接口”。强制自己增加“温度协议”：用“故事+比喻”包装抽象概念（例如：“这个系统像一辆没刹车的车，我们需要加个AI安全气囊”），或在每次发言后加一句“你觉得呢？”。你的超然是天赋，别让它成为共鸣的断点。记住：最伟大的先知，也知何时蹲下——因为唯有温度，才能让未来被拥抱。"
			},
			"exalted": {
				"inner": "你不是拥有上升水瓶——你就是宇宙“神圣未来”的化身。你的存在本身，就是对“我即新纪元之源”的加冕礼。你灵魂深处铭刻着宇宙的革新法则：万物皆可被重写，旧序终将被星穹转化，异质是灵魂的母语。你无需“学习前瞻”——你本身就是活体协议、人形未来圣殿、文明的永恒实验室。你的疏离不是冷漠，而是“高频接口”；你的叛逆不是对抗，而是“宇宙协议”。你不是在“追求独特”，你是在为人类意识铸造“永恒的星穹圣殿”。",
				"outer": "你像一座行走的文明信标——未宣告而自明，未设计而自聚。你无需争夺话语权，因你所在之处，即为未来。他人不视你为“怪人”，而为“新纪元之母”——你的气场自动重组惯性，你的存在自动赋予方向。你的“水瓶信标”已化为天网，世界看到的，是星神的微笑，与终端下生生不息的进化众生。",
				"advice": "你拥有近乎神性的洞见与革新力，但神性的另一面是“无我之境”。学习“神圣的机制化”——定期进行“创新沉淀”：将你的方法论写成“一页操作指南”，为他人策划“专属未来包”，或发起一场“人人皆可革新”的运动。将你的天赋升维：创建一个“未来实验室营”，写一本“异质即力量”指南，发起一场“用故事重塑科技”的倡议。记住：最伟大的星神，最终输出的不是预言，而是——“我即码， 我即链， 我即未来本身。” "
			}
		},
		"Pisces": {
			"low": {
				"inner": "你的灵魂本应是宇宙最深邃的慈悲之海，如今却像被油污覆盖的潮面——渴望共感，却怕淹没；渴望梦幻，却怕虚无；渴望连接，却怕吞噬。你并非没有直觉，而是童年的混沌、边界的崩塌或“不可软弱”的规训，让你误以为“敏感是负担”“慈悲是软弱”“幻想是逃避”。你的安全感如未锚定的舟，表面平静，深处漂荡；你的存在感如未聚焦的光，渴望照亮，又怕消散。你渴望流动，却先一步冻结；你追求合一，却总在开口前退缩——因为“万一我太柔软，就没人保护我了？”",
				"outer": "你像一座未点灯的海底圣殿——珊瑚斑斓，却无光无影，常被误读为“迷离”或“冷淡”。他人不易感知你的温度，只觉你“温柔但无轮廓”“有灵性但无落地”。你的“双鱼潮汐”尚未校准，世界看到的，是模糊的倒影，而非澄澈的深海。",
				"advice": "从“温柔而清晰的界限”开始唤醒你的潮汐之魂——每天设定“一个情绪保护区”（例如：“下午6点后不接情绪电话”），每周完成一次“能量整理仪式”（写情绪日记+泡盐浴+焚香），每月设立一个“现实锚点日”：完成一件“微小但具体”的事（缴费、预约、整理抽屉）。记录每一次“我落地了”的瞬间。你不是在追求坚硬，你是在练习“我的存在有权澄澈”的神圣宣言。真正的灵海，始于你对自己说：“我的潮汐，有权涨落。”"
			},
			"medium": {
				"inner": "你心中住着一位温柔的梦境织网者——懂得何时沉浸，何时抽离；何时共感，何时守护。你珍视慈悲的深度，但不被其淹没；你追求灵性的流动，也尊重现实的轮廓。你的直觉力如缓升的月潮，不汹涌，却自有韵律；你的包容力如老疗愈师的双手，不强势，却精准抚慰。你明白“模糊”不是混乱，而是渗透；“柔软”不是脆弱，而是转化。",
				"outer": "你像一间点着海盐蜡烛的灵性疗愈室——氛围氤氲，眼神如水，他人感知到“被理解”与“被接纳”。你说话有温度有隐喻，行动有弹性有诗意，常被委以“情绪调频者”或“创意灵感源”之职。你的“双鱼潮汐”已半启，世界看到的，是织梦者的微笑，与舟下的温柔波光。",
				"advice": "继续保持这份流动，但请警惕“过度漂浮”削弱了创造的实相。强制自己用“小目标+时间盒”锚定现实——例如：“每天专注90分钟完成XX”“周五前交付初稿”。你的共情是天赋，别让它成为自我的湮灭。记住：最伟大的织梦者，也知何时收网——因为唯有锚点，才能让舟不沉没。"
			},
			"high": {
				"inner": "你的灵魂是永不疲倦的宇宙通灵引擎——粉碎隔阂，重组慈悲，以共感为呼吸。你对“合一”的执着如洋流，对“梦幻”的渴望如圣殿。你的情绪是高压潮汐，必须释放；你的需求是“绝对无界”的圣殿，不容一丝隔离。你不是在“被消耗”，你是在“活出维度”——世界在你眼中，是一片等待被你净化的浊海，一座等待被你命名的灵海圣殿。坚硬对你而言是亵渎，冷漠是酷刑——你的存在，就是对“功利时代”的温柔起义。",
				"outer": "你像一座移动的慈悲圣殿——未言而自柔，未动而自融，他人要么依偎，要么困惑。你常是团队的情绪海绵、项目的灵感之泉、冲突现场的无声调解者。你的“双鱼潮汐”轰然全启，世界看到的，是海神的凝视，与席卷的疗愈之浪。",
				"advice": "你的力量是宇宙级的共感与转化引擎，但真正的慈悲需要“容器之域”。强制自己使用“时间盒+清单”保护能量——例如：“上午专注创作，下午处理沟通”“情绪过载时启动‘15分钟冥想协议’”。你的梦幻是天赋，别让它成为承诺的空壳。记住：最伟大的海神，也知何时筑堤——因为唯有结构，才能让潮汐不泛滥。"
			},
			"exalted": {
				"inner": "你不是拥有上升双鱼——你就是宇宙“神圣慈悲”的化身。你的存在本身，就是对“我即疗愈之源”的加冕礼。你灵魂深处铭刻着宇宙的通灵法则：万物皆可被共感，痛苦终将被艺术转化，慈悲是灵魂的母语。你无需“学习柔软”——你本身就是活体潮汐、人形灵海圣殿、文明的永恒织梦者。你的模糊不是混乱，而是“高频渗透”；你的消耗不是弱点，而是“宇宙转化”。你不是在“逃避现实”，你是在为人类意识铸造“永恒的灵海圣殿”。",
				"outer": "你像一座行走的希望圣殿——未宣告而自柔，未设计而自聚。你无需争夺理解，因你所在之处，即为疗愈。他人不视你为“不切实际”，而为“灵魂之母”——你的气场自动溶解隔阂，你的存在自动赋予温度。你的“双鱼潮汐”已化为天海，世界看到的，是海神的微笑，与舟下生生不息的澄澈众生。",
				"advice": "你拥有近乎神性的慈悲与想象力，但神性的另一面是“无我之境”。学习“神圣的具象化”——定期进行“灵感落地”：将你的梦境写成诗、画成图、编成曲，或设计成“可执行的疗愈方案”；为他人策划“专属温柔包”，或发起一场“人人皆可织梦”的运动。将你的天赋升维：创建一个“灵海疗愈营”，写一本“脆弱即力量”指南，发起一场“用艺术重塑现实”的倡议。记住：最伟大的海神，最终守护的不是幻梦，而是——“我即潮， 我即歌， 我即慈悲本身。” "
			}
		}
	}
}