{
  "planet_in_house": {
    "moon": {
      "1": {
        "low": "你的情绪较为内敛，不易在外在展现，倾向于自我保护，可能会显得冷淡或神秘，挑战在于打开心扉，建立更亲密的连接。",
        "medium": "你的外在形象带有敏感和温柔的气质，他人能感受到你的情绪波动，这让你在社交中更容易产生共鸣，但需注意情绪的稳定性，以免影响第一印象。",
        "high": "你常常将情绪直接表现在脸上，极具感染力，能轻易影响周围的人，这带来强烈的个人魅力，但可能导致情绪过载，需要学会边界管理。",
        "exalted": "你的情绪表达极具感染力和深度，外在与内在情感高度统一，能轻易唤起他人的共鸣，成为情感领袖，但需平衡以避免过度敏感。"
      },
      "2": {
        "low": "在金钱和安全感上，你可能过度依赖他人，缺乏内在稳定，容易因物质变动而情绪低落，建议通过自我价值建设来增强自信。",
        "medium": "你将情感投入物质和价值领域，追求生活中的安全与舒适，这让你在财务管理上更有耐心，但需避免情绪化消费。",
        "high": "你对财富和自我价值有强烈的 emotional 需求，积极建立安全基础，这带来物质丰裕，但可能导致对拥有的执着。",
        "exalted": "你的敏感转化为强大的养护能力，能为自己和他人创造稳定的环境，在价值领域表现出极强的直觉和持久力。"
      },
      "3": {
        "low": "沟通时你容易情绪化，导致表达不够清晰或频繁改变主意，挑战在于学习理性表达，以改善人际互动。",
        "medium": "你常在交流中融入情感，使言语真诚而动人，这有助于学习和短期关系，但需注意情绪对思维的影响。",
        "high": "你的学习和表达充满情绪张力，能深刻影响他人，带来富有想象力的沟通，但可能导致过度敏感于反馈。",
        "exalted": "你的言语承载丰富情感，具有诗意或艺术般的感染力，在沟通领域表现出极强的直觉和创意天赋。"
      },
      "4": {
        "low": "家庭关系中你显得依赖，缺乏独立性，容易因过去回忆而情绪波动，建议通过建立个人界限来增强根基感。",
        "medium": "你的情绪深深根植于家庭环境，家庭成为情感安全的来源，这让你在根基建设上更有耐心和关怀。",
        "high": "你在家庭中扮演情感核心角色，强烈需要家庭支持，这带来温暖的连结，但可能导致对过去的执着。",
        "exalted": "你能在家庭中营造强大的情感连结，甚至成为家族的心灵支柱，在根基领域表现出极强的滋养和保护力。"
      },
      "5": {
        "low": "在恋爱与创造中你的情感表达较拘谨，可能不敢充分展现自我，挑战在于释放内在激情以增强创意。",
        "medium": "你通过恋爱和创造表达情感，追求真诚而浪漫的互动，这让你在娱乐领域更有想象力。",
        "high": "你的情绪在恋爱与创作中极为强烈，容易吸引他人注意，带来充满活力的表达，但需避免戏剧化。",
        "exalted": "你的情感天赋赋予你艺术与创造的力量，在爱情中表现极具魅力和感染力，能激发他人灵感。"
      },
      "6": {
        "low": "在日常事务中你容易被情绪左右，影响工作效率和健康，建议通过 routine 来稳定情感。",
        "medium": "你通过工作与服务满足情感需求，在健康管理上更有关怀，但需注意情绪对身体的影响。",
        "high": "你在日常工作中倾注情感，容易与同事建立亲密关系，这带来奉献精神，但可能导致精疲力竭。",
        "exalted": "你的情感滋养使你在服务与疗愈领域具备天然的影响力，表现出极强的关怀和效率。"
      },
      "7": {
        "low": "在亲密关系中你过于依赖伴侣，容易缺乏独立，挑战在于平衡给与拿。",
        "medium": "你需要在伴侣关系中获得情感平衡，通过合作满足内在需求。",
        "high": "你的情绪在亲密关系中扮演强势角色，影响伴侣互动，带来深厚的连结。",
        "exalted": "你的情感在伴侣关系中展现出极强的融合力，能建立深度而和谐的连结。"
      },
      "8": {
        "low": "面对亲密或转化性事件时你感到不安或脆弱，容易回避深度情感，建议通过心理学探索。",
        "medium": "你在情感上渴望深层的亲密与转化，这让你在共享资源中更有直觉。",
        "high": "你在情感与亲密关系中极度强烈，容易经历深刻的变化，带来再生潜力。",
        "exalted": "你的情感极具再生与疗愈力，能在深层关系中发挥巨大作用和影响力。"
      },
      "9": {
        "low": "在精神与远方事务上你的情感投入较少，缺乏热情，容易感到迷失。",
        "medium": "你通过探索文化、哲学或远方来满足情感需求，追求更高的意义。",
        "high": "你的情绪与精神追求紧密结合，富有理想主义色彩，在旅行中寻找慰藉。",
        "exalted": "你能将情感与哲思结合，表现出深刻的智慧与信念，在探索中找到内在和平。"
      },
      "10": {
        "low": "在事业中你缺乏情感投入，可能感到不安或不满足，建议寻找有意义的工作。",
        "medium": "你把情感寄托于事业与社会地位的追求，通过成就获得安全感。",
        "high": "你的情绪推动你在事业中表现突出，影响公众印象，带来领导潜力。",
        "exalted": "你能将情感力量转化为事业动力，成为公众情感的承载者和激励者。"
      },
      "11": {
        "low": "在群体关系中你容易感到疏离或孤独，情感需求未满足。",
        "medium": "你把情感投入到朋友与社群之中，通过社交获得归属感。",
        "high": "你的情绪在群体中极具感染力，能成为社交核心和凝聚力。",
        "exalted": "你的情感与社群紧密结合，能够为集体带来温暖与支持的强大力量。"
      },
      "12": {
        "low": "在潜意识和隐秘层面你的情绪不稳定，容易自我困扰或逃避现实。",
        "medium": "你的情感与潜意识相连，需要独处来消化和反思内在世界。",
        "high": "你在隐秘与精神层面有强烈的情绪体验，常带来深刻的精神洞见。",
        "exalted": "你的情绪与集体潜意识高度融合，具备直觉与疗愈的非凡天赋。"
      }
    },
    "sun": {
      "1": {
        "low": "你的自我表达往往较为低调和内敛，不太倾向于在人群中崭露头角，这可能会让他人觉得你有些神秘或难以接近，建议通过逐渐参与社交活动来增强自信并展现内在光芒。",
        "medium": "你喜欢通过外在形象来体现自己的核心个性，注重个人风格和第一印象的营造，这让你在初次见面时给人留下稳重而可靠的感觉，但需注意不要过度关注表面而忽略内在深度。",
        "high": "你的个性强烈而自信，外在形象充满活力和魅力，能够自然而然地成为关注的焦点，这带来强大的领导潜力，但也可能导致自负倾向，需要学会谦逊以维持人际平衡。",
        "exalted": "你的自我表达极具领导力和感染力，外在形象像太阳般耀眼，能激励和影响周围的人，成为自然而然的榜样，但需警惕不要过度支配他人，而应以温暖的方式引导。"
      },
      "2": {
        "low": "在物质和价值领域，你的自我认同感较为薄弱，容易对自己的价值产生疑问，这可能会导致在财务决策时犹豫不决，建议通过设定小目标积累成就来重建内在信心。",
        "medium": "你将核心自我与财富和自我价值紧密联结，追求物质上的稳定和成就，这让你在财务管理中表现出务实的一面，但需避免将所有满足感都寄托于外在拥有。",
        "high": "你对财富和个人价值有强烈的认同感，积极主动地去建立和维护安全基础，这往往带来丰裕的生活和自我满足，但也可能导致对物质的过度执着，需要平衡精神追求。",
        "exalted": "你的自我通过物质稳定展现出极强的自信与丰裕感，能够自然吸引资源和机会，成为财富的守护者，但记得通过分享来避免贪婪，转化成更高的成长。"
      },
      "3": {
        "low": "沟通和学习中，你的自我表达较为拘谨，不太善于公开分享想法，这可能会让你显得内向或不自信，建议通过写作或小群体讨论逐步打开表达渠道。",
        "medium": "你喜欢通过学习和交流来展现自我，思维活跃而好奇，这让你在短期互动和知识获取中感到充实，但需注意深度而非广度，以避免浅尝辄止。",
        "high": "你的个性通过沟通和智力闪耀而出，能够深刻影响他人的想法和观点，这带来强烈的表达力和领导魅力，但可能导致过于啰嗦，需要学会倾听。",
        "exalted": "你的表达具有天才般的魅力和感染力，能轻易影响和启发他人，在学习领域如鱼得水，成为思想的传播者和创新者，但需保持谦虚以避免自大。"
      },
      "4": {
        "low": "家庭和根基领域，你的自我认同较为薄弱，容易因过去经历而自疑，这可能会影响内在安全感，建议通过家庭疗愈或回忆整理来重建基础。",
        "medium": "你将核心自我根植于家庭环境，注重情感基础和归属感，这让你在建立根基时更有耐心和关怀，但需平衡家庭与个人独立。",
        "high": "你在家庭中扮演核心角色，强烈认同自己的根源和遗产，这带来温暖而稳定的连结，但可能导致对传统的过度执着，需要灵活适应变化。",
        "exalted": "你的自我在家庭中展现出极强的领导与保护力，成为家族的支柱和情感中心，能通过滋养他人实现内在成长，但需避免过度负担。"
      },
      "5": {
        "low": "在创造和恋爱领域，你的自我表达较为保守，缺乏热情和冒险精神，这可能会让你显得拘谨，建议通过艺术或兴趣爱好释放内在活力。",
        "medium": "你通过创意和浪漫来展现自我，追求生活中的乐趣和表达，这让你在娱乐和恋爱中感到充实，但需注意深度而非表面。",
        "high": "你的个性在恋爱与创作中极为耀眼，充满活力和魅力，这带来强烈的吸引力和创意潜力，但可能导致戏剧化倾向，需要平衡理性。",
        "exalted": "你的自我表达充满艺术天赋和感染力，成为创意之源，在浪漫中表现出极高的魅力，能启发他人，但需保持真实以避免浮夸。"
      },
      "6": {
        "low": "在工作和健康领域，你的自我认同较低，容易忽视细节和日常效率，这可能会导致倦怠，建议通过日常建立结构来增强自信。",
        "medium": "你通过服务和工作来建立自我价值，注重实用和奉献，这让你在日常管理中更有纪律和责任感，但需避免完美主义。",
        "high": "你在日常事务中展现强烈个性，注重效率和专业，这带来强大的奉献精神和成就感，但可能导致工作狂倾向，需要休息平衡。",
        "exalted": "你的自我在服务中表现出极高的奉献与领导力，成为健康和工作的典范，能通过高效帮助他人，但需关注自身福祉。"
      },
      "7": {
        "low": "在关系领域，你的自我认同依赖他人，容易妥协过多而失去独立，这可能会导致不平衡，建议通过自我反思找回中心。",
        "medium": "你通过伴侣关系定义自我，追求和谐与合作，这让你在互动中更注重平衡和互惠，但需避免依存关系。",
        "high": "你的个性在亲密关系中主导，影响伙伴动态，这带来强烈的连结和领导力，但可能导致控制欲，需要学会放手。",
        "exalted": "你的自我在关系中展现出极强的和谐与魅力，能建立深度而平衡的伙伴关系，成为情感的调解者和支持者。"
      },
      "8": {
        "low": "面对转化事件时，你的自我认同脆弱，容易回避深度和亲密主题，这可能会阻碍成长，建议通过心理咨询探索阴影。",
        "medium": "你通过亲密与转化探索自我，追求情感深度，这让你在共享资源中更有洞察，但需管理占有欲。",
        "high": "你的个性在深层关系中强烈再生，带来强大潜力和转变力，但可能导致情绪过于强烈，需要平衡控制。",
        "exalted": "你的自我在转化中表现出极强的力量与深度，能在亲密中实现再生和疗愈，成为变革的催化剂。"
      },
      "9": {
        "low": "在精神探索中，你的自我认同弱，缺乏冒险精神和热情，容易感到迷失，建议通过阅读扩展视野。",
        "medium": "你通过哲学和旅行扩展自我，追求更高的意义，这让你在知识获取中感到充实，但需避免极端化。",
        "high": "你的个性在远方追求中耀眼，充满乐观和视野，这带来强烈的探索力和成长，但可能导致躁动不安。",
        "exalted": "你的自我表达在哲思中极具智慧，成为精神导师和探索者，能启发他人追求真理。"
      },
      "10": {
        "low": "在事业中，你的自我认同不强，容易缺乏野心和动力，这可能会延缓成就，建议设定长期目标。",
        "medium": "你通过成就和形象定义自我，追求社会地位，这让你在职业中更注重认可和结构。",
        "high": "你的个性在公众中强势表现，带来领导力和影响力，但可能导致高压力，需要管理精疲力竭。",
        "exalted": "你的自我在事业中展现极强的领导与成功，成为公众榜样和激励者。"
      },
      "11": {
        "low": "在群体中，你的自我认同低调，容易感到疏离或不合群，这可能会限制社交，建议参与团体活动。",
        "medium": "你通过社交和愿望展现自我，追求理想网络，这让你在集体中更注重创新和合作。",
        "high": "你的个性在团体中成为焦点，充满创新和变革力，但可能导致叛逆，需要平衡团队。",
        "exalted": "你的自我在社群中表现出极强的创新与凝聚力，成为变革者和人道主义者。"
      },
      "12": {
        "low": "在潜意识中，你的自我认同模糊，容易自我怀疑或逃避现实，这可能会导致孤立感，建议通过冥想来面对。",
        "medium": "你通过内在精神探索自我，注重潜意识和隐秘主题，这让你在精神领域更有深度。",
        "high": "你的个性在隐秘中深刻闪耀，带来直觉潜力和启示，但需面对阴影自我。",
        "exalted": "你的自我在精神领域展现出极强的直觉与启示，成为内在导师和疗愈者。"
      }
    },
    "mercury": {
      "1": {
        "low": "你的思维表达较为保守，外在形象不善沟通，容易显得拘谨或不自信，这可能会让你在初次互动中失去机会，建议通过多阅读和练习来打开表达渠道。",
        "medium": "你通过智力展现外在形象，注重表达和第一印象的营造，这让你在社交中更显机智和聪明，但需避免过多思考而延误行动。",
        "high": "你的沟通能力在外在中强势，形象聪明而有魅力，能轻易影响他人想法，这带来强大的说服力，但可能导致过于巧舌如簧，需要注重诚实。",
        "exalted": "你的思维在外在表达中极具魅力与机智，成为社交中的焦点和调解者，能通过智慧的话语化解冲突和启发他人。"
      },
      "2": {
        "low": "在财务领域你的思维混乱，价值判断不准，容易犯下小错误或犹豫不决，建议通过系统学习来提升分析能力。",
        "medium": "你将智力投入物质与价值管理，追求务实规划，这让你在财务决策中更注重细节和效率。",
        "high": "你的思维在财富中展现强烈分析力，带来高效决策和资源优化，这往往导致成功积累，但需避免过度计算。",
        "exalted": "你的智力转化为极强的财务智慧与规划，成为资源管理专家，能直觉地抓住机会并长期受益。"
      },
      "3": {
        "low": "学习沟通中你易分心，表达不清晰，容易误解他人或被误解，建议专注训练来改善注意力。",
        "medium": "你的智力在交流与学习中活跃，思维灵活多变，这让你在短期互动中感到充实和有趣。",
        "high": "你在沟通中展现天才般的思维，智力成为核心力量，能深刻影响他人观点，但可能导致辩论过度。",
        "exalted": "你的表达具有极高的感染力和深度，在学习领域如鱼得水，成为思想的传播者和创新者。"
      },
      "4": {
        "low": "家庭中你的思维受限，根基智力弱，容易因情绪影响判断或回忆混乱，建议通过家庭讨论重建清晰。",
        "medium": "你通过家庭环境发展智力，注重回忆和根源学习，这让你在情感基础中更显智慧。",
        "high": "你的思维在根基中深刻影响家庭，带来智慧传承和深度对话，但需避免过于理性忽略感情。",
        "exalted": "你的智力在家庭中表现出极强的洞察力，成为情感导师和家族智慧的守护者。"
      },
      "5": {
        "low": "在创造中你的思维拘谨，浪漫表达不流畅，容易缺乏灵感和幽默，建议通过游戏释放。",
        "medium": "你通过创意展现智力，浪漫中聪明机智，这让你在娱乐领域更具吸引力。",
        "high": "你的思维在恋爱创作中耀眼，充满活力和巧思，这带来天才般的表达，但需控制冲动性。",
        "exalted": "你的表达在艺术中极具创新与魅力，成为浪漫和创意的灵感源泉。"
      },
      "6": {
        "low": "你在工作中思维开阔，但有时略显发散，系统性分析和细节关注有待加强，可能导致执行中的疏漏。建议善用任务清单与核查表（checklist），建立结构化工作流程，以提升精准度与可靠性。",
        "medium": "你将智力投入日常服务，注重效率和实用，这让你在工作管理中更系统化。",
        "high": "你在工作中思维高效且具有主导性，展现出出色的专业素养与分析能力，常能带来卓越表现；但需留意完美主义倾向，避免过度追求细节而影响整体节奏与灵活性。",
        "exalted": "你的智力在服务中展现极强的分析力和奉献，成为健康和工作的专家。"
      },
      "7": {
        "low": "关系中你的沟通混乱，伙伴互动不顺，容易误会和争执，建议学习倾听技巧。",
        "medium": "你通过关系发展智力表达，注重外交和平衡，这让你在合作中更注重互惠。",
        "high": "你的思维在亲密中强势影响，带来智慧互动和深度对话。",
        "exalted": "你的沟通在伙伴中极具外交智慧和深度，成为关系中的调解者和思想伙伴。"
      },
      "8": {
        "low": "你在转化过程中思维较为模糊，亲密表达存在困难，容易隐藏真实想法，长期可能引发关系中的不信任。建议通过书写日记（journaling）的方式梳理思绪，澄清内在感受，提升沟通的清晰度与情感的流动性。",
        "medium": "你通过深层调查展现智力，追求真相和洞察，这让你在共享中更具分析。",
        "high": "你的思维在亲密中深刻洞察，带来强大分析和再生潜力。",
        "exalted": "你的智力在转化中极具再生力量和深度，成为秘密的揭开者和疗愈者。"
      },
      "9": {
        "low": "探索中你的思维狭隘，旅行表达弱，容易停滞和偏见，建议多阅读扩展。",
        "medium": "你通过探索扩展智力，追求更高知识和视野，这让你在哲思中感到充实。",
        "high": "你的思维在远方中开阔主导，充满智慧和冒险精神。",
        "exalted": "你的表达在哲思中极具创新和视野，成为导师和探索先锋。"
      },
      "10": {
        "low": "事业中你的思维不够稳定，形象表达能力较弱，容易缺乏清晰的策略与长远规划。建议通过寻求导师指导（mentoring）系统学习，提升专业定位与战略思维，增强职业发展的方向感与稳定性。",
        "medium": "你通过成就展现智力规划，注重职业表达和策略。",
        "high": "你的思维在公众中强势策略，带来领导力和影响力。",
        "exalted": "你的智力在事业中极具智慧和专业力，成为行业的思想领袖。"
      },
      "11": {
        "low": "社交中你的思维疏离，愿望表达不准，容易孤立或误解，建议参与讨论组。",
        "medium": "你通过团体发展智力网络，注重创新交流和想法共享。",
        "high": "你的思维在社群中创新主导，带来变革和集体智慧。",
        "exalted": "你的沟通在愿望中极具前瞻力和人道，成为创新者和团队灵感源。"
      },
      "12": {
        "low": "潜意识中你的思维混乱，精神表达弱，容易自我迷惑或焦虑，建议通过冥想澄清。",
        "medium": "你通过内在探索智力，注重潜意识学习和直觉发展。",
        "high": "你的思维在隐秘中深刻直觉，带来启示和精神深度。",
        "exalted": "你的智力在精神中极具启示力和深度，成为内在导师和疗愈者。"
      }
    },
    "venus": {
      "1": {
        "low": "你的爱美表达较为拘谨，外在魅力不明显，容易给人冷淡或保守的印象，这可能会影响社交初遇，建议通过培养个人风格和微笑练习来增强吸引力。",
        "medium": "你通过外在形象展现爱美的一面，注重和谐与优雅，这让你在第一印象中给人温暖而迷人的感觉，但需避免过于注重外表而忽略内在深度。",
        "high": "你的魅力在外在中强势吸引，个性充满优雅与社交魅力，能轻易成为人群焦点，这带来强烈的吸引力，但可能导致虚荣倾向，需要平衡谦逊。",
        "exalted": "你的外在表达极具优雅与感染力，成为社交中的调解者和焦点，能通过美感与和谐影响他人，但需保持真实以避免表面化。"
      },
      "2": {
        "low": "在价值领域你的爱美感较弱，财务决策不稳，容易忽略享乐与舒适，建议通过预算规划和小型奢侈来重建物质满足感。",
        "medium": "你将爱美投入物质追求，注重舒适与美感的环境，这让你在财务管理中更注重质量而非数量，但需避免过度消费。",
        "high": "你对财富和价值有强烈的认同，积极追求丰裕的生活，这带来物质稳定，但可能导致对拥有的执着，需要学会分享。",
        "exalted": "你的爱美转化为极强的丰裕与享受感，能自然吸引资源，成为财富的守护者，但记得通过慷慨平衡贪婪。"
      },
      "3": {
        "low": "沟通中你的爱美表达不流畅，学习较为拘谨，容易显得浅薄或不善社交，建议通过阅读艺术书籍提升。",
        "medium": "你通过交流展现爱美魅力，言语优雅动人，这让你在学习互动中更注重和谐与美感。",
        "high": "你的言语在学习中优雅主导，充满社交智慧和魅力，这带来说服力和吸引力。",
        "exalted": "你的表达具有极高的艺术与外交感染力，在沟通领域成为调解者和灵感源。"
      },
      "4": {
        "low": "家庭中你的爱美和谐较弱，根基不稳，容易忽略温暖与美感，建议通过家居装饰来增强。",
        "medium": "你通过家庭建立爱美基础，注重家居美感和情感和谐，这让你在根基建设中更注重舒适。",
        "high": "你的爱在根基中温暖主导，带来和谐连结和家庭美感。",
        "exalted": "你的和谐在家庭中极具滋养与美感力量，成为情感的守护者和美化者。"
      },
      "5": {
        "low": "浪漫中你的爱美较为保守，创意不明显，容易拘谨或缺乏激情，建议通过约会活动释放。",
        "medium": "你通过恋爱展现爱美表达，追求浪漫和谐，这让你在娱乐中更注重美感和乐趣。",
        "high": "你的魅力在创作中耀眼热情，充满活力和吸引力。",
        "exalted": "你的爱在浪漫中极具艺术天赋和感染力，成为创意与激情的源泉。"
      },
      "6": {
        "low": "服务中你的爱美效率较低，健康不稳，容易忽略细节与和谐，建议通过养生美学改善。",
        "medium": "你通过工作追求爱美和谐，注重服务中的美感和效率。",
        "high": "你的爱在日常中勤勉而富有主导性，默默奉献且不失优雅，用持续的行动诠释深情，为关系注入稳定与美感。",
        "exalted": "你的和谐在服务中极具疗愈与优雅力，成为工作的美化者和治愈者。"
      },
      "7": {
        "low": "关系中你的爱美较为依赖，伙伴不稳，容易妥协过多而失去平衡，建议通过沟通重建。",
        "medium": "你通过伴侣建立爱美平衡，注重关系和谐与互惠。",
        "high": "你的爱在亲密中强势和谐，带来深度连结和吸引力。",
        "exalted": "你的和谐在关系中极具融合与魅力力量，成为伙伴的灵感源。"
      },
      "8": {
        "low": "亲密中你的爱美较为脆弱，转化不顺，容易回避深度与占有，建议通过信任练习探索。",
        "medium": "你通过深层展现爱美深度，追求亲密和谐与再生。",
        "high": "你的爱在转化中强烈占有，带来再生潜力与力量。",
        "exalted": "你的和谐在亲密中极具深度与疗愈力，成为转化的催化剂。"
      },
      "9": {
        "low": "探索中你的爱美缺乏，旅行不稳，容易忽略理想与美感，建议通过文化之旅扩展。",
        "medium": "你通过哲思追求爱美视野，注重文化和谐与探索。",
        "high": "你的爱在远方中开阔主导，充满乐观与魅力。",
        "exalted": "你的和谐在哲学中极具灵性和美感力量，成为导师。"
      },
      "10": {
        "low": "事业中你的爱美形象较弱，成就不显，容易表面化，建议通过专业造型提升。",
        "medium": "你通过公众展现爱美策略，注重形象和谐与外交。",
        "high": "你的魅力在形象中强势领导，带来社交成功。",
        "exalted": "你的爱在事业中极具优雅与感染力，成为公众偶像。"
      },
      "11": {
        "low": "社交中你的爱美较为疏离，愿望不稳，容易孤立，建议通过团体活动参与。",
        "medium": "你通过团体追求爱美网络，注重社交和谐与合作。",
        "high": "你的爱在社群中创新主导，带来人道与魅力。",
        "exalted": "你的和谐在愿望中极具集体与感染力量，成为变革者。"
      },
      "12": {
        "low": "精神中你的爱美模糊，潜意识不稳，容易幻灭或逃避，建议通过艺术冥想澄清。",
        "medium": "你通过内在展现爱美梦幻，注重精神和谐与直觉。",
        "high": "你的爱在隐秘中深刻直觉，带来启示与深度。",
        "exalted": "你的和谐在精神中极具溶解与疗愈力量，成为内在治愈者。"
      }
    },
    "mars": {
      "1": {
        "low": "你的行动表达较为拘谨，外在活力不明显，容易给人被动或保守的印象，这可能会影响你在社交中的主动性，建议通过体育活动来增强自信和外在能量。",
        "medium": "你通过形象展现行动力，注重勇敢和决断的第一印象，这让你在初遇中给人可靠而有动力的感觉，但需避免冲动以保持平衡。",
        "high": "你的激情在外在中强势勇敢，个性充满活力和决心，能自然成为领导者，这带来强烈的吸引力和影响力，但可能导致过于支配，需要学会合作。",
        "exalted": "你的行动在外在极具领导与感染力，成为变革先锋，能通过决心和勇气激励他人，但需注意不要过度冒险而忽略后果。"
      },
      "2": {
        "low": "在财务领域你的行动犹豫，价值判断不稳，容易错失投资机会，建议通过小额实践来积累经验和自信。",
        "medium": "你将激情投入物质追求，注重资源竞争和积累，这让你在财务管理中更具动力和坚持。",
        "high": "你的行动在财富中坚持主导，积极争取和维护安全基础，这往往带来物质成功，但可能导致对拥有的占有欲。",
        "exalted": "你的活力转化为极强的财务动力和耐力，能通过决心吸引资源，成为财富的守护者。"
      },
      "3": {
        "low": "沟通中你的行动散乱，学习不准，容易争论无果或表达冲动，建议通过辩论训练来改善。",
        "medium": "你通过交流展现激情，思维快速而决断，这让你在学习互动中更具活力。",
        "high": "你的行动在学习中机智主导，充满辩论力和快速反应，这带来强烈的表达潜力。",
        "exalted": "你的表达具有极高的争论与智力感染力，在沟通领域成为先锋和说服者。"
      },
      "4": {
        "low": "家庭中你的行动依赖，根基弱，容易情绪冲突或回避责任，建议通过家庭活动增强。",
        "medium": "你通过家庭保护激情，注重防御和稳定，这让你在根基建设中更具决心。",
        "high": "你的活力在根基中防御主导，带来强烈的保护力和家庭连结。",
        "exalted": "你的行动在家庭中极具稳定与守护力量，成为情感的支柱和变革者。"
      },
      "5": {
        "low": "浪漫中你的行动拘谨，创意不明显，容易缺乏热情和冒险，建议通过约会释放。",
        "medium": "你通过恋爱展现激情，追求互动中的决断和活力，这让你在娱乐中更具吸引力。",
        "high": "你的行动在创作中热情主导，充满活力和征服欲，这带来强烈的浪漫潜力。",
        "exalted": "你的活力在浪漫中极具征服与魅力力量，成为激情的源泉和创意者。"
      },
      "6": {
        "low": "工作中你的行动低效，健康不稳，容易耗尽精力或忽略细节，建议通过规划改善。",
        "medium": "你通过服务追求激情，注重日常竞争和效率，这让你在管理中更具动力。",
        "high": "你的行动在日常中勤奋主导，带来强烈的奉献和专业性。",
        "exalted": "你的活力在健康中极具纪律与持久力量，成为工作的先锋。"
      },
      "7": {
        "low": "关系中你的行动冲突，伙伴不稳，容易争执或支配，建议通过妥协平衡。",
        "medium": "你通过伴侣展现激情，注重主张和互动，这让你在合作中更具活力。",
        "high": "你的行动在亲密中主张主导，带来动态和强度。",
        "exalted": "你的活力在关系中极具平衡与合作力量，成为伙伴的动力源。"
      },
      "8": {
        "low": "转化中你的行动脆弱，亲密不顺，容易回避冲突或深度，建议通过挑战探索。",
        "medium": "你通过深层展现激情，追求再生和力量，这让你在共享中更具决心。",
        "high": "你的行动在转化中占有主导，带来强烈的再生潜力。",
        "exalted": "你的活力在亲密中极具深度与再生力量，成为转化的催化剂。"
      },
      "9": {
        "low": "探索中你的行动力不足，旅行节奏不稳，容易陷入鲁莽冲动或停滞不前。建议通过“规划冒险”——即在有序准备中融入未知挑战，以平衡冲动与拖延，让探索真正成为成长的旅程。",
        "medium": "你通过哲思追寻激情，将远方视为使命的召唤，在不断拓展视野与信念的过程中，淬炼决断之力，让灵魂在辽阔中扎根生长。",
        "high": "你的行动在远方中由冒险精神主导，充满热情与开阔视野，敢于突破边界，在未知中开辟属于自己的道路。",
        "exalted": "你的活力在哲学中焕发出强大的扩展力与智慧光芒，驱使你不断追问本质、超越常规，成为思想与精神领域的探索先锋。"
      },
      "10": {
        "low": "事业中你的行动犹豫，形象不显，容易退缩或缺乏野心，建议通过目标设定提升。",
        "medium": "你通过成就展现激情，注重竞争和领导。",
        "high": "你的行动在公众中野心主导，带来强烈的影响力。",
        "exalted": "你的活力在事业中极具策略与耐力力量，成为成功典范。"
      },
      "11": {
        "low": "社交中你的行动疏离，愿望不稳，容易叛逆或孤立，建议通过团队活动参与。",
        "medium": "你通过团体追求激情，注重变革和创新。",
        "high": "你的行动在社群中叛逆主导，带来动态和改革。",
        "exalted": "你的活力在愿望中极具集体与解放力量，成为变革者。"
      },
      "12": {
        "low": "精神中你的行动隐藏，潜意识不稳，容易内耗或逃避，建议通过冥想释放。",
        "medium": "你通过内在展现激情，注重直觉和隐秘力量。",
        "high": "你的行动在隐秘中直觉主导，带来深刻的启示。",
        "exalted": "你的活力在精神层面蕴含强大的疗愈力与深度，赋予你坚韧的内在力量，使你成为直面阴影、穿越低谷的真正内在战士。"
      }
    },
    "jupiter": {
      "1": {
        "low": "你的扩展表达较为保守，外在形象不明显乐观，容易自我限制和缺乏自信，这可能会让你在社交初遇中显得拘谨，建议通过积极参与活动来释放内在潜力。",
        "medium": "你通过外在形象展现扩展力，注重自信和开阔的第一印象，这让你在人群中给人温暖而有远见的感受，但需避免过度乐观而忽略现实。",
        "high": "你的乐观在外在中强势自信，个性充满活力和视野，能自然成为激励者，但可能导致自大倾向，需要平衡谦逊以维持关系。",
        "exalted": "你的扩展在外在极具领导与智慧感染力，成为变革导师，能通过远见和热情影响他人，但需注意不要过度扩张而分散焦点。"
      },
      "2": {
        "low": "财务中你的扩展犹豫，价值不稳，容易错失机会或浪费资源，建议通过谨慎规划来重建稳定感。",
        "medium": "你将幸运投入物质追求，注重丰裕和成长的环境，这让你在财务管理中更注重长期投资。",
        "high": "你的扩展在财富中丰裕主导，积极追求机会，这带来物质成功，但可能导致过度消费。",
        "exalted": "你的乐观转化为极强的财务扩展与智慧，能吸引资源，成为丰裕的守护者，但需通过分享平衡贪婪。"
      },
      "3": {
        "low": "学习中你的扩展散漫，沟通不准，容易浅尝辄止或分心，建议通过专注训练提升。",
        "medium": "你通过交流展现幸运，思维开阔而好奇，这让你在学习互动中感到充实。",
        "high": "你的扩展在学习中视野主导，充满智慧和探索欲。",
        "exalted": "你的表达具有极高的哲思与社交感染力，在沟通领域成为智慧传播者。"
      },
      "4": {
        "low": "家庭中你的扩展缺乏，根基不稳，容易忽略温暖与成长，建议通过家庭旅行增强。",
        "medium": "你通过家庭追求幸运，注重扩展根基和情感丰裕。",
        "high": "你的乐观在根基中温暖主导，带来滋养和家庭成长。",
        "exalted": "你的扩展在家庭中极具保护与智慧力量，成为情感导师。"
      },
      "5": {
        "low": "浪漫中你的扩展保守，创意不显，容易缺乏喜悦和冒险，建议通过艺术释放。",
        "medium": "你通过恋爱展现幸运，追求创意扩展和浪漫机会。",
        "high": "你的扩展在创作中喜悦主导，充满热情和天赋。",
        "exalted": "你的乐观在浪漫中极具艺术与成长力量，成为灵感源。"
      },
      "6": {
        "low": "服务中你的扩展懒散，健康不稳，容易忽略机会和效率，建议通过目标设定改善。",
        "medium": "你通过工作追求幸运，注重服务扩展和成长。",
        "high": "你的扩展在日常中机会主导，带来效率和奉献。",
        "exalted": "你的乐观在健康中极具疗愈与智慧力量，成为导师。"
      },
      "7": {
        "low": "关系中你的扩展理想化，伙伴不稳，容易妥协过多或迷失，建议通过沟通平衡。",
        "medium": "你通过伴侣展现幸运，注重关系扩展和和谐成长。",
        "high": "你的扩展在亲密中合作主导，带来幸运连结。",
        "exalted": "你的乐观在关系中极具平衡与智慧力量，成为伙伴导师。"
      },
      "8": {
        "low": "转化中你的扩展过度，亲密不顺，容易冒险或忽略深度，建议通过 introspection 调整。",
        "medium": "你通过深层展现幸运，追求再生扩展和机会。",
        "high": "你的扩展在转化中深度主导，带来力量成长。",
        "exalted": "你的乐观在亲密中极具再生与智慧力量，成为变革者。"
      },
      "9": {
        "low": "哲学中你的扩展极端，旅行不稳，容易迷失或浅薄，建议通过学习深化。",
        "medium": "你通过探索追求幸运，注重视野扩展和哲思。",
        "high": "你的扩展在远方中成长主导，充满冒险和智慧。",
        "exalted": "你的乐观在哲思中极具智慧与灵性力量，成为导师。"
      },
      "10": {
        "low": "事业中你的扩展膨胀，形象不显，容易不实或缺乏纪律，建议通过规划调整。",
        "medium": "你通过成就展现幸运，注重事业扩展和机会。",
        "high": "你的扩展在公众中成功主导，带来领导力和成长。",
        "exalted": "你的乐观在事业中极具野心与成就力量，成为偶像。"
      },
      "11": {
        "low": "社交中你的扩展疏离，愿望不稳，容易孤立或理想化，建议通过团体参与。",
        "medium": "你通过团体追求幸运，注重网络扩展和合作。",
        "high": "你的扩展在社群中网络主导，带来创新和人道。",
        "exalted": "你的乐观在愿望中极具集体与智慧力量，成为变革者。"
      },
      "12": {
        "low": "精神中你的扩展幻觉，潜意识不稳，容易逃避或迷失，建议通过冥想澄清。",
        "medium": "你通过内在展现幸运，注重精神扩展和直觉。",
        "high": "你的扩展在隐秘中灵性主导，带来启示和深度。",
        "exalted": "你的乐观在精神中极具疗愈与融合力量，成为导师。"
      }
    },
    "saturn": {
      "1": {
        "low": "你的责任表达较为保守，外在形象严肃而拘谨，容易给人冷峻或难以接近的感觉，这可能会影响社交初遇，建议通过渐进的自律练习来增强自信和外在温暖。",
        "medium": "你通过外在形象展现纪律的一面，注重稳重和责任感，这让你在第一印象中给人可靠而成熟的感受，但需避免过于严肃而忽略人情味。",
        "high": "你的责任在外在中强势耐力，个性充满结构和坚持，能自然成为权威人物，这带来强大的领导潜力，但可能导致情感封闭，需要学会柔软。",
        "exalted": "你的结构在外在极具稳定与领导力量，成为他人榜样，能通过纪律和智慧影响周围，但需平衡严谨与人文关怀。"
      },
      "2": {
        "low": "在价值领域你的责任感较弱，财务决策不稳，容易恐惧短缺或过度节俭，建议通过预算规划重建稳定感。",
        "medium": "你将纪律投入物质管理，注重长期积累和价值建设，这让你在财务中更注重耐力和规划。",
        "high": "你的责任在财富中稳定主导，积极维护和增长资源，这带来物质安全，但可能导致对拥有的严苛。",
        "exalted": "你的结构转化为极强的财务耐力和智慧，能通过坚持吸引稳定，但需通过分享避免吝啬。"
      },
      "3": {
        "low": "学习中你的责任抑制表达，沟通不准，容易自我怀疑或过于谨慎，建议通过专注训练提升。",
        "medium": "你通过交流展现纪律，思维严谨而专注，这让你在学习互动中更注重深度和准确。",
        "high": "你的责任在学习中专注主导，带来深刻分析和持久努力。",
        "exalted": "你的结构在表达中极具智慧与组织力，成为思想的守护者和导师。"
      },
      "4": {
        "low": "家庭中你的责任冷峻，根基不稳，容易情感封闭或忽略滋养，建议通过家庭结构重建温暖。",
        "medium": "你通过家庭建立纪律，注重结构和长期基础，这让你在根基建设中更注重责任和稳定。",
        "high": "你的责任在根基中结构主导，带来家庭的持久连结。",
        "exalted": "你的结构在家庭中极具保护与耐力力量，成为情感的支柱。"
      },
      "5": {
        "low": "浪漫中你的责任抑制创意，表达不显，容易缺乏喜悦和灵活，建议通过小目标释放。",
        "medium": "你通过恋爱展现纪律，追求持久和承诺的关系。",
        "high": "你的责任在创作中持久主导，带来深度和奉献。",
        "exalted": "你的结构在浪漫中极具平衡与持久力量，成为连结的守护者。"
      },
      "6": {
        "low": "服务中你的责任负担过重，健康不稳，容易过度工作或忽略休息，建议通过时间管理平衡。",
        "medium": "你通过工作追求纪律，注重效率和实用结构。",
        "high": "你的责任在日常中效率主导，带来专业和持久努力。",
        "exalted": "你的结构在健康中极具奉献与疗愈力量，成为工作的典范。"
      },
      "7": {
        "low": "关系中你的责任限制互动，伙伴不稳，容易承诺恐惧或过于严肃，建议通过沟通柔软。",
        "medium": "你通过伴侣展现纪律，注重长期承诺和平衡。",
        "high": "你的责任在亲密中承诺主导，带来忠诚和稳定。",
        "exalted": "你的结构在关系中极具平衡与持久力量，成为伙伴的支柱。"
      },
      "8": {
        "low": "转化中你的责任恐惧深度，亲密不顺，容易回避冲突或变化，建议通过面对阴影探索。",
        "medium": "你通过深层展现纪律，追求再生结构和力量。",
        "high": "你的责任在转化中深度主导，带来持久再生。",
        "exalted": "你的结构在亲密中极具再生与智慧力量，成为变革的守护者。"
      },
      "9": {
        "low": "哲学中你的责任教条，旅行不稳，容易狭隘或忽略扩展，建议通过学习开阔。",
        "medium": "你通过探索追求纪律，注重智慧和长期成长。",
        "high": "你的责任在远方中智慧主导，带来深刻视野。",
        "exalted": "你的结构在哲思中极具成长与平衡力量，成为导师。"
      },
      "10": {
        "low": "事业中你的责任压力过大，形象不显，容易自我怀疑或退缩，建议通过导师指导提升。",
        "medium": "你通过成就展现纪律，注重结构和长期目标。",
        "high": "你的责任在公众中领导主导，带来成就和权威。",
        "exalted": "你的结构在事业中极具平衡与成就力量，成为榜样。"
      },
      "11": {
        "low": "社交中你的责任孤立，愿望不稳，容易感到负担或疏离，建议通过团体责任平衡。",
        "medium": "你通过团体追求纪律，注重忠诚和结构网络。",
        "high": "你的责任在社群中忠诚主导，带来稳定连结。",
        "exalted": "你的结构在愿望中极具组织与平衡力量，成为集体守护者。"
      },
      "12": {
        "low": "精神中你的责任孤独，潜意识不稳，容易自我压抑或逃避，建议通过冥想释放。",
        "medium": "你通过内在展现纪律，注重精神结构和内省。",
        "high": "你的责任在隐秘中内省主导，带来深刻启示。",
        "exalted": "你的结构在精神中极具疗愈与平衡力量，成为内在导师。"
      }
    },
    "uranus": {
      "1": {
        "low": "你的创新表达较为保守，外在形象不明显独特，容易给人传统或循规蹈矩的印象，这可能会限制你的个人自由，建议通过尝试新风格来释放内在叛逆。",
        "medium": "你通过外在形象展现独特的一面，注重独立和创新，这让你在第一印象中给人前卫而有趣的感觉，但需避免过于突兀而引起误解。",
        "high": "你的变革在外在中强势独立，个性充满意外和原创力，能自然成为变革者，这带来强烈的吸引力，但可能导致疏离感，需要平衡社交。",
        "exalted": "你的创新在外在极具感染力和前瞻性，成为先锋和灵感源，能通过独特魅力影响他人，但需注意不要过度叛逆而忽略稳定。"
      },
      "2": {
        "low": "财务中你的创新不稳，价值判断混乱，容易因突发变动而损失，建议通过保守投资来保护资源。",
        "medium": "你将独特投入物质追求，注重创新资源管理，这让你在财务中更具灵活性。",
        "high": "你的变革在财富中创意主导，积极追求意外机会，这带来资源突破，但可能导致不稳定。",
        "exalted": "你的创新转化为极强的财务改革力和直觉，能吸引非传统资源，成为财富的革新者。"
      },
      "3": {
        "low": "沟通中你的创新混乱，学习不准，容易想法跳跃而无果，建议通过结构训练改善。",
        "medium": "你通过交流展现独特，思维前卫而发明性，这让你在学习互动中更具灵感。",
        "high": "你的变革在学习中发明主导，充满意外洞察。",
        "exalted": "你的表达具有极高的科技智慧和感染力，在沟通领域成为先锋。"
      },
      "4": {
        "low": "家庭中你的创新颠覆，根基不稳，容易因叛逆而冲突，建议通过对话平衡。",
        "medium": "你通过家庭追求独特，注重改革根基。",
        "high": "你的变革在根基中改革主导，带来家庭突破。",
        "exalted": "你的创新在家庭中极具解放与前瞻力量，成为变革守护者。"
      },
      "5": {
        "low": "浪漫中你的创新意外，创意不显，容易缺乏稳定，建议通过实验释放。",
        "medium": "你通过恋爱展现独特，追求创意互动。",
        "high": "你的变革在创作中原创主导，充满活力。",
        "exalted": "你的创新在浪漫中极具天才与魅力力量。"
      },
      "6": {
        "low": "服务中你的创新颠覆，健康不稳，容易突发问题，建议通过规划稳定。",
        "medium": "你通过工作追求独特，注重效率变革。",
        "high": "你的变革在日常中效率主导，带来创新。",
        "exalted": "你的创新在健康中极具科技与疗愈力量。"
      },
      "7": {
        "low": "关系中你的创新不稳，伙伴叛逆，容易冲突，建议通过沟通解放。",
        "medium": "你通过伴侣展现独特，注重自由互动。",
        "high": "你的变革在亲密中自由主导，带来动态。",
        "exalted": "你的创新在关系中极具解放与平衡力量。"
      },
      "8": {
        "low": "转化中你的创新危机，亲密不顺，容易突发，建议通过面对探索。",
        "medium": "你通过深层展现独特，追求再生变革。",
        "high": "你的变革在转化中深度主导，带来力量。",
        "exalted": "你的创新在亲密中极具再生与直觉力量。"
      },
      "9": {
        "low": "哲学中你的创新极端，旅行不稳，容易迷失，建议通过学习稳定。",
        "medium": "你通过探索追求独特，注重视野变革。",
        "high": "你的变革在远方中视野主导，充满冒险。",
        "exalted": "你的创新在哲思中极具革命与智慧力量。"
      },
      "10": {
        "low": "事业中你的创新颠覆，形象不显，容易退缩，建议通过目标提升。",
        "medium": "你通过成就展现独特，注重领导变革。",
        "high": "你的变革在公众中领导主导，带来影响力。",
        "exalted": "你的创新在事业中极具前瞻与策略力量。"
      },
      "11": {
        "low": "社交中你的创新疏离，愿望不稳，容易孤立，建议通过团队参与。",
        "medium": "你通过团体追求独特，注重网络变革。",
        "high": "你的变革在社群中网络主导，带来集体创新。",
        "exalted": "你的创新在愿望中极具人道与解放力量。"
      },
      "12": {
        "low": "精神中你的创新混乱，潜意识不稳，容易自我颠覆，建议通过冥想澄清。",
        "medium": "你通过内在展现独特，注重直觉变革。",
        "high": "你的变革在隐秘中直觉主导，带来启示。",
        "exalted": "你的创新在精神中极具启示与疗愈力量。"
      }
    },
    "neptune": {
      "1": {
        "low": "你的灵感表达较为模糊，外在形象梦幻而缺乏清晰轮廓，容易给人神秘或不切实际的印象，可能造成他人难以真正贴近。建议通过扎根（grounding）练习，平衡内在幻想与现实需求，让灵性之美得以在现实中落地生辉。",
        "medium": "你通过外在形象展现梦幻的一面，注重灵性和直觉，这让你在第一印象中给人温柔而有魅力的感觉，但需避免过度理想化而忽略界限。",
        "high": "你的幻象在外在表现中具有强烈吸引力，个性充满灵感与艺术气息，能自然成为他人心灵的启发者，散发出独特的魅力与感召力；但需警惕与现实脱节的倾向，建议通过扎根（grounding）练习，将灵性能量稳固于现实土壤，实现内在愿景的可持续表达。",
        "exalted": "你的灵感在外在表现中极具感染力与深度，使你成为灵性领域的先锋，能以梦幻般的魅力触动并影响他人；但需扎根真实自我，避免过度理想化，以防期待落空带来的幻灭，让光芒持久而真切。"
      },
      "2": {
        "low": "在价值领域你的灵感混乱，财务决策不稳，容易幻想财富而忽略实际，建议通过预算来重建稳定。",
        "medium": "你将梦幻投入物质追求，注重直觉价值，这让你在财务中更注重灵性满足。",
        "high": "你的灵感在财富中直觉主导，积极追求理想资源，这带来意外丰裕。",
        "exalted": "你的幻觉转化为极强的财务启示和艺术价值，能吸引非传统资源。"
      },
      "3": {
        "low": "沟通中你的灵感较为模糊，学习时专注力不足，容易想法飘忽、缺乏落实，导致难以产出成果。建议通过书写日记（journaling）梳理思绪，将零散灵感转化为清晰表达，提升沟通有效性与学习执行力。",
        "medium": "你通过交流展现梦幻，思维富有想象，这让你在学习中更具创意。",
        "high": "你的灵感在学习中创意主导，充满诗意表达。",
        "exalted": "你的表达具有极高的艺术智慧和感染力，在沟通领域成为诗人。"
      },
      "4": {
        "low": "家庭中你的灵感逃避，根基不稳，容易幻想而忽略现实，建议通过家庭冥想平衡。",
        "medium": "你通过家庭追求梦幻，注重情感灵性。",
        "high": "你的灵感在根基中温暖主导，带来家庭启示。",
        "exalted": "你的幻觉在家庭中极具滋养和疗愈力量。"
      },
      "5": {
        "low": "浪漫中你的灵感理想化，创意不显，容易失望，建议通过艺术释放。",
        "medium": "你通过恋爱展现梦幻，追求艺术浪漫。",
        "high": "你的灵感在创作中艺术主导，充满魅力。",
        "exalted": "你的幻觉在浪漫中极具天赋和感染力。"
      },
      "6": {
        "low": "服务中你的灵感混沌，健康状态不稳，容易忽略个人边界，导致耗损与失衡。建议通过建立日常规律（routine）与扎根练习（grounding），稳定身心能量，明晰界限，让奉献真正可持续且有力量。",
        "medium": "你通过工作追求梦幻，注重服务灵性。",
        "high": "你的灵感在日常中同理主导，带来疗愈。",
        "exalted": "你的幻觉在健康中极具奉献和启示力。"
      },
      "7": {
        "low": "关系中你的灵感幻灭，伙伴不稳，容易理想化，建议通过沟通现实化。",
        "medium": "你通过伴侣展现梦幻，注重关系灵性。",
        "high": "你的灵感在亲密中融合主导，带来深度。",
        "exalted": "你的幻觉在关系中极具溶解和疗愈力。"
      },
      "8": {
        "low": "转化中你的灵感欺骗，亲密不顺，容易回避，建议通过面对阴影。",
        "medium": "你通过深层展现梦幻，追求再生灵性。",
        "high": "你的灵感在转化中深度主导，带来启示。",
        "exalted": "你的幻觉在亲密中极具再生和直觉力。"
      },
      "9": {
        "low": "哲学中你的灵感容易迷失，旅行与探索缺乏稳定性，易陷入幻觉或脱离现实。建议通过系统学习与扎根练习（grounding），将抽象思想锚定于实际经验，实现智慧的清醒延展。",
        "medium": "你通过探索追寻梦幻，注重视野的辽阔与灵性的深度，在未知中寻找意义，让旅程本身成为灵魂的觉醒之路。",
        "high": "你的灵感在远方由灵性主导，充满启示，如星辰引路，在未知中捕捉深层意义，将每一次远行转化为灵魂的觉醒与内在真理的回响。",
        "exalted": "你的幻觉在哲思中蕴含深邃智慧与强大的融合力，能穿透表象，连接对立，于虚实之间孕育洞见，使思想在超越中达成新的统一。"
      },
      "10": {
        "low": "事业中你的灵感不实，形象不显，容易失望，建议通过目标现实化。",
        "medium": "你通过成就展现梦幻，注重形象灵性。",
        "high": "你的灵感在公众中视野主导，带来魅力。",
        "exalted": "你的幻觉在事业中极具感染和前瞻力。"
      },
      "11": {
        "low": "社交中你的灵感疏离，愿望不稳，容易孤立，建议通过团体冥想。",
        "medium": "你通过团体追求梦幻，注重人道灵性。",
        "high": "你的灵感在社群中人道主导，带来集体。",
        "exalted": "你的幻觉在愿望中极具融合和启示力。"
      },
      "12": {
        "low": "精神中你的灵感溶解，潜意识不稳，容易迷失，建议通过艺术澄清。",
        "medium": "你通过内在展现梦幻，注重精神融合。",
        "high": "你的灵感在隐秘中启示主导，带来深度。",
        "exalted": "你的幻觉在精神中极具疗愈和溶解力。"
      }
    },
    "pluto": {
      "1": {
        "low": "你的转变表达较为保守，外在形象不明显力量，容易给人神秘或封闭的印象，这可能会限制你的个人再生，建议通过自我探索来释放内在潜力。",
        "medium": "你通过外在形象展现再生的一面，注重深度和变革，这让你在第一印象中给人强大而有深度的感觉，但需避免过于控制而引起距离感。",
        "high": "你的权力在外在中强势深度，个性充满转变和强度，能自然成为催化者，这带来强烈的磁性和影响力，但可能导致占有欲，需要平衡分享。",
        "exalted": "你的转变在外在极具再生与感染力，成为变革先锋，能通过深度魅力影响他人，但需注意不要过度破坏而忽略重建。"
      },
      "2": {
        "low": "财务中你的转变占有不稳，价值判断混乱，容易因危机而损失，建议通过谨慎管理来保护资源。",
        "medium": "你将再生投入物质追求，注重资源深度，这让你在财务中更具直觉和持久。",
        "high": "你的权力在财富中深度主导，积极追求转变机会，这带来资源重生，但可能导致控制欲。",
        "exalted": "你的转变转化为极强的财务力量和再生，能吸引深层资源，成为财富的转化者。"
      },
      "3": {
        "low": "沟通中你的转变操纵，学习不准，容易隐藏想法而误导，建议通过诚实练习改善。",
        "medium": "你通过交流展现再生，思维深度而调查性，这让你在学习中更具洞察。",
        "high": "你的权力在学习中洞察主导，充满深刻分析。",
        "exalted": "你的转变在表达中极具深度智慧和感染力，在沟通领域成为揭秘者。"
      },
      "4": {
        "low": "家庭中你的转变创伤，根基不稳，容易因过去而封闭，建议通过疗愈重建。",
        "medium": "你通过家庭追求再生，注重情感深度。",
        "high": "你的权力在根基中深度主导，带来家庭重生。",
        "exalted": "你的转变在家庭中极具疗愈与保护力量，成为情感催化剂。"
      },
      "5": {
        "low": "浪漫中你的转变戏剧，创意不显，容易缺乏深度，建议通过实验释放。",
        "medium": "你通过恋爱展现再生，追求激情深度。",
        "high": "你的权力在创作中激情主导，充满转变力。",
        "exalted": "你的转变在浪漫中极具天赋与再生力量。"
      },
      "6": {
        "low": "服务中你的转变危机，健康不稳，容易突发问题，建议通过规划稳定。",
        "medium": "你通过工作追求再生，注重效率深度。",
        "high": "你的权力在日常中深度主导，带来变革。",
        "exalted": "你的转变在健康中极具疗愈与再生力量。"
      },
      "7": {
        "low": "关系中你的转变权力，伙伴不稳，容易冲突，建议通过平衡探索。",
        "medium": "你通过伴侣展现再生，注重深度互动。",
        "high": "你的权力在亲密中融合主导，带来转变。",
        "exalted": "你的转变在关系中极具深度与再生力量。"
      },
      "8": {
        "low": "转化中你的转变黑暗，亲密不顺，容易回避，建议通过面对释放。",
        "medium": "你通过深层展现再生，追求权力平衡。",
        "high": "你的权力在转化中重生主导，带来强度。",
        "exalted": "你的转变在亲密中极具再生与深度力量。"
      },
      "9": {
        "low": "哲学中你的转变极端，旅行不稳，容易危机，建议通过学习平衡。",
        "medium": "你通过探索追求再生，注重视野深度。",
        "high": "你的权力在远方中智慧主导，充满变革。",
        "exalted": "你的转变在哲思中极具启示与再生力量。"
      },
      "10": {
        "low": "事业中你的转变崩坏，形象不显，容易退缩，建议通过目标重建。",
        "medium": "你通过成就展现再生，注重领导深度。",
        "high": "你的权力在公众中领导主导，带来影响力。",
        "exalted": "你的转变在事业中极具权力与再生力量。"
      },
      "11": {
        "low": "社交中你的转变颠覆，愿望不稳，容易孤立，建议通过团体平衡。",
        "medium": "你通过团体追求再生，注重网络深度。",
        "high": "你的权力在社群中改革主导，带来集体。",
        "exalted": "你的转变在愿望中极具人道与再生力量。"
      },
      "12": {
        "low": "精神中你的转变毁灭，潜意识不稳，容易内耗，建议通过冥想释放。",
        "medium": "你通过内在展现再生，注重精神深度。",
        "high": "你的权力在隐秘中启示主导，带来深刻。",
        "exalted": "你的转变在精神中极具疗愈与再生力量。"
      }
    }
  }
}